{"Adding-Gameplay-Verbs-and-Goals":{"slug":"Adding-Gameplay-Verbs-and-Goals","filePath":"Adding Gameplay Verbs and Goals.md","title":"Adding Gameplay Verbs and Goals","links":["Atomizing-and-Abstracting-Game-Mechanics","Roles-(Design-Pattern)","Practical-Creativity-by-Raph-Koster,-GDC-2014","Game-Design-Patterns"],"tags":[],"content":"Because most games are made of other games, they typically have multiple goals running at the same time. One of the most effective ways to keep players engaged is to introduce verbs and goals that are in conflict or competition with each other. Even if one goal might be of a higher priority than the others, this tension forces players to make decisions from moment to moment.\nAssigning different verbs and goals to individual players is an absolutely critical part of multiplayer design, and is the essence of the Roles (Design Pattern)\n\nPractical Creativity by Raph Koster, GDC 2014\nGame Design Patterns"},"Adding-a-Mechanical-Statistic":{"slug":"Adding-a-Mechanical-Statistic","filePath":"Adding a Mechanical Statistic.md","title":"Adding a Mechanical Statistic","links":["Koster's-Taxonomy-of-Games","Practical-Creativity-by-Raph-Koster,-GDC-2014"],"tags":[],"content":"Extending an existing statistic fails to present the player with a to challenge or tool and is generally regarded as a boring and tedious addition to a given system. Introducing a novel statistic can present a new rule to engage with, possibly even turning a Reskin into a Variant. Too many statistics can drag down a game, so it’s equally valuable to experiment with removing statistics as new ones are introduced.\n\nPractical Creativity by Raph Koster, GDC 2014"},"Agenda-Card":{"slug":"Agenda-Card","filePath":"Agenda Card.md","title":"Agenda Card","links":["Bullet-Journal","Calendar","Habit-Tracker","Habit-Score-Cards","Task-Manager","ToDo-List","My-Analog-Productivity-and-PKM-System"],"tags":[],"content":"This is the core of my system. Based on a common Bullet Journal spread, this one card has cleaned up the overwhelming majority of my system complexity. It is a Calendar, Habit Tracker and Habit Score Cards, and Task Manager all in one. Extreme portability makes it effortless to keep at hand, and it takes a single glance to remember the entire landscape of the next few weeks - a whole month if you choose to carry two cards instead of the one. The weekly ToDo List on the back helps to keep recurring tasks at the top of mind while keeping my general list uncluttered.\n\nMy Analog Productivity and PKM System"},"Agent":{"slug":"Agent","filePath":"Agent.md","title":"Agent","links":["Telos","Alfred-North-Whitehead","Process-Philosophy","Sociocybernetics","Archetypes","Phenomenology-of-Agency"],"tags":[],"content":"\nA discrete process of intentional actualization oriented towards a distinct Telos.\n\nI’m using the term Process broadly in the Whitehead-ian sense of a procession of occasions of experience. It’s here I acknowledge Process Ontology as a necessary logical prior to my working definition of “Agent” that you may-or-may-not share.\nIt suspect requires the capacity to experience and select, but not necessarily cognition. A sunflower and experience the direction of the sun, and selectively orient itself towards it - in that sense I’d describe the sunflower as definitively demonstrating agency while its capacity for cognition remains metaphysically ambiguous.\nThis category can (obviously) include biological agents such as animals and plants; however, this umbrella also covers what can be described as Sociocybernetic agents (such as states, corporations, religious organizations), as well as metaphysical agents such as spirits, deities, and Archetypes (which affect change in the world regardless of assumed ontological validity).\n\nPhenomenology of Agency"},"Alfred-North-Whitehead":{"slug":"Alfred-North-Whitehead","filePath":"Alfred North Whitehead.md","title":"Alfred North Whitehead","links":[],"tags":[],"content":""},"Analog-Game-Design":{"slug":"Analog-Game-Design","filePath":"Analog Game Design.md","title":"Analog Game Design","links":["Raph-Koster","Creativity-Through-Context-Replacement","Forcing-Creative-Constraints","Analog","Atomizing-and-Abstracting-Game-Mechanics","Practical-Creativity-by-Raph-Koster,-GDC-2014"],"tags":[],"content":"Working in an analog form forces one to reduce rules constructs down to their most abstract patterns. Raph Koster jokes that all video games are still “turn based” played at 60 turns a second, and with enough experimentation can be efficiently atomized and playtested using physical pieces. It is also an incredible exercise in Creativity Through Context Replacement as well as Forcing Creative Constraints, as mixing and mashing pieces and patterns you normally wouldn’t see next to one another can spark ideas one might not stumble across otherwise.\n\nAnalog\nAtomizing and Abstracting Game Mechanics\nPractical Creativity by Raph Koster, GDC 2014"},"Analytical-Reading":{"slug":"Analytical-Reading","filePath":"Analytical Reading.md","title":"Analytical Reading","links":["Practical-vs.-Theoretical-Books","The-Power-of-Outlining-a-Book","Coming-to-Terms","Propositions","Arguments","Identify-an-Author's-Solutions","Criticizing-a-Book-Fairly","The-Importance-of-Suspending-Judgement","Avoiding-Contentiousness","How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren"],"tags":[],"content":"Reading for the sake of deep understanding. To grasp a book and work at it until it becomes your own. The process of analytical reading require that you ask questions that you will answer for yourself as you come to better understand the text:\n\nWhat is the book about as a whole?\nWhat is said in detail, and how?\nIs the book true, in whole or in part?\nWhat is the significance of what is being said?\n\nRules for Analytical Reading\n\nKnow what kind of book it is before reading. See Practical vs. Theoretical Books\nState the unity of the book on one or a few sentences.\nDefine its parts and how they form the unity. See The Power of Outlining a Book\nDefine the problem(s) the author is trying to solve.\nComing to Termswith the author.\nGrasp the author’s leading Propositions.\nKnow the author’s Arguments.\nIdentify an Author’s Solutions.\nCriticizing a Book Fairly and The Importance of Suspending Judgement\nAvoiding Contentiousness\nRespect the difference between knowledge and opinion.\n\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren"},"Antinet-Zettlekasten":{"slug":"Antinet-Zettlekasten","filePath":"Antinet Zettlekasten.md","title":"Antinet Zettlekasten","links":["Scott-Scheper","Zettlekasten","Obsidian","Bibcards","Version-Control","Personal-Knowledge-Management-(PKM)","The-Anitnet-Zettlekasten-by-Scott-Scheper"],"tags":[],"content":"The “Antinet” is a term coined by author and copywriter Scott Scheper to describe his version of Niklas Luhmmann’s Zettlekasten system. Scott’s PKM philosophy heavily emphasizes the value of analog note taking systems over digital ones like Obsidian.\nThe first part of the term “Antinet” is an acronym describing the core principles of the system:\n\nAnalog: Notes should be physical cues for recall.\nNumeric-Alpha Notecard Addresses: Use of notecard addresses allow for easy indexing and linking of physical note cards.\nTree: The organic tree-structure of the Antinet allows for arbitrary internal branching, enabling ideas to interact and grow.\nIndex: The use of a key-value map enables easy exploration of ideas and links in a physical Zettlekasten system.\n\nAnalog\n\nThe Antinet prevents over-selection: The effort and limited space of zettles and Bibcards prevents the extraction of meaningless or irrelevant information. Only the most useful information is selected.\nAntinet as Version Control: Adding to ideas while keeping old notes preserves mistakes and acts as an analog “version history” of ideas over time. Notes don’t just capture current thoughts but are contextualized by an entire history of ideas.\n\n\nPersonal Knowledge Management (PKM)\nThe Anitnet Zettlekasten by Scott Scheper"},"Arguments":{"slug":"Arguments","filePath":"Arguments.md","title":"Arguments","links":["Analytical-Reading","Propositions","Inductive-Reasoning","Deductive","How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren","Determining-an-Author's-Message"],"tags":[],"content":"\n“A reason or set of reasons given with the aim of persuading others that an action or idea is right or wrong.”\n\nNew Oxford American Dictionary\n\n\nIn Analytical Reading, the key sentences in individual paragraphs in a well constructed book will form the basis of an author’s arguments. There will be some paragraphs that express nothing at all.\n\nEvery argument will give reasons for its Propositions.\nDiscern between Inductive Reasoning and Deductive arguments.\nObserve what is proven, assumed, or self evident.\n\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren\nDetermining an Author’s Message"},"Astrology":{"slug":"Astrology","filePath":"Astrology.md","title":"Astrology","links":["Planets","Hellenistic-Astrology-by-Chris-Brennan"],"tags":[],"content":"Planets\n\nHellenistic Astrology by Chris Brennan"},"Atomizing-and-Abstracting-Game-Mechanics":{"slug":"Atomizing-and-Abstracting-Game-Mechanics","filePath":"Atomizing and Abstracting Game Mechanics.md","title":"Atomizing and Abstracting Game Mechanics","links":["Koster's-Taxonomy-of-Games","Game-Design-Patterns","Practical-Creativity-by-Raph-Koster,-GDC-2014","Tips-for-Creative-Game-Design"],"tags":[],"content":"We often think of games in their totality as singular objects; however, as explored in Koster’s Taxonomy of Games, the definition of a “Game” at its core is “a unique rules construct”. The implication of this is that when you pick apart the core components of a game, it’s revealed that those individual mechanics themselves for smaller games. These individual games and their component mechanics can be further abstracted into Game Design Patterns that can be modified or interchanged.\n\nPractical Creativity by Raph Koster, GDC 2014\nTips for Creative Game Design"},"Avoiding-Contentiousness":{"slug":"Avoiding-Contentiousness","filePath":"Avoiding Contentiousness.md","title":"Avoiding Contentiousness","links":["How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren","Criticizing-a-Book-Fairly","The-Importance-of-Suspending-Judgement"],"tags":[],"content":"Only disagree reasonably. There is no value in disagreement if you know that you are wrong. The priority should be knowledge, not to put the other person down. One should be prepared to agree as well as disagree.\nAvoid disagreeing hopelessly, anyone can find common ground. In navigating disagreement be mindful of your emotions, and distinguish between genuine knowledge and mere opinion. Very few claims are absolute, self-evident truths. Resolution can only occur when claims are defended with reason.\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren\nCriticizing a Book Fairly\nThe Importance of Suspending Judgement"},"BRAT-Obsidian-Plugin":{"slug":"BRAT-Obsidian-Plugin","filePath":"BRAT Obsidian Plugin.md","title":"BRAT Obsidian Plugin","links":["Obsidian-Plugins"],"tags":[],"content":"The Beta Reviewer’s Auto-Update Tool is an Obsidian community plugin for installing and updating Obsidian Plugins.\nIt effectively allows users to conveniently use plugins from Github repositories that aren’t currently available in the community plugins tab."},"Benefics-and-Malefics":{"slug":"Benefics-and-Malefics","filePath":"Benefics and Malefics.md","title":"Benefics and Malefics","links":["Jupiter","Venus","Saturn","Mars","Mercury","Planets","Sect","Luminaries","Moon","Sun","Under-the-Beams","Hellenistic-Astrology-by-Chris-Brennan","Astrology","Hellenistic-Astrology"],"tags":[],"content":"Meaning “good makers” and “bad makers” respectively. Jupiter and Venus are of the former, Saturn and Mars of the latter. Mercury is common. In the sky, the benefics are bright white, while the malefics are darker, likely the original source of this distinction. They are affirm or deny the quality and intensity of different Planets, either could be made good/bad based on Sect\nThe qualities of the Luminaries are a topic of debate. The Moon is generally considered benefic, while the Sun is either benefic or common (like Mercury) - possibly because of its positive illumination of aspected planets but malefic quality when a planet is Under the Beams.\n\nHellenistic Astrology by Chris Brennan\nAstrology\nHellenistic Astrology"},"Bottom-Up-Game-Design":{"slug":"Bottom-Up-Game-Design","filePath":"Bottom Up Game Design.md","title":"Bottom Up Game Design","links":["Atomizing-and-Abstracting-Game-Mechanics","Game-Design-Patterns","Creative-Mashups","Top-Down-Game-Design","Practical-Creativity-by-Raph-Koster,-GDC-2014","Game-Design","Koster's-Taxonomy-of-Games"],"tags":[],"content":"A “Mechanics First” or “Systems First” approach to game design. As a method it is concerned with Atomizing and Abstracting Game Mechanics down to their fundamental Game Design Patterns and assembling them into novel rules constructs before considering what narrative or theme the system is attempting to communicate.\nBecause games are made of smaller games all the way down, a common creative mashup technique in Bottom Up design is to identify pattern-metaphor relationships that resonate with your new mechanic in other games and swapping them out.\n\nThe opposite of Top Down Game Design\n\nPractical Creativity by Raph Koster, GDC 2014\nGame Design\nKoster’s Taxonomy of Games"},"Building-Habits-through-Peer-Pressure":{"slug":"Building-Habits-through-Peer-Pressure","filePath":"Building Habits through Peer Pressure.md","title":"Building Habits through Peer Pressure","links":["Atomic-Habits-by-James-Clear"],"tags":[],"content":"As social creatures we often seek to imitate / emulate the behaviors of those around us. Cultivating an intentional social environment can help build habits passively through exposure.\n\nThe Close: Friends and Family.\nThe Many: Clubs, organizations, and community.\nThe Powerful: Leaders, Teacher, and Role Models.\n\n\nAtomic Habits by James Clear"},"Building-a-Daily-Reading-Habit":{"slug":"Building-a-Daily-Reading-Habit","filePath":"Building a Daily Reading Habit.md","title":"Building a Daily Reading Habit","links":["Laws-of-Habit-Modification","Make-it-Obvious","Make-it-Easy","Habit-Score-Cards","Make-it-Satisfying","Make-it-Attractive","tags/pkmashup","The-Four-Levels-of-Reading","PKMashup-Notes","Atomic-Habits-by-James-Clear","How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren"],"tags":["pkmashup"],"content":"When attempting to build a consistent reading habit for the first time it is incredibly useful to use the Laws of Habit Modification to your advantage.\nOne extremely effective way to Make it Obvious is to get a book stand to keep at the desk or table where you are most likely to read. Keeping the book upright and highly visible, especially if left open to the appropriate page, keeps it at the top of mind and also helps to Make it Easy to sit down and read a couple pages.\nThis can be further enhanced with addition of Habit Score Cards, which I’ve had massive success with. Instead of a conventional bookmark, consider making a Score Card tracking the days you’ve stuck to the habit. Marking a successful day on the Score Card is an easy way to Make it Satisfying to read even a really challenging or intimidating text, and the desire to see the score go up and avoid breaking the chain goes a long way towards Make it Attractive.\n\nThis note is a pkmashup  of Make it Obvious and The Four Levels of Reading. See PKMashup Notes to learn more.\n\nAtomic Habits by James Clear\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren"},"Change-a-Gameplay-Dimension":{"slug":"Change-a-Gameplay-Dimension","filePath":"Change a Gameplay Dimension.md","title":"Change a Gameplay Dimension","links":["Practical-Creativity-by-Raph-Koster,-GDC-2014","Adding-a-Mechanical-Statistic","Change-the-Topology-of-a-Game","Raph-Koster","Tips-for-Creative-Game-Design"],"tags":[],"content":"\n“There have only been five fighting games in history”\n“The ur fighting game is Rock, Paper, Scissors”\n\nPractical Creativity by Raph Koster, GDC 2014\n\n\nThe dimensionality of a game space is an often overlooked aspect of a game design, but is often a major differentiating mechanic between different rules constructs. Raph goes on to describe that most fighting games throughout history are simply a “Rock, Paper, Scissors” pattern with the added statistic of distance. This idea can be pushed even further to create an entirely new family of games when you Change the Topology of a Game\n\nRaph Koster\nTips for Creative Game Design"},"Change-the-Topology-of-a-Game":{"slug":"Change-the-Topology-of-a-Game","filePath":"Change the Topology of a Game.md","title":"Change the Topology of a Game","links":["Change-a-Gameplay-Dimension","Graph-Space","Raph-Koster","Non-Euclidean-Geometry","Practical-Creativity-by-Raph-Koster,-GDC-2014","Koster's-Taxonomy-of-Games","Topology"],"tags":[],"content":"Similar to changing a game’s dimensionality, changing the Graph Space of a game can dramatically altar the underlying rule construct. A significant amount of innovations in game design over the last several decades had been driven by this exact practice. The number of topological variations on Tetris is massive, with seemingly minor alterations in the pieces or playspace creating massively different games.\nIn his 2014 GDC talk, Raph Koster points out a couple non obvious examples of interesting topologies in popular games:\n\nAsteroids is not played on a square, but rather a donut.\nPacman is either a donut or mobius strip, depending on the specific level.\nSnakes &amp; Ladders is half-jokingly describe as Non-Euclidean Geometry with wormholes.\n\n\nPractical Creativity by Raph Koster, GDC 2014\nKoster’s Taxonomy of Games\nTopology"},"Changing-Gameplay-Inputs-and-Interfaces":{"slug":"Changing-Gameplay-Inputs-and-Interfaces","filePath":"Changing Gameplay Inputs and Interfaces.md","title":"Changing Gameplay Inputs and Interfaces","links":["Koster's-Taxonomy-of-Games","Atomizing-and-Abstracting-Game-Mechanics","Practical-Creativity-by-Raph-Koster,-GDC-2014","Creativity-Through-Context-Replacement"],"tags":[],"content":"Altering the way a player interfaces with a game can often make it feel like an entirely new Variant, even if the underlying rules construct is identical. With a drastic enough change, input alone could be enough to turn it into an entirely different variant. This works because games are made of several smaller games, and the inputs themselves are a kind of mini-game that can be swapped out to create novel experiences.\nA few ideas to consider:\n\nChanging the number of axis of control\nAltering time &amp; duration\nFracturing a simple control into a complex arrangement of controls\nMerging a complex control arrangement into a single, simple control\nSwapping or Mixing inputs\n\n\nPractical Creativity by Raph Koster, GDC 2014\nCreativity Through Context Replacement"},"Changing-Gameplay-Metaphors":{"slug":"Changing-Gameplay-Metaphors","filePath":"Changing Gameplay Metaphors.md","title":"Changing Gameplay Metaphors","links":["Koster's-Taxonomy-of-Games","Creativity-Through-Context-Replacement","Game-Design-Patterns","Ludonarrative-Dissonance","Practical-Creativity-by-Raph-Koster,-GDC-2014"],"tags":[],"content":"Somewhat different than creating a reskin, when you alter the underlying metaphor your game is designed on you are dramatically changing the context of a given rules construct, opening up new Game Design Patterns and mechanical opportunities you might not otherwise use. The cliché example is taking the first person shooter construct and turning it into a photography game, opening up novel design space that would otherwise be out of place or introduce Ludonarrative Dissonance.\n\nPractical Creativity by Raph Koster, GDC 2014"},"Class-Systems":{"slug":"Class-Systems","filePath":"Class Systems.md","title":"Class Systems","links":["Roles-(Design-Pattern)","Adding-Gameplay-Verbs-and-Goals","Power-Creep","Skills-(Design-Pattern)","Classes-and-balance-–-Raph's-Website","Do-classes-suck--–-Raph's-Website","Classes-vs-Skills-in-Game-Design"],"tags":[],"content":"Character Classes are a specific systematization of the Roles (Design Pattern). It is a method of cleanly dividing verbs and goals between players as to create a division of labor, encourage cooperation, and rewards different modes of play.\nThe key to good class design is to make sure each class is unique in either it’s verbs, goals, or both. A common problem in multiplayer game design is creating too many classes with the game goal: deal damage. There’s only so many unique variations of “deal damage” in a given design space before characters are not meaningfully different in gameplay experience, resulting in Power Creep.\nWhen a game necessitates far more character variety than there are goals or verbs to design entire classes around, isolating some of the methods and goals as Skills (Design Pattern) can mitigate some of the balance problems that a class system can often generate.\n\nClasses and balance – Raph’s Website\nDo classes suck- – Raph’s Website\nClasses vs Skills in Game Design"},"Classes-vs-Skills-in-Game-Design":{"slug":"Classes-vs-Skills-in-Game-Design","filePath":"Classes vs Skills in Game Design.md","title":"Classes vs Skills in Game Design","links":["Role-Playing-Games","Game-Design","Raph-Koster","Atomizing-and-Abstracting-Game-Mechanics","Game-Design-Patterns","Merging-Gameplay-Mechanics","Do-classes-suck--–-Raph's-Website","Roles-(Design-Pattern)","Skills-(Design-Pattern)"],"tags":[],"content":"A popular debate in game design, especially with regard to Role Playing Games, is the debate between whether Class Systems or Skill Systems make for better Game Design.\nRaph Koster explores the idea in some depth on his blog, with an obvious bias towards Classes - especially for multiplayer design specifically. He leans heavily on a sports metaphor for describing multiplayer games and the importance of simple to communicate, clearly defined roles for players to engage with. Raph also highlights the simplicity and compartmentalization of mechanics in a class system allows for easier balancing as a designer, and mastery as a player.\nBy contrast he describes skill-based systems as more complicated, harder to balance, directionless, and hard to explain to users. Outside of a multiplayer context where balance and cohesion is less critical however, skill systems avoid locking players into a single mode of player and are far easier to expand upon without destructively altering the dynamics. Skill systems also forego the assumption that all roles should be equal, which is also a non-issue in single player experiences where there is no other player to be more or less important than.\nThe interesting twist is that games are made of games all the way down and that many game design patterns are isomorphic to one another. When you break a class system down into its basic components you eventually get something that looks like a collection of skills, and when you connect and combine skills with tiers and prerequisites you eventually end up with a de facto class system.\n\nDo classes suck- – Raph’s Website\nRoles (Design Pattern)\nSkills (Design Pattern)"},"Cognitive-Assessment":{"slug":"Cognitive-Assessment","filePath":"Cognitive Assessment.md","title":"Cognitive Assessment","links":["Full-Scale-IQ-(FSIQ)","Comprehensive-Adult-Intelligence-Test-(CAIT)","Fluid-Intelligence","Jouve-Cerebrals-Test-of-Induction-(JCTI)"],"tags":[],"content":"Full Scale IQ (FSIQ):\n\nComprehensive Adult Intelligence Test (CAIT)\n\nFluid Intelligence:\n\nJouve-Cerebrals Test of Induction (JCTI)\n"},"Combining-Top-Down-and-Bottom-Up-Design":{"slug":"Combining-Top-Down-and-Bottom-Up-Design","filePath":"Combining Top Down and Bottom Up Design.md","title":"Combining Top Down and Bottom Up Design","links":["Top-Down-Game-Design","Bottom-Up-Game-Design","Atomizing-and-Abstracting-Game-Mechanics","Game-Design-Patterns","Changing-Gameplay-Metaphors","Practical-Creativity-by-Raph-Koster,-GDC-2014"],"tags":[],"content":"While some people perceive Top Down Game Design and Bottom Up Game Design to be diametrically opposed philosophies, in reality it’s a false dichotomy. Games fit inside one another fractally, like concentric rings, meaning you can start from either the top or bottom and move back and forth between the two poles of system and theme when and where appropriate, getting the best of both worlds. Specific Game Design Patterns can almost always be translated into new thematic metaphors and vice versa, allowing you to move seamlessly between these two modes of creativity and innovate on both levels.\n\nPractical Creativity by Raph Koster, GDC 2014"},"Coming-to-Terms":{"slug":"Coming-to-Terms","filePath":"Coming to Terms.md","title":"Coming to Terms","links":["How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren"],"tags":[],"content":"A term is a word used to communicate knowledge unambiguously. Communication cannot occur unless two people are using the same words with the same meanings. Without clear terms, transmission of knowledge cannot occur.\nUnderstanding Technical Vocabulary\nEvery field of understanding has its own technical vocabulary. It can be identified positively through familiarity with a field, or negatively through unfamiliarity.\nSome common words are, confusingly, used technically. In any case, to reach understanding, one must rely on the context of surrounding words that are understood.\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren"},"Compose2nix":{"slug":"Compose2nix","filePath":"Compose2nix.md","title":"Compose2nix","links":["NixOS","Docker-Compose","OCI-Container"],"tags":[],"content":"A tool for automatically generating a NixOS configuration module from a Docker Compose YAML file by converting each service definition into an OCI Container configuration, making it easier to run Docker projects on NixOS."},"Comprehensive-Adult-Intelligence-Test-(CAIT)":{"slug":"Comprehensive-Adult-Intelligence-Test-(CAIT)","filePath":"Comprehensive Adult Intelligence Test (CAIT).md","title":"Comprehensive Adult Intelligence Test (CAIT)","links":["Full-Scale-IQ-(FSIQ)","Cognitive-Assessment","Wechsler-Adult-Intelligence-Scale-(WAIS)","G-Factor"],"tags":[],"content":"The aim of project CAIT is to provide a free resource for estimating a Full Scale IQ (FSIQ) score for adults interested in  Cognitive Assessment. The CAIT is designed for individuals over the age of 16.\nThe CAIT is inspired by and formatted to resemble the Wechsler Adult Intelligence Scale (WAIS). Overall, the goal is to provide a similar but streamlined experience that can estimate FSIQ in a timely manner.\nEstimating FSIQ across a diverse range of test batteries is the best way to estimate the G-Factor, or general factor of intelligence. Most online IQ tests concentrate on measuring a single factor. The CAIT is designed to provide a more comprehensive view of general intelligence by testing multiple factors."},"Contractive-and-Expansive-Worlds":{"slug":"Contractive-and-Expansive-Worlds","filePath":"Contractive and Expansive Worlds.md","title":"Contractive and Expansive Worlds","links":["Jay-Springett","Worlds","Techno-Social-Systems","Solo-Journaling-Games","Shaping-Thought---2419---thejaymo"],"tags":[],"content":"In Jay Springett’s model of Worlds, all Techno-Social Systems(including games)can be thought of as belonging to one of two categories.\nContractive worlds are ones where the level of agency decreases as the world unfolds. Actions taken by users / players gradually reduces the possibility space of future moves as the world closes in and behavior is guided towards an end state. Examples of mechanically contractive game worlds are puzzles such sudoku or crosswords, which tend towards a state of completion with every action.\nExpansive worlds, by contrast, allow for the possibility space to open up as agency is expressed. Actions taken generally trend towards an increase in the quantity and/or variety of actions available in the future. An excellent example of mechanically expansive game worlds is Solo Journaling Games, which are typically limited only by the creative whim of the individual player.\n\nShaping Thought - 2419 - thejaymo"},"Contraries-of-the-Planets":{"slug":"Contraries-of-the-Planets","filePath":"Contraries of the Planets.md","title":"Contraries of the Planets","links":["Rhetorius","Zodiac","Luminaries","Hellenistic-Astrology-by-Chris-Brennan","Astrology","Hellenistic-Astrology","Planets"],"tags":[],"content":"Rhetorius emphasized the polarity of planets, suggesting that each planet in some capacity got its significations from its opposite, as demonstrated by the rulers of the Zodiac: Saturn is always dark and in opposition to the Luminaries, Venus is relation and pleasure in opposition to the separation and wrath of Mars, etc.\n\nHellenistic Astrology by Chris Brennan\nAstrology\nHellenistic Astrology\nPlanets"},"Creative-Mashups":{"slug":"Creative-Mashups","filePath":"Creative Mashups.md","title":"Creative Mashups","links":["Creativity-Through-Context-Replacement","Game-Design","Atomizing-and-Abstracting-Game-Mechanics","Game-Design-Patterns","Raph-Koster","Topology","Change-the-Topology-of-a-Game","Practical-Creativity-by-Raph-Koster,-GDC-2014","PKMashup-Notes","Tips-for-Creative-Game-Design"],"tags":[],"content":"Creativity Through Context Replacement is the most effective tool for generating new ideas, and one of the best methods for doing so is the Mashup. At its core, a Mashup is a novel collision of two ideas from different contexts into a new shared context. Many popular creative innovations throughout history have been the result of taking two familiar but disparate ideas and combining them in a unique way.\nGame Design Mashups\nAn example of this in Game Design is through Atomizing and Abstracting Game Mechanics of two or more games and recombining them into novel formulations. Once you successfully reduce a system down to its component design patterns, swapping out similar patterns is both trivial and extremely fruitful.\nAn example Raph Koster presents is not just experimenting with mashing up games with a shared underlying Topology, but to also Change the Topology of a Game by mashing it up with seemingly unrelated games with different underling topologies.\n\nPractical Creativity by Raph Koster, GDC 2014\nPKMashup Notes\nTips for Creative Game Design"},"Creativity-Through-Context-Replacement":{"slug":"Creativity-Through-Context-Replacement","filePath":"Creativity Through Context Replacement.md","title":"Creativity Through Context Replacement","links":["Raph-Koster","Practical-Creativity-by-Raph-Koster,-GDC-2014"],"tags":[],"content":"Raph Koster describes creativity as primarily emerging from the novel collision of ideas as the result of changing any given idea’s context. He describes individual ideas as being like “bricks”, and moving a familiar “brick” out of a familiar setting into a meaningfully unfamiliar context allows for connections and collisions that would otherwise never occur.\n\nPractical Creativity by Raph Koster, GDC 2014"},"Criticizing-a-Book-Fairly":{"slug":"Criticizing-a-Book-Fairly","filePath":"Criticizing a Book Fairly.md","title":"Criticizing a Book Fairly","links":["How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren"],"tags":[],"content":"Reading is a conversation that doesn’t end with understanding, but must necessarily be completed with criticism. One mustn’t read to take a book for granted or reject it mindlessly, but weigh and consider everything that’s been read.\nTo be serious in receiving communication, one must be moth responsive and responsible. You must understand clearly what is being said, but also have a responsibility to take a stance on the matter.\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren"},"DAVx5":{"slug":"DAVx5","filePath":"DAVx5.md","title":"DAVx5","links":["Tasks.org","Simple-Calendar-Pro","Nextcloud","Free-and-Open-Source-Software-(FOSS)"],"tags":[],"content":"DAVx5 is a CalDAV/CardDAV management and sync app for Android. It also provides WebDAV Cloud access. I primarily use it to sync Tasks.org and Simple Calendar Pro with my Google Calendar, with plans to set up a proper Nextcloud server soon.\n\nFOSS"},"Designing-Downtime":{"slug":"Designing-Downtime","filePath":"Designing Downtime.md","title":"Designing Downtime","links":["Raph-Koster","Third-Places","Forcing-interaction-–-Raph's-Website","Game-Design"],"tags":[],"content":"When attempting to design for socialization between players it is important to make sure both the incentives and the environment design create space for Downtime. Raph Koster uses the example of Third Places as a useful concept to model, understanding where the peaks and troughs are in a player’s engagement over time and putting the players into community spaces at the appropriate time.\n\nForcing interaction – Raph’s Website\nGame Design"},"Determining-an-Author's-Message":{"slug":"Determining-an-Author's-Message","filePath":"Determining an Author's Message.md","title":"Determining an Author's Message","links":["Propositions","Arguments","Coming-to-Terms","How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren","The-Power-of-Outlining-a-Book"],"tags":[],"content":"An authors message is found in their Propositions and Arguments. A proposition is nothing more than opinion unless supported by reason. Outlining and interpretation meet at this level. One works down to arguments through outline and up to propositions through Coming to Terms. This is where the heart of the communication lives.\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren\nThe Power of Outlining a Book"},"Docker-Compose":{"slug":"Docker-Compose","filePath":"Docker Compose.md","title":"Docker Compose","links":["Docker","Infrastructure-as-Code-(IaC)"],"tags":[],"content":"Docker Compose is a tool for running multi-container applications on Docker defined using the Compose file format. It adheres to the approach to server and application deployment known as Infrastructure as Code (IaC)."},"Docker":{"slug":"Docker","filePath":"Docker.md","title":"Docker","links":["Virtualization"],"tags":[],"content":"Docker is a set of platform as a service (PaaS) products that use OS-level Virtualization to deliver software in packages called containers. It’s a tool that allows for easy and automated deployment of server-based applications across different environments."},"Dungeon-Design":{"slug":"Dungeon-Design","filePath":"Dungeon Design.md","title":"Dungeon Design","links":["Karl-Druid","MorkBorg"],"tags":["TTRPGs"],"content":"\nConsider examining shopping mall layouts when mapping dungeons - their looping design is perfect for creating diverse environments that are interesting to navigate.\nInclude social encounters &amp; challenges in a dungeon, especially if inhabited by wandering humanoid creatures.\n\nDungeon Generators\n\nDNGEN - A one-click dungeon concept generator created by Karl Druid for MorkBorg. It’s system neutral and can be use for grimdark fantasy dungeons in any setting.\nOne Page Dungeon - A one-click one-page dungeon map generator. Tends towards a classic fantasy flavor. Includes a dungeon name, description, and rooms. Can be paired with DNGEN for creating dark fantasy dungeons.\n"},"Eight-Steps-of-the-Lazy-Dungeon-Master":{"slug":"Eight-Steps-of-the-Lazy-Dungeon-Master","filePath":"Eight Steps of the Lazy Dungeon Master.md","title":"Eight Steps of the Lazy Dungeon Master","links":["Gamemaster-Ideas","Which-Prep-Steps-for-Which-Situation-by-Sly-Flourish","Sly-Flourish"],"tags":["TTRPGs"],"content":"\nEight Steps of the Lazy DM\n\nReview the Characters\n\nUnderstanding the context and needs around each character helps to remind you what is worth focusing on from session to session.\nEven if you don’t know the characters, you can review the players to consider what to bring to the table.\n\n\nCreate a Strong Start\n\nStrong start is important to every session regardless of context. Players most clearly remember the beginning and end of a session.\n\n\nOutline Potential Scenes\n\nThe outlining of scenes is a catch-all for very general outcomes or specific events. These shouldn’t be railroad-y, but rather simple bullets outlining potential causes and effects.\n\n\nDefine Secrets and Clues\n\nDefining roughly ten secrets and clues gives you plenty to work with each session. A single sentence each is enough\nIf working from a big setting or adventure, pick out the most interesting stuff for your list\n\n\nDevelop Fantastic Locations\nOutline Important NPC\nChoose Relevant Enemies\nSelect Major Rewards\n\nAllow players roll dice on treasure tables so they feel directly connected to what they get\n\n\n\n\n\n\nGamemaster Ideas\nWhich Prep Steps for Which Situation by Sly Flourish\nSly Flourish"},"Embed-Perchance-Generators-in-Obsidian-Notes":{"slug":"Embed-Perchance-Generators-in-Obsidian-Notes","filePath":"Embed Perchance Generators in Obsidian Notes.md","title":"Embed Perchance Generators in Obsidian Notes","links":[],"tags":["TTRPGs"],"content":"Generators from perchance.org can be included in notes as an iFrame embed, which is really useful for making TTRPG generators usable and a highly accessible.\nThese can also be embedded in cards in Obsidian Canvas\n"},"Encounter-Design":{"slug":"Encounter-Design","filePath":"Encounter Design.md","title":"Encounter Design","links":["1D10+5","MorkBorg","Karl-Druid"],"tags":["TTRPGs"],"content":"\nWell designed encounters have three definitive qualities:\n\nDrive - the reason behind the encounter, particularly the player’s motivations.\nImpact - the consequences of the encounter, both in success and failure.\n\nDo not create soft threats. Always emphasize impact.\n\n\nFlavor - every encounter should strive to be thematic and memorable.\n\nNo “empty room” encounters. Make spaces just as engaging and enemies.\n\n\n\n\n\nEncounter Generators\nDNGNSTOCK - A one-click dungeon encounter table generator created by user 1D10+5 on Itch.io for MorkBorg. The generator references creatures and stats for MorkBorg specifically, but can be used to brainstorm for other games. Includes different environment themes.\nCreature Generators\n\nThe Monster Approaches - A one-click monster generator by Karl Druid for MorkBorg. Tends towards grimdark and horror themes. Includes stats for MorkBorg enemies, but can be used as inspiration for any system.\n"},"Expansive-World-Design-with-MOSAIC-Strict":{"slug":"Expansive-World-Design-with-MOSAIC-Strict","filePath":"Expansive World Design with MOSAIC Strict.md","title":"Expansive World Design with MOSAIC Strict","links":["MOSAIC-Strict","Contractive-and-Expansive-Worlds","Table-Top-Role-Playing-Games-(TTRPGs)","Atomizing-and-Abstracting-Game-Mechanics","Adding-Gameplay-Verbs-and-Goals","tags/pkmashup","Phenomenology-of-Agency","Extrinsic-Reading","PKMashup-Notes","Game-Design","Compose-RPG"],"tags":["pkmashup"],"content":"The modularity of MOSAIC Strict presents a unique opportunity for Expansive World Design in TTRPGs. By Atomizing and Abstracting Game Mechanics down into distinct modules or “mini-games”, you can effectively compartmentalize the systems players use to interact with &amp; through the fictions, allowing you to appropriately introduce new verbs and goals into the game as the world unfolds around them.\nThis approach to expansive, modular, and responsive game design you can circumvent the pressure to mechanically model every possible action and affordance the players will need to have access to before beginning play. Instead, new systems can be intentionally introduced and phased out to approiately match to the specific field of agentic expression you are drying to model as a Gamemaster and designer.\n\nThis note is a pkmashup  of Contractive and Expansive Worlds, Phenomenology of Agency, and Extrinsic Reading . See PKMashup Notes to learn more.\n\nGame Design\nCompose RPG"},"Extrinsic-Reading":{"slug":"Extrinsic-Reading","filePath":"Extrinsic Reading.md","title":"Extrinsic Reading","links":["Syntopical-Reading","How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren"],"tags":[],"content":"A part of the process of Syntopical Reading with the goal of understanding a text in light of other sources. One should always strive to read the source material first, then read extrinsic sources in chronological order. Examples of extrinsic sources include:\n\nRelevant personal experience\nOther books, essays, and articles\nCommentaries and abstracts on the source material\nReference books\n\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren"},"Forcing-Creative-Constraints":{"slug":"Forcing-Creative-Constraints","filePath":"Forcing Creative Constraints.md","title":"Forcing Creative Constraints","links":["Practical-Creativity-by-Raph-Koster,-GDC-2014"],"tags":[],"content":"Working within constraints fosters creativity by quickly limiting the scope of any given design space. As natural problem solvers we have a much easier time conjuring ideas in direct response to a challenge or limitation rather than trying to create ex nihilo.\n\nPractical Creativity by Raph Koster, GDC 2014"},"Formless-Class-Generator-(Idea)":{"slug":"Formless-Class-Generator-(Idea)","filePath":"Formless Class Generator (Idea).md","title":"Formless Class Generator (Idea)","links":["MörkBorg","Roles-(Design-Pattern)","Dungeons-and-Dragons-4th-Edition","Game-Design-Patterns","Design-Matrix","Design-Space","tags/pkmashup","Running-a-Hexcrawl","Changing-Gameplay-Metaphors","PKMashup-Notes","Class-Systems"],"tags":["pkmashup"],"content":"A concept I’m playing around with is randomly rolled class abilities like those found in MörkBorg but extending the concept further to a classes approach, though still includes character Roles.\nThe character generator will include options for the character’s role in combat, survival, and possibly social encounters. It should also include a D&amp;D 4e style “power source” which changes the way each role is expressed.\nThis design pattern lends itself to a three or four axis Design Matrix demarcating the Design Space for different character archetypes. If properly designed with multiple, flavorful options for each combination the class options should be incredibly diverse.\n\nThis note is a pkmashup of Running a Hexcrawl, Changing Gameplay Metaphors, and Roles (Design Pattern) . See PKMashup Notes to learn more.\n\nClass Systems"},"Formless-Class-System":{"slug":"Formless-Class-System","filePath":"Formless Class System.md","title":"Formless Class System","links":["Contractive-and-Expansive-Worlds","Class-Systems","Formless-Magic-Systems","Adding-Gameplay-Verbs-and-Goals","Traits-(Design-Pattern)","MOSAIC-Strict","Risus-RPG","tags/pkmashup","Forcing-Creative-Constraints","Classes-vs-Skills-in-Game-Design","Adding-a-Mechanical-Statistic","PKMashup-Notes","Skills-(Design-Pattern)","Roles-(Design-Pattern)"],"tags":["pkmashup"],"content":"Exploring the idea of a formless, expansive Class Systems , somewhat inspired by my experiments with Formless Magic Systems. The idea that characters are defined by Adding Gameplay Verbs and Goals though the acquisition of skills and items. A character would essentially be mechanically defined by a number of traits which combine to describe a specific action (such as heal, sneak, cast, fire, stab, etc).\nThe idea needs more development and exploration, possibly as a MOSAIC Strict module. It is somewhat similar to the Risus RPG approach to clichés.\n\n\nThis note is a pkmashup  of Forcing Creative Constraints, Classes vs Skills in Game Design, and Adding a Mechanical Statistic . See PKMashup Notes to learn more.\n\n\nSkills (Design Pattern)\nRoles (Design Pattern)"},"Fossify-Calendar":{"slug":"Fossify-Calendar","filePath":"Fossify Calendar.md","title":"Fossify Calendar","links":["F-Droid"],"tags":[],"content":"A FOSS Calendar Android app available on F-Droid\nGithub Repo\nF-Droid Page"},"Free-and-Open-Source-Software-(FOSS)":{"slug":"Free-and-Open-Source-Software-(FOSS)","filePath":"Free and Open Source Software (FOSS).md","title":"Free and Open Source Software (FOSS)","links":[],"tags":[],"content":""},"Game-Design-Patterns":{"slug":"Game-Design-Patterns","filePath":"Game Design Patterns.md","title":"Game Design Patterns","links":["Atomizing-and-Abstracting-Game-Mechanics","Raph-Koster","Practical-Creativity-by-Raph-Koster,-GDC-2014"],"tags":[],"content":"After Atomizing and Abstracting Game Mechanics down to their most fundamental components, they can be abstracted into design patters (such as Set Packing, Time Limits, Equipment, Node Traversal, etc).\nThere is no comprehensive list of design patterns, and even more interesting is that patterns are often isomorphic to one another, meaning that the same abstract experience can be described by multiple different mathematical formulations.\n\nAn example Raph Koster gives in his 2014 GDC talk is that Sudoko can be described equally well as either a “Build the Map” problem or a “Set Packing” problem.\n\nA meaningful part of a talent game designer’s job is to dedicate time to building out a personal game pattern library. This isn’t necessarily done explicitly, but rather through exposing oneself to as wide a variety of games (rules constructs) as possible.\n\nPractical Creativity by Raph Koster, GDC 2014"},"Game-Design":{"slug":"Game-Design","filePath":"Game Design.md","title":"Game Design","links":["Jay-Springett","General-Game-Design-Tips","Tips-for-Creative-Game-Design","Shaping-Thought---2419---thejaymo"],"tags":[],"content":"\n\n” The ‘art’ of game design, then, is ultimately – the poetic manipulation of agency. ” Jay Springett, Shaping Thought\n\nGeneral Game Design Tips\nTips for Creative Game Design\n\nShaping Thought - 2419 - thejaymo"},"Gamemaster-Ideas":{"slug":"Gamemaster-Ideas","filePath":"Gamemaster Ideas.md","title":"Gamemaster Ideas","links":["Collaborative-Worldbuilding","Worldbuilding-Games","The-best-TTRPG-trends-for-2025-aren't-in-any-rulebook","Session-Preparation","Dungeon-Design","Encounter-Design","Campfire-Tales","Reskinning","Running-a-Hexcrawl"],"tags":["TTRPGs"],"content":"This note is a temporary staging area for GM ideas and tips that are currently too short to be split off into their own notes.\nGeneral Tips\n\nAlways accept the coolest idea at the table.\n\nFrequently ask players how they’d like to attempt something rather than a flat “yes” or “no”.\nAlways record player ideas &amp; requests for gifts &amp; consequences.\n\n\nThe BehindTheTables subreddit wiki includes countless roll tables for nearly every situation.\n\nRandroll has a collection of PDFs specifically tailored to Solo play.\n\n\nAdvantages of minimalism\n\nThe game remains in the imagination, creating more space for immersion rather than less. Keeps it inside the mind of the players\nPromotes vivid description, keeps the group from leaning on the visual representation of characters and terrain\nThe effect on prep. Minimalism saves massive amounts of time. Allowing for abstraction removes the need for tactical detail. More conceptual prep\n\n\nExplore options for Collaborative Worldbuilding, especially Worldbuilding Games\n\nThe best TTRPG trends for 2025 aren’t in any rulebook\n\n\n\n\nSession Preparation\nTransclude of Session-Preparation\n\nRunning Campaigns\n\nConsider “Knife Theory” in session zero. Player characters who add more “knives” to their backstory, plot hooks that can be used by the GM to “stab” the player, the easier they are to integrate into the story.\nWhen worldrunning, make use of “world timers”. Make sure the players understand the presence and impact of passing time.\n\n\nRunning One-shots\n\nWrite your one-shot sessions around a 3-act structure, spanning roughly 1hr-2hr-1hr for ideal pacing.\nTime turns to avoid too much idle time.\nCreate backup characters or assign NPCs to players who die during a one-shot so they’re not sitting out the rest of the game.\n\n\nAdventure Design\n\nDon’t wait to use your best ideas. Most campaigns have a short run time and often go unfinished, create cool experiences early and often.\nFocus on node-based adventure design. Prepare situations, not plots.\n\nSituations / nodes can be mapped to a “plot tree”, wherein scene archetypes can be loosely connected together on the fly to imply an overarching plot, even when such a plot doesn’t actually exist\n\n\nCreate interesting dilemmas and push the players to make meaningful decisions.\n\n\nDungeon Design\nTransclude of Dungeon-Design\n\nEncounter Design\nTransclude of Encounter-Design\n\nRunning Combat\n\nWhen running boss battles in combat-focused games, take inspiration from MMORPGs and include well broadcasted “Legendary Attacks” for players to avoid and exploit.\n\n\nRewards\n\nLoot should be worth more than it useful, that way players won’t be disappointed if they happen to loot something they can’t use or don’t want to use.\n\n\nRunning Downtime\n\nCampfire Tales\n\nGreat prompt during rests to get the characters to share a bit about their past, where they’ve come from, how they feel about where they’re at, and where they want to go\nLook up “Stars and Wishes”\nUse information from campfire tales to improve a players experiments\n\n\n\n\nUsing Random Generation\n\nRoll twice on random tables and combine or interpolate the result for much more variety.\nCombining multiple prompts from multiple tables can create more unique encounters.\nReskinning mechanics and stat blocks massively increases the value you get out of existing content\n\nOracle Dice\n\nA d20 oracle can be used to generate a random challenge target\nD20 can be used for weather, time of day, and anything else random without needing a chart.\nCan be use as a gauge for anything that can be abstracted into a spectrum, like morale or temperament.\n\n\nTTRPG Note Taking\n\nNames of NPCs and information, especially if you roll randomly, is very important\n\nContext specifically, such as traits or voices is also nice to know\n\n\nNotes are specifically for things you wont remember\nThe specific ending scene is critical to keep in mind\nSpecific character moments are very important to remember too\n\nItems, backstory, character connections\n\n\nSome things don’t need notes to be taken\n\nYou can check off secrets revealed, but aren’t important to track as a history\n\n\n\n\nRunning a Hexcrawl\nTransclude of Running-a-Hexcrawl"},"Gender-of-the-Planets":{"slug":"Gender-of-the-Planets","filePath":"Gender of the Planets.md","title":"Gender of the Planets","links":["Ptolemy","Masculine","Feminine","Hellenistic-Astrology-by-Chris-Brennan","Astrology","Hellenistic-Astrology","Gender","Morning-Stars-vs.-Evening-Stars"],"tags":[],"content":"Ptolemy assigns to the Sun, Jupiter, Saturn, and Mars the Masculine - and to the Moon and Venus the Feminine. Mercury is said to be neutral.\n\nHellenistic Astrology by Chris Brennan\nAstrology\nHellenistic Astrology\nGender\nMorning Stars vs. Evening Stars"},"General-Game-Design-Tips":{"slug":"General-Game-Design-Tips","filePath":"General Game Design Tips.md","title":"General Game Design Tips","links":["Tips-for-Creative-Game-Design","Game-Design"],"tags":[],"content":"\nUse cockatrice for playtesting card games\nPractice design with fan expansions and supplements\n\nTips for Creative Game Design\n\nGame Design"},"Habits":{"slug":"Habits","filePath":"Habits.md","title":"Habits","links":["Levels-of-Habit-Formation","Steps-to-Habit-Formation","Laws-of-Habit-Modification","Building-Habits-through-Peer-Pressure","Make-it-Satisfying","Hack-Habits-through-Talent","Atomic-Habits-by-James-Clear"],"tags":[],"content":"Levels of Habit Formation\nSteps to Habit Formation\nLaws of Habit Modification\nBuilding Habits through Peer Pressure\nMake it Satisfying\nHack Habits through Talent\n\nAtomic Habits by James Clear"},"Hack-Habits-through-Talent":{"slug":"Hack-Habits-through-Talent","filePath":"Hack Habits through Talent.md","title":"Hack Habits through Talent","links":["Atomic-Habits-by-James-Clear","Habits"],"tags":[],"content":"Leaning into talent can supercharge outcomes and identity. Ask yourself what comes naturally, makes you lose track of time, or generates above average outcomes for you. Exploit success where possible; otherwise, explore. Everybody has a few things they are above average at. In combing those above average skills you can carve out a hyper unique niche in-which you can obtain mastery.\n\nAtomic Habits by James Clear\nHabits"},"Heliacal-Rising-and-Setting":{"slug":"Heliacal-Rising-and-Setting","filePath":"Heliacal Rising and Setting.md","title":"Heliacal Rising and Setting","links":["Under-the-Beams","Hellenistic-Astrology-by-Chris-Brennan","Astrology","Hellenistic-Astrology","Planets","Sun"],"tags":[],"content":"Rising planets are those Under the Beams which move out of that 15 degrees within a week are said to grow in benefit and grant special gifts. Setting planets are the opposite, moving into the beams within a week of birth yields a waning or fading of gifts.\n\nHellenistic Astrology by Chris Brennan\nAstrology\nHellenistic Astrology\nPlanets\nSun"},"Hermetica":{"slug":"Hermetica","filePath":"Hermetica.md","title":"Hermetica","links":["Hermeticism","Corpus-Hermeticum","Asclepius","Alchemy","Astrology","Magic","The-Greek-Magical-Papyri","The-Picatrix"],"tags":[],"content":"A name generally applied to the texts associated with Hermeticism, divided into two categories: The Philosophical Hermetica and the Technical Hermetica.\nPhilosophical Hermetica\nIncludes a number of Greek treaties, the most famous of which are the Corpus Hermeticum and the Asclepius\nTechnical Hermetica\nIncludes a number of texts on Alchemy, Astrology, and Magic. The most famous of which include the The Greek Magical Papyri and The Picatrix\n"},"Hermeticism":{"slug":"Hermeticism","filePath":"Hermeticism.md","title":"Hermeticism","links":["Hermes-Trismegistus","Hermetica","Alchemy","Astrology","Theurgy","Neoplatonism","Magic","Western-Esotericism"],"tags":["hermeticism"],"content":"A spiritual tradition based on the texts attributed to Hermes Trismegistus known as the Hermetica spanning from roughly 300 BCE to 1200 CE. As a philosophical system it encompasses a wide variety of philosophies practices including Alchemy, Astrology, Theurgy, Neoplatonism, and various forms of Magic. Hermeticism has a significant influence on the development of Western Esotericism.\n"},"Home-Manager":{"slug":"Home-Manager","filePath":"Home-Manager.md","title":"Home-Manager","links":["Nix","NixOS"],"tags":[],"content":"Home-manager is a program that apply the Nix philosophy of declarative management to a user’s /home directory. It takes the content of a generated or designated home.nix file to generate your personal configuration files for the various applications in your system, allowing you to automatically reproduce your preferred user environment across multiple machines, and switch user environments with ease.\n\nNix\nNixOS"},"Hypersigils":{"slug":"Hypersigils","filePath":"Hypersigils.md","title":"Hypersigils","links":["Grant-Morrison","Sigil-Magic","Chaos-Magic","Practical-Enchantment"],"tags":[],"content":"A term coined by comic writer and chaos magician Grant Morrison, a hypersigil is an extended application of the fundamental principles of Sigil Magic, one of the magical techniques popularized by Chaos Magic. Practically speaking, Hypersigils are the ritualization of narrative and metaphor as a method of Practical Enchantment.\n"},"Ideal-Solo-RPG":{"slug":"Ideal-Solo-RPG","filePath":"Ideal Solo RPG.md","title":"Ideal Solo RPG","links":[],"tags":[],"content":"Accessible and Logical rules\nProgressive disclosure\nTools for getting into play quickly, generating prompts, etcPaths / Flow Charts / Algorithms in TTRPG Mechanics\n\nProcedural play, with a clear flowchart gameplay loop, including a “session start” procedure, with more complex systems progressively disclosed as the campaign develops.\n\n\nStreamlined worldbuilding tools\nFresh and thematic Generators\n\nProcedures for generating a fresh twist on the core setting/genre, with plenty of tables for building out the surrounding world.\n\n\nSocial Mechanics\nrules for playing other characters in the scene in a procedural way\nSolo party and faction dynamics\nsolo games where you switch points of view often, rotating between characters\nMechanics that force the character to do things the player might not want to do\n\nClear, procedural rules for NPC behaviors beyond simple oracle tables. Universal party/faction sheet and moves/mechanics. Relationship mechanics &amp; moves which trigger specific responses.\nPlayer rotates between characters and makes checks based on their current POV, which initiates a procedural response. Can integrate with Psyche mechanics requiring characters to respond in ways the player might not expect.\n\n\nCampaign sheets and tools\nDowntime Mechanics\n\nSystems for tracking and managing progress &amp; meta-progression beyond just the characters. Tools for reifying the game state for other procedures.\n\n\nTactical combat that’s light on crunch\n\nIdentify what decisions are the most fun to make and allow randomness to introduce a gradient of effects, rather than a binary. Weapons and armor should have/be abilities just like spells are while still being lightweight.\n\n\nCommunity games with a shared bulletin / world events for Solo players\nGame with mechanics for integrating Solo and Group play, narrowing the gap\n\nProcedures for switching frames between group and solo play. Solo systems and procedures for developing character without necessarily unbalancing adversarial systems like combat.\nShared worldbuilding systems / events that allow players to anchor their characters to a shared world. Real time seasonal effects? Calendar events?\n\nWould need to abstract real time from game time to avoid weird decoupling.\n\n\n\n\nMystery Mechanics\n\nThis needs some research and examination, as I’ve never really run mystery systems before.\n\n\nOracles\n\nEnough oracles to run the world, but doesn’t drown play in tables\n"},"Identify-an-Author's-Solutions":{"slug":"Identify-an-Author's-Solutions","filePath":"Identify an Author's Solutions.md","title":"Identify an Author's Solutions","links":["Propositions","Arguments","Soundness","How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren","Avoiding-Contentiousness","Criticizing-a-Book-Fairly"],"tags":[],"content":"After observing the author’s Propositions and Arguments, identify which of the originally stated problems were or weren’t appropraitely solved. Also observe what new problems arise from the proposed solutions, and which cases the author did not realized they had failed.\nWhen judging an author’s Soundness there are four possible positions to take.\n\nThey are uninformed.\nThey are misinformed.\nThey are illogical.\nTheir analysis is incomplete.\n\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren\nAvoiding Contentiousness\nCriticizing a Book Fairly"},"In-the-Heart-of-the-Sun":{"slug":"In-the-Heart-of-the-Sun","filePath":"In the Heart of the Sun.md","title":"In the Heart of the Sun","links":["Under-the-Beams","Sun","Rhetorius","Hellenistic-Astrology-by-Chris-Brennan","Astrology","Hellenistic-Astrology","Planets"],"tags":[],"content":"Planets that are Under the Beams but within 1 degree of the Sun, according to Rhetorius, were considered exalted rather than harmed. This was later picked up by medieval astrologers in the form of the Arabic word Kasmimi meaning “as if in the heart”.\n\nHellenistic Astrology by Chris Brennan\nAstrology\nHellenistic Astrology\nPlanets"},"Incremental-Writing":{"slug":"Incremental-Writing","filePath":"Incremental Writing.md","title":"Incremental Writing","links":["Andy--Matuschak","Spaced-Repetition","Programmable-Attention","Habit-Stacking","Spaced-repetition-may-be-a-helpful-tool-to-incrementally-develop-inklings","Make-it-Obvious","Make-it-Easy"],"tags":[],"content":"The process of systematically resurfacing and gradually contributing work to writing projects over an extended period of time. I was first exposed to the idea by the work of Andy  Matuschak when researching unconventional applications of Spaced Repetition. This method of incremental writing takes advantage of the potential Programmable Attention effect of spaced repetition tools to facilitate Habit Stacking, allowing the typically low-friction task of habits like flipping through flashcards to automatically drop you into what might be otherwise be a high-friction task, like writing.\n\nSpaced repetition may be a helpful tool to incrementally develop inklings\nMake it Obvious and Make it Easy"},"Infrastructure-as-Code-(IaC)":{"slug":"Infrastructure-as-Code-(IaC)","filePath":"Infrastructure as Code (IaC).md","title":"Infrastructure as Code (IaC)","links":["Declarative-Configuration","Imperative-Configuration","Docker","Docker-Compose"],"tags":[],"content":"An approach to server deployment and computer resource provisioning based on machine-readable scripts or configuration files (Declarative Configuration) rather than physical hardware configuration or interactive Imperative Configuration.\n\nDocker, Docker Compose"},"Inspectional-Reading":{"slug":"Inspectional-Reading","filePath":"Inspectional Reading.md","title":"Inspectional Reading","links":["The-Four-Levels-of-Reading","Systematic-Skimming","How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren"],"tags":[],"content":"The second of The Four Levels of Reading is primarily concerned with the art of Systematic Skimming, or pre-reading, with the aim of getting the most out of a book in a short time. Asks “What is the book about, what is its structure, what are its parts?”\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren"},"Intentionality":{"slug":"Intentionality","filePath":"Intentionality.md","title":"Intentionality","links":["Franz-Brentano","Edmund-Husserl","Phenomenology","Noesis-and-Noema"],"tags":[],"content":"A term originating with philosopher and psychologist Franz Brentano and popularized by Edmund Husserl, Intentionality is an essential component of Husserl’s Phenomenology. Used to mean something like “directedness” and “aboutness”, the intentional capacity is a description of the fact that consciousness is always conscious “of” something, a subject oriented towards a phenomenal object. This is more clearly articulated in the concept of Noesis and Noema.\n"},"Interleaving":{"slug":"Interleaving","filePath":"Interleaving.md","title":"Interleaving","links":["Studying","Blocked-Practice"],"tags":[],"content":"Interleaving, meaning “to alternate between layers”, and an approach to Studying which involves alternating between different topics during a study session rather than adhering to a single subject during an extended session of Blocked Practice. Interleaving has been shown to be more effective than the latter in supporting information retention."},"Journal-Card":{"slug":"Journal-Card","filePath":"Journal Card.md","title":"Journal Card","links":["Every-Day-Carry-(EDC)","My-Analog-Productivity-and-PKM-System"],"tags":[],"content":"Note: I’ve since stopped using Journal Cards out of an aesthetic preference for more conventional journaling, but the many benefits of journal cards are still worth considering.\nUsing index cards for a daily journal yields a number of benefits beyond the expected cost and portability. In keeping a small stack of cards in your Every Day Carry (EDC) it becomes trivially easy to journal anywhere, anytime. The modularity of cards also allows me to insert or rearrange entries, say if I forgot a day earlier in the week and wanted to journal retroactively. This method also allows me to journal discretely on the go without risk of ruining, losing, or otherwise exposing my journal in an undesired way. All other entries remain safe and private at home.\n\nMy Analog Productivity and PKM System"},"Jouve-Cerebrals-Test-of-Induction-(JCTI)":{"slug":"Jouve-Cerebrals-Test-of-Induction-(JCTI)","filePath":"Jouve-Cerebrals Test of Induction (JCTI).md","title":"Jouve-Cerebrals Test of Induction (JCTI)","links":["Cognitive-Assessment","Inductive-Reasoning","Fluid-Intelligence"],"tags":[],"content":"The Jouve-Cerebrals Test of Induction (JCTI) is a computerized adaptive Cognitive Assessment designed to assess Inductive Reasoning. By dynamically adjusting the difficulty and number of questions based on the test-taker’s performance, the JCTI provides a precise measurement of Fluid Intelligence."},"Jupiter":{"slug":"Jupiter","filePath":"Jupiter.md","title":"Jupiter","links":["Zeus","Diurnal-Sect","Hellenistic-Astrology-by-Chris-Brennan","Astrology"],"tags":["astrology"],"content":"\nAlso called Zeus. Abundance, authority, gifts and profit, children, priests, freedom, stewardship, wealth. Rules thighs and feet. Rules tin, grey/white in color (later blue), Diurnal Sect and sweet in taste.\n\n\nFlashcards\nWhat is Jupiter’s Sect?:: Diurnal\n\nWhat planet rules gifts, children, stewardship, and wealth?:: Jupter\n\n\nHellenistic Astrology by Chris Brennan\nAstrology"},"Koster's-Taxonomy-of-Games":{"slug":"Koster's-Taxonomy-of-Games","filePath":"Koster's Taxonomy of Games.md","title":"Koster's Taxonomy of Games","links":["Raph-Koster","Practical-Creativity-by-Raph-Koster,-GDC-2014","Game-Design"],"tags":[],"content":"Game designer Raph Koster presents a hierarchical taxonomy for describing what games actually are (and, consequentially, what they are not).\n\nA Game is a unique rules construct.\nA Reskin is a superficial change in presentation of an existing rules construct.\nA Variant is a minor mechanical deviation from an existing rules construct.\nA Family is a set of Variants.\nA Genre is a set of Reskins and their Variants.\n\nAlmost every video game made today is actually a Variant rather than a unique game, in contrast to board games which are more often than not entirely new rules constructs.\n\nPractical Creativity by Raph Koster, GDC 2014\nGame Design"},"Kvaesitso":{"slug":"Kvaesitso","filePath":"Kvaesitso.md","title":"Kvaesitso","links":["Free-and-Open-Source-Software-(FOSS)","oLauncher"],"tags":[],"content":"A FOSS Android launcher built around search.\nAfter using oLauncher for a long time I found myself missing widgets quite a lot. Kvaesitso manages to strike a really satisfying balance between minimalism and functionality, and in particular happens to handle widgets in a really satisfying way.\n"},"Laws-of-Habit-Modification":{"slug":"Laws-of-Habit-Modification","filePath":"Laws of Habit Modification.md","title":"Laws of Habit Modification","links":["Make-it-Obvious","Make-it-Attractive","Make-it-Easy","Make-it-Satisfying","Atomic-Habits-by-James-Clear","Levels-of-Habit-Formation","Steps-to-Habit-Formation"],"tags":[],"content":"Leveraging the four steps of habit formation allows us to identify clear laws that apply to the modification of both good and bad habits.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepLawInverseCueMake it ObviousMake it HiddenCravingMake it AttractiveMake it RepulsiveResponseMake it EasyMake it HardRewardMake it SatisfyingMake it Punishing\n\nAtomic Habits by James Clear\nLevels of Habit Formation\nSteps to Habit Formation"},"Learning-in-Public":{"slug":"Learning-in-Public","filePath":"Learning in Public.md","title":"Learning in Public","links":[],"tags":[],"content":""},"Levels-of-Habit-Formation":{"slug":"Levels-of-Habit-Formation","filePath":"Levels of Habit Formation.md","title":"Levels of Habit Formation","links":["Atomic-Habits-by-James-Clear"],"tags":[],"content":"Habits are formed and reinforced at three different levels:\n\nOutcomes: The simplest to change, but don’t have a lasting effect.\nProcesses: Including deliberately designed systems, produce repeated outcomes that shift and reinforce the final level of identity.\nIdentity: Formed by belief and reinforced by outcomes, identity automates processes and has the biggest impact on habitual behavior.\n\n\nAtomic Habits by James Clear"},"Ludonarrative-Consonance-and-Dissonance":{"slug":"Ludonarrative-Consonance-and-Dissonance","filePath":"Ludonarrative Consonance and Dissonance.md","title":"Ludonarrative Consonance and Dissonance","links":["Game-Design","Clint-Hocking"],"tags":[],"content":"A concept in Game Design, the term Ludonarrative Dissonance was first coined by Clint Hocking to describe the experience of conflict between a game’s narrative message and mechanical execution. By contrast, Ludonarrative Consonance is the inversion of this term as a way of conceptualizing an approach to game design in which a game’s narrative and mechanical themes reinforce one another.\n"},"Luminaries":{"slug":"Luminaries","filePath":"Luminaries.md","title":"Luminaries","links":["Sun","Moon","Astrology","Hellenistic-Astrology-by-Chris-Brennan","Hellenistic-Astrology","Planets"],"tags":[],"content":"The Sun and the Moon in traditional Astrology.\n\nHellenistic Astrology by Chris Brennan\nHellenistic Astrology\nPlanets"},"Lunar-Nodes":{"slug":"Lunar-Nodes","filePath":"Lunar Nodes.md","title":"Lunar Nodes","links":["Moon","Ecliptic","Eclipses","Ascending-Node","Descending-Node","Hellenistic-Astrology-by-Chris-Brennan","Astrology","Hellenistic-Astrology","Planets"],"tags":[],"content":"The nodes are the moving points at which the Moon’s path intersects with the Ecliptic. These are the places where. Eclipses occur and therefor inherited a negative association early on in the tradition. However, later in antiquity the Ascending Node became associated with thing increasing (for better and worse), and the Descending Node with decreasing.\n\nHellenistic Astrology by Chris Brennan\nAstrology\nHellenistic Astrology\nPlanets"},"MOSAIC-Strict":{"slug":"MOSAIC-Strict","filePath":"MOSAIC Strict.md","title":"MOSAIC Strict","links":["MOSAIC-Strict-Index","metamageia/metamageia-youtube/scripts/Nothing-at-the-Bottom---MOSAIC-Strict-and-Modular-TTRPG-Design","Ludic-Fragments-the-MOSAIC-Strict-Manifesto","Actual-Play-using-Strictly-MOSAICs!","Whose-Mechanic-is-it-Anyway"],"tags":["TTRPGs"],"content":"MOSAIC Strict Index\nNothing at the Bottom - MOSAIC Strict and Modular TTRPG Design\nIntroduction\nBased on the 2021 blog post by Michael Prescott, MOASIC Strict is a conceptual framework for designing TTRPG rules that are:\n\nModular\nOptional\nShort\nAttested\nIndependent\nCoreless\n\n\nNoteworthy Discussions\n\nThis Reddit thread has some interesting discussions, especially /u/fuseboy’s (Michael Prescott) example of gold based magic and advancement modules.\n\n/u/ryschwith brought up Cortex Prime as an interesting example of modular RPG design, worth taking another look at.\n\n\nGwyllgi over on Itch also presented the idea of CERAMIC Strict, a variant on MOSAIC focused on removing randomness and promoting accessibility. Could be a useful keyword to check when looking for new ideas.\n\nHere is a collection of CERAMIC modules: itch.io/c/2645424/ceramic-strict\n\n\nAlone in the Labyrinth wrote up their Ludic Fragments the MOSAIC Strict Manifesto\n\nIt’s mostly a recap of the original post, followed my an overview of their own MELEE module.\n\n\nSabrecat shared some of their experience running a session with only MOSAIC modules (Actual Play using Strictly MOSAICs!)\n\nSome notes from their experience: Running MOSAIC Sessions via VTT is difficult because of the software’s assumptions.\nPlayer-Facing modules like Twenty Backgrounds make for a lot of novel fun.\nMOSAIC modules really “hum” when you can find modules with emergent interactions, like Experience and A Flexible Resolution System.\n\n\nThis article on “FRESCO Flexible” by Steve D, albeit a bit excessively contrarian, shares some of my thoughts regarding opening up / expanding the core ideas of MOSAIC Strict.\n\n\nMildly Relevant Information\n\nMichael Prescott’s post Whose Mechanic is it Anyway establishes a couple principles for designing mechanics.\n\n(1) The player who needs to use a quantity should be the one tracking it.\n(2) The player who desires the outcome of a mechanic should be responsible for invoking it.\n(2.b) Mechanics which produce only negative or positive outcomes are especially important to give to the proper player\n\nPrescott uses the classic encumbrance example\n\n\nPairing both good and bad outcomes in the same mechanic incentivizes players to keep track of even detrimental mechanics.\n\n\n\n\nInteresting Modules\nCollections\n\nThere’s the two posts (and accompanying spreadsheet) from Michael’s own blog:\n\nFirst: blog.trilemma.com/2021/04/some-mosaic-strict-sets-appear.html\nSecond: blog.trilemma.com/2021/07/more-mosaic-strict-sets.html\nThe Google Sheet: docs.google.com/spreadsheets/d/1PQLmSyj94TBh5kUguinxorYAxwdYMH0o6BMttvJU5VM/edit#gid=0\n\n\n\nIndividual Modules\n\nA Patterned Magic by Michael Prescott. Not technically mosaic, but an interesting example of mini-games as mechanics.\n\nNotes: It kind of assumes it’ll be an interface for an existing spell system (so not mosaic), but is incredibly flexible because of that. Seems heavily inspired by Sudoku, should consider doing something similar with other solo games and systems like Solitaire, Mahjong, etc\n\n\nMichael also has an interesting Downtime Calendar which can be modified / adapted to get players more invested in the passage of time in a long-term campaign.\n\n\nIdeas\n\nPBTA style Playbooks with explicitly defined moves and mechanics could make for very compelling player-facing modules\nGrimwild Story Kits &amp; Encounter Statblocks\nEmblema as a metaphor for central piece around which a mosaic is build\nModello or maquette for templates and kits\n"},"Make-it-Attractive":{"slug":"Make-it-Attractive","filePath":"Make it Attractive.md","title":"Make it Attractive","links":["Atomic-Habits-by-James-Clear","Laws-of-Habit-Modification"],"tags":[],"content":"Identifying and exploiting the need generated by a cue can help to circumvent the need for willpower by making the behavior desirable.\n\nTemptation bundling, like stacking, pairs a new habit with something you already do/enjoy, allowing likely actions to reinforce less likely ones.\nReframing hard habits into good ones by saying “I get to” rather than “I have to” helps to reduce friction.\n\n\nAtomic Habits by James Clear\nLaws of Habit Modification"},"Make-it-Easy":{"slug":"Make-it-Easy","filePath":"Make it Easy.md","title":"Make it Easy","links":["Ulysses-Pact","Atomic-Habits-by-James-Clear","Laws-of-Habit-Modification"],"tags":[],"content":"For a behavior to become a habit it must become as frictionless as possible. Designing your environment and always resetting the room makes good habits much easier to start.\n\nTwo Minute Rule: Start with a very easy habit and focus on maintaining quantity of reps, and as it becomes easier to sustain gradually expand the habit to the desired scope.\nDecisive Actions: Leverage behaviors, systems, and devices that lock you into future decisions / options. Also known as a Ulysses Pact.\n\n\nAtomic Habits by James Clear\nLaws of Habit Modification"},"Make-it-Obvious":{"slug":"Make-it-Obvious","filePath":"Make it Obvious.md","title":"Make it Obvious","links":["Habit-Score-Cards","Atomic-Habits-by-James-Clear","Laws-of-Habit-Modification"],"tags":[],"content":"The most effective cues are ones anchored in time and/or space.\n\nHabit Score Cards track progress and gamify consistency.\nStacking uses a current habit as the cue for a new one.\nEnvironment design arranges space so that the desired behavior is both the most obvious and the most accessible. One should strive to dedicate each space to a single behavior.\n\n\nAtomic Habits by James Clear\nLaws of Habit Modification"},"Make-it-Satisfying":{"slug":"Make-it-Satisfying","filePath":"Make it Satisfying.md","title":"Make it Satisfying","links":["The-Goldilocks-Rule","Atomic-Habits-by-James-Clear","Laws-of-Habit-Modification"],"tags":[],"content":"Behaviors that are rewarded are repeated. Incentives can kickstart a habit, but outcomes are what will reinforce identity and establish intrinsic rewards.\n\nThe Goldilocks Rule: The best habit target are those that are barely attainable. Challenge generates motivation but progress sustains it. Reaching difficult goals solidifies identity.\n\n\nAtomic Habits by James Clear\nLaws of Habit Modification"},"Mars":{"slug":"Mars","filePath":"Mars.md","title":"Mars","links":["Ares","Nocturnal-Sect","Hellenistic-Astrology-by-Chris-Brennan","Astrology"],"tags":["astrology"],"content":"\nAlso called Ares. Rules violence, combat, physical assault, masculinity, marriage (for women), separation, loss, heat. Those who work with fire or iron, or with hands. Soldiers, hunters, chasing. Rules iron, regalia. Nocturnal Sect, red in color, pungent in taste.\n\n\nFlashcards\nWhat is Mars’ Sect?:: Nocturnal\n\nWhat planet rules separation, violence, loss, and heat?:: Mars\n\n\nHellenistic Astrology by Chris Brennan\nAstrology"},"Martin-Heidegger":{"slug":"Martin-Heidegger","filePath":"Martin Heidegger.md","title":"Martin Heidegger","links":["Phenomenology","Edmund-Husserl","Being-in-Time-by-Martin-Heidegger","Dasein"],"tags":[],"content":"An important figure in the field of Phenomenology. He was a student of Edmund Husserl and wrote Being in Time.\n\nDasein"},"Mentats":{"slug":"Mentats","filePath":"Mentats.md","title":"Mentats","links":["Frank-Herbert","Dune","Butlerian-Jihad"],"tags":[],"content":"Mentats are human super-computers featured in Frank Herbert’s Dune novels. They are specifically gifted individuals selected and trained as “a replacement to the computers and thinking machines following the Butlerian Jihadthat banned the creation of machines in the human mind’s image”."},"Mercury":{"slug":"Mercury","filePath":"Mercury.md","title":"Mercury","links":["Hermes","Hellenistic-Astrology-by-Chris-Brennan","Astrology"],"tags":["astrology"],"content":"\nAlso named Hermes. Rules education, writing, communications, youth, play, trickery, cleverness, discovery, markets and banks, math. Philosophers, architects, speakers, diviners, and tacticians. Rules coinage.\n\n\nFlashcards\nWhat is Mercury’s Sect?:: Common\n\nWhat planet rules Philosophers, architects, speakers, diviners, and tacticians?:: Mercury\n\n\nHellenistic Astrology by Chris Brennan\nAstrology"},"Merging-Gameplay-Mechanics":{"slug":"Merging-Gameplay-Mechanics","filePath":"Merging Gameplay Mechanics.md","title":"Merging Gameplay Mechanics","links":["Atomizing-and-Abstracting-Game-Mechanics","Game-Design-Patterns","Raph-Koster","Practical-Creativity-by-Raph-Koster,-GDC-2014"],"tags":[],"content":"Because games are made of other games all the way down to their most fundamental mechanics, you can also create new games by combining abstract Game Design Patterns in interesting ways to create new patterns.\nAn example Raph Koster gives in his 2014 GDC talk is if you take a “Visit Every Node on the Graph” pattern (Pacman) and mark only specific nodes to visit, the pattern becomes “Pick Up Objects.” Going further, if you turn the specific nodes you need to visit into hidden information it becomes a “Secrets” gameplay system.\n\nPractical Creativity by Raph Koster, GDC 2014"},"Moon":{"slug":"Moon","filePath":"Moon.md","title":"Moon","links":["Selene","Nocturnal-Sect","Hellenistic-Astrology-by-Chris-Brennan","Astrology"],"tags":["astrology"],"content":"\nAlso called Selene. Reflective, counterfeit light. Body and form. Older women. The masses. Wandering. Rulers silver and glass, is light green, Nocturnal Sect, salty in taste.\n\n\nFlashcards\nWhat is the Moon’s Sect?:: Nocturnal\n\nWhat planet rules Body and Form, the masses, and wandering?:: The Moon\n\n\nHellenistic Astrology by Chris Brennan\nAstrology"},"Morning-Stars-vs.-Evening-Stars":{"slug":"Morning-Stars-vs.-Evening-Stars","filePath":"Morning Stars vs. Evening Stars.md","title":"Morning Stars vs. Evening Stars","links":["Under-the-Beams","Sun","Masculine","Feminine","Hellenistic-Astrology-by-Chris-Brennan","Astrology","Hellenistic-Astrology","Planets","Gender","Gender-of-the-Planets"],"tags":[],"content":"Planets not Under the Beams which rise before the Sun are called “morning stars”, said to be more Masculine and manifest early in life. Evening stars which rise after are said to be more passive and Feminine, and manifest later in life.\n\nHellenistic Astrology by Chris Brennan\nAstrology\nHellenistic Astrology\nPlanets\nGender\nGender of the Planets"},"Morphological-Analysis":{"slug":"Morphological-Analysis","filePath":"Morphological Analysis.md","title":"Morphological Analysis","links":["Brainstorming-Techniques"],"tags":[],"content":"A method for brainstorming creative solutions to complicated problems, first devised by astronomer Fritz Zwicky. A simplified version of Morphological Analysis.\nThe core of the technique is to divide the problem into multiple categories and fill those columns with possible values. From there you can explore the variables in different combinations to generate novel solutions. Incredibly powerful technique for Brainstorming and Problem Solving\n\n\nReferences\nSource: nesslabs.com/zwicky-box\nBrainstorming Techniques"},"Mundus-Imaginalis":{"slug":"Mundus-Imaginalis","filePath":"Mundus Imaginalis.md","title":"Mundus Imaginalis","links":["Henry-Corbin","Mundus-Imaginalis-by-Herny-Corbin"],"tags":[],"content":"A term coined by philosopher and theologian Henry Corbin, who considered the imaginative capacity of be of great metaphysical importance and the primary means through which we can interact with the divine.\n\nMundus Imaginalis by Herny Corbin"},"My-Analog-Productivity-and-PKM-System":{"slug":"My-Analog-Productivity-and-PKM-System","filePath":"My Analog Productivity and PKM System.md","title":"My Analog Productivity and PKM System","links":["Productivity","Personal-Knowledge-Management-(PKM)","Agenda-Card","To-Do-Card","Journal-Card","Morning-Pages","Vision-Deck"],"tags":[],"content":"\nWrite To-Do and Morning Pages Notes\n\nThe key components of my personal analog Productivity and Personal Knowledge Management (PKM) system.\nAgenda Card\nTo-Do Card\nJournal Card\nMorning Pages\nVision Deck\n\nPersonal Knowledge Management (PKM)"},"N-Back":{"slug":"N-Back","filePath":"N-Back.md","title":"N-Back","links":["Cognitive-Assessment","Working-Memory","Fluid-Intelligence"],"tags":[],"content":"The n-back task is a process of continuous performance used as a Cognitive Assessment of Working Memory capacity. N-Back games are often used as a method for training working memory as well as Fluid Intelligence"},"Nicole-van-der-Hoeven":{"slug":"Nicole-van-der-Hoeven","filePath":"Nicole van der Hoeven.md","title":"Nicole van der Hoeven","links":["Learning-in-Public","Obsidian-for-TTRPGs"],"tags":[],"content":"Creator of Fork My Brain. Many of her YouTube videos have served as inspiration for many aspects of my own vault.\n\nLearning in Public\nObsidian for TTRPGs"},"Nix-Flakes":{"slug":"Nix-Flakes","filePath":"Nix Flakes.md","title":"Nix Flakes","links":["NixOS","Nix"],"tags":[],"content":"Flakes have multiple functions, but their primary use is to lock individual packages (or your entire system) to an explicitly defined version to maximize the stability and reproducibility of your system. By default NixOS package versions are managed via “Channels”, wherein package version information is stored outside of your configuration file(s). Flakes, however, store all version information in a generated flake.lock file in your configuration directory, guaranteeing your system will use the same package versions defined by your Flake every time you rebuild your system.\nThe generated flake.lock can be versioned via a version control solution like Git to effectively create a time machine for your machine.\n\nNixOS\nNix"},"Nix-User-Repository-(NUR)":{"slug":"Nix-User-Repository-(NUR)","filePath":"Nix User Repository (NUR).md","title":"Nix User Repository (NUR)","links":["Nix"],"tags":[],"content":"The Nix User Repository is a registry of Nix community repos.\n\nWebsite: nur.nix-community.org/\nGithub: github.com/nix-community/NUR"},"NixOS-Rebuild-Lock-Issue":{"slug":"NixOS-Rebuild-Lock-Issue","filePath":"NixOS Rebuild Lock Issue.md","title":"NixOS Rebuild Lock Issue","links":["NixOS","Nix-Flakes"],"tags":[],"content":"When a NixOS system rebuild fails to complete for any reason, such as user interruption, the following error may occur on subsequent rebuilds:\nFailed to start transient service unit: Unit nixos-rebuild-switch-to-configuration.service was already loaded or has a fragment file.\nCould not acquire lock\n\nThe fix for this issue is to stop the lingering systemd service:\nsudo systemctl stop nixos-rebuild-switch-to-configuration.service\n\nThen rebuild the system as normal:\nsudo nixos-rebuild switch --flake .\n\n\nNixOS\nNix Flakes"},"NixOS":{"slug":"NixOS","filePath":"NixOS.md","title":"NixOS","links":["Linux-Distribution","Nix-Package-Manager","Nix-Flakes","Home-Manager","Free-and-Open-Source-Software-(FOSS)","Linux","Nix"],"tags":[],"content":"Introduction\nNixOS is A FOSS Linux Distribution based on the Nix Package Manager. It’s built on the principles of immutability, atomic updates, and strictly declarative system configuration allowing for extremely reliable reproducibility and portability.\nUseful NixOS Resources\n\nSearch Nix packages\nSearch options for NixOS &amp; Home-manager configs\nInteresting QOL tools for NixOSI should consider integrating into my flake.\nMight be worthwhile to look into Snowflakes, a flavor of NixOS focusing on ease of use.\n\n\nConfiguration Basics\nStarting from initial installation, the entirety of NixOS is managed by two configuration files: hardware-configuration.nix for managing drivers and other hardware related tasks, and configuration.nix for everything else. Both are generated automatically when NixOS is installed, and for most users only the later needs to be modified.\nConfiguration files are created by default in the /etc/nixos/ directory, and can be copied and moved for the sake of creating multiple configurations or changing its location for backup and version control.\nAs of NixOS 19.03 the default configuration file can be edited with the command sudo nixos-rebuild edit, and the new changes finalized with sudo nixos-rebuild switch.\nWhen using Nix Flakes, a topic that’ll be expanded on later, a system rebuild can be initiated by appending the --flake /path/to/flake.nix flag to the command.\nThe command `sudo nixos-rebuild switch --flake .` will build the system based on the file named flake.nix in the current directory.\n \n\nNix Flakes\nHome-Manager\n\nFree and Open Source Software (FOSS)\nLinux\nNix"},"Note-Taking":{"slug":"Note-Taking","filePath":"Note Taking.md","title":"Note Taking","links":["Structural-Notes","Inspectional-Reading","Conceptual-Notes","Analytical-Reading","Dialectical-Notes","Syntopical-Reading","Antinet-Zettlekasten","Bibcards","Personal-Knowledge-Management-(PKM)","Zettlekasten","How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren","Obsidian"],"tags":[],"content":"Kinds of Notes\nNotes can generally be divided into three broad categories:\n\nStructural Notes: Outlines made during Inspectional Reading.\nConceptual Notes: Observations made in the process of Analytical Reading.\nDialectical Notes: Comments on the shape of discussion engages in by all relevant authors during Syntopical Reading.\n\nAdler’s categories of note types listed above applies cleanly to the Antinet Zettlekasten workflow. The Bibcards used in Luhmmann’s system can be described as Structural, the individual zettles themselves as Analytical, and the Antinet as a whole (including one’s own notes and comments scattered throughout) are Dialectical in nature.\n\nPersonal Knowledge Management (PKM)\nZettlekasten\nAntinet Zettlekasten\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren\nObsidian"},"Obsidian-Plugins":{"slug":"Obsidian-Plugins","filePath":"Obsidian Plugins.md","title":"Obsidian Plugins","links":["Obsidian","Advanced-Tables-Plugin","BRAT-Obsidian-Plugin","Buttons-Plugin","Dataview-Plugin","Markdown-Formatting-Assistant-Plugin","Omnivore-Plugin","Quick-Add-Plugin","Smart-Random-Note-Plugin","Spaced-Repetition-Plugin","Templater-Plugin","Timeline-Plugin","Timestamp-Notes-Plugin","Trash-Explorer-Plugin","Obsidian-Vault-Changelog-Plugin"],"tags":[],"content":"A list of the Obsidian Community Plugins I use, and notes about their basic usage and place in my system.\n\nAdvanced Tables Plugin\nBRAT Obsidian Plugin\nButtons Plugin\nDataview Plugin\nMarkdown Formatting Assistant Plugin\nOmnivore Plugin\nQuick Add Plugin\nSmart Random Note Plugin\nSpaced Repetition Plugin\nTemplater Plugin\nTimeline Plugin\nTimestamp Notes Plugin\nTrash Explorer Plugin\nObsidian Vault Changelog Plugin\n"},"Obsidian-Publish-and-The-Doc-Web":{"slug":"Obsidian-Publish-and-The-Doc-Web","filePath":"Obsidian Publish and The Doc Web.md","title":"Obsidian Publish and The Doc Web","links":["The-Doc-Web-by-Jay-Springett","Learning-in-Public"],"tags":["inbox"],"content":"\nThe idea of The Doc Web, inspired by The Doc Web by Jay Springett\nUse of Obsidian.MD as a publishing platform rather than just a note taking platform\nSome people use obsidian publish, others use GitHub\n\nNicole van der Hoeven is an example of using Obsidian Publish as an experiment in “Learning in Public” via her public vault Fork My Brain\n\nOn Learning in Public\nShe is also writing a book in public with a GitHub repo where people can contribute\n\n\nObsidian Hub is an experimental vault maintained by the community, which people can actively contribute to on GitHub While all of the documents are very much focused on Obsidian itself, I can imagine this format being an interesting and engaging way to work on collaborative world building projects\nTristram Oaten of the YouTube channel NoBoilerplate  hosts an obsidian vault on GitHub which he treats as the open source “code” of all of his videos, an interesting example\n\n\n\n\nLearning in Public"},"Obsidian-Vault-Changelog-Plugin":{"slug":"Obsidian-Vault-Changelog-Plugin","filePath":"Obsidian Vault Changelog Plugin.md","title":"Obsidian Vault Changelog Plugin","links":["Obsidian-Plugins","Nicole-van-der-Hoeven"],"tags":[],"content":"An Obsidian Plugin for automatically generating a list of recently modified or created notes in a vault.\nI’m using Nicole van der Hoeven’s variant of the plugin, which includes the ability to exclude specific folders from the change log."},"Obsidian":{"slug":"Obsidian","filePath":"Obsidian.md","title":"Obsidian","links":["Markdown","Note-Taking","Obsidian-Plugins","Obsidian-Web-Clipper","Personal-Knowledge-Management-(PKM)","Zettlekasten"],"tags":[],"content":"A free Markdown based Note Taking app popular for its huge library of Obsidian Plugins\nIn 2024, the Obsidian team released an official Obsidian Web Clipper browser extension\n\nPersonal Knowledge Management (PKM)\nZettlekasten"},"Omnivore-(Web-Clipper)":{"slug":"Omnivore-(Web-Clipper)","filePath":"Omnivore (Web Clipper).md","title":"Omnivore (Web Clipper)","links":["Free-and-Open-Source-Software-(FOSS)","Omnivore-Plugin","Obsidian-Web-Clipper","Obsidian"],"tags":[],"content":"A Free and Open Source Software (FOSS) “Read It Later” app for saving web pages and articles.\nI used it alongside the Obsidian Omnivore Plugin to take notes on articles until the official Omnivore server shut down. I could host my own instance, but in an effort to  remain server-less I’ve opted to use the new official Obsidian Web Clipper instead.\n\nObsidian"},"PKMashup-Notes":{"slug":"PKMashup-Notes","filePath":"PKMashup Notes.md","title":"PKMashup Notes","links":["Incremental-Writing","Writing-Inbox","Obsidian","Smart-Random-Note-Plugin","Game-Ideas","tags/pkmashup","PKMashup-Notes","Personal-Knowledge-Management-(PKM)"],"tags":["inbox","pkmashup"],"content":"As part of a daily Incremental Writing and PKM routine I’ve been having great success with what I’ve started to call PKMashup Notes. The process is pretty simple: every day when I sit down to start working on my Writing Inbox I open two random notes from my Obsidian vault using the Smart Random Note Plugin. My task then is to brainstorm and create an entirely new note linking those two ideas.\nWhat that note looks like is open to exploration. It could be a new idea or concept connecting two concepts I’ve written about previously, they can be new Game Ideas, or a bit of fiction in the form of short/micro stories or a bit of poetry.\nHow the note connects the two ideas is highly flexible and open to interpretation. Sometimes the new idea directly connects the two random notes in a very clear way, sometimes it’s loosely inspired by a combination of specific sections or concepts in each note, and sometimes it can draw on entirely different notes linked by the random selections. What matters isn’t the two specific notes, but the exercise of creating new connections that wouldn’t otherwise be made.\nAdding the following section to PKMashup notes helps to track them in the vault as they develop over time, as well as what two ideas originally launched the idea:\n\nThis note is a pkmashup  of ------- and ------ . See PKMashup Notes to learn more.\n\n\nPersonal Knowledge Management (PKM)"},"Passively-Become-a-Hyper-Niche-Expert":{"slug":"Passively-Become-a-Hyper-Niche-Expert","filePath":"Passively Become a Hyper-Niche Expert.md","title":"Passively Become a Hyper-Niche Expert","links":["Find-Your-Niche","Obsidian","Hyper-Niche","Learning-in-Public","Make-it-Satisfying","Building-Habits-through-Peer-Pressure","Working-in-Public","tags/pkmashup","Hack-Habits-through-Talent","Obsidian-Publish-and-The-Doc-Web","PKMashup-Notes"],"tags":["pkmashup"],"content":"One of the most effective way to Find Your Niche is to simply allow yourself to pursue any and all of your interests as they arise and organize what you learn in a trusted knowledge management system that easily facilitates linking ideas together (like Obsidian). The process of creating novel connections between your own special interests starts to surface new areas of extremely specific overlap and collision previously unheard of.  By honing in on topics of extremely unique specialization, you start to become an expert of a domain that very few people (if any) have even been aware of before - this is where somebody has the opportunity to carve out their own Hyper Niche.\nThis process can be significantly expedited by Learning in Public. Sharing what you’re learning and allowing people to share their insights can significantly increase the rate at which you’re exposed to new ideas, as well as illuminate potential blind spots in your knowledge. This feedback can often feel incredibly rewarding, and the positive peer pressure that comes along with that feed back goes a long way to sustaining motivation.\nA great side effect of learning and Working in Public (whether it’s publishing notes, essays, articles, etc.) is that it also gradually generates a visible body of work that helps to passively market yourself as a specialist in your areas of interest and potentially establish yourself as an expert authority in your hyper-niche domain.\n\n“Over the years, I’ve published many essays about worlds and worlding on my blog. Worlds are literally my specialist subject—the deep knowledge that people hire me for as a freelancer.”\n…\n“Putting all the worlds essays into one location has possibly been the best “content” decision I’ve ever made. I accidentally had written a book.”\n\nJay Springett, The Doc Web\n\n\n\nThis note is a pkmashup  of Hack Habits through Talent and an early draft of Obsidian Publish and The Doc Web . See PKMashup Notes to learn more.\n"},"Personal-Knowledge-Management-(PKM)":{"slug":"Personal-Knowledge-Management-(PKM)","filePath":"Personal Knowledge Management (PKM).md","title":"Personal Knowledge Management (PKM)","links":["Zettlekasten","Note-Taking","The-Four-Levels-of-Reading","Obsidian","Omnivore-(Web-Clipper)","Obsidian-Web-Clipper","Productivity"],"tags":[],"content":"A field of study and practice dedicated to optimizing the way individuals find, collect, store, and retain knowledge. Also used to refer to the various tools, methods, and systems for doing such.\n\nZettlekasten\nNote Taking\nThe Four Levels of Reading\nObsidian\nOmnivore (Web Clipper)\n\nI’ve since switched to Obsidian Web Clipper instead. Omnivore is great, but I’ve decided to keep my workflow server-less where possible.\n\n\n\n\nProductivity"},"Phenomenology-of-Agency":{"slug":"Phenomenology-of-Agency","filePath":"Phenomenology of Agency.md","title":"Phenomenology of Agency","links":["Agent"],"tags":[],"content":"Some thoughts on Agency, initially stemming from this lecture by Time Bayne on the phenomenology of agency.\nOne idea they explore is whether an action performed without the experience of Authorship is an action at all, or an event. He purposes that an experience of agency requires a conscious, causal connection between Intention and Event.\nI’ll need to rewatch to find the paper he references, but the paper suggests a number of essential qualities of Agency:\n\nIt is Recessive. Parts of it recede to the periphery of experience as intentionality shifts, just as the edges of vision “fade” from view as you focus. This is experienced as a spectrum of low agency but intentional events, such as tapping one’s foot, as opposed to incredibly deliberate high-agency events.\nIt is “Transparent”, I’ll need clarification on this point\nFurther clarifies the need for a clear causal connection between intentionality and event\n\nThey raise some interesting questions about the nature of agency as it relates to cognitive events. The original author describes events in terms of physical motion, but what of Cognitive Phenomenology and mental gestures? Can thoughts themselves be actions, and are they something we have some degree of agency over? Do we ourselves exist as exterior, agentic entities acting on our mental states with intention - or, is our experience of agency or “will” an emergent and illusory quality of preexisting metal states."},"Phenomenology":{"slug":"Phenomenology","filePath":"Phenomenology.md","title":"Phenomenology","links":["Ontology","Edmund-Husserl"],"tags":[],"content":"The philosophical study of reality as it is immediately, subjectively experienced. As a discipline it it concerned with analyzing phenomena as things in and of them selves without making any assumptions regarding the ontological content of said phenomena. Edmund Husserl is considered the founder of modern phenomenology, and set the foundation for phenomenology as a method moving forward.\n"},"Planetary-Speed,-Retrogrades,-and-Stations":{"slug":"Planetary-Speed,-Retrogrades,-and-Stations","filePath":"Planetary Speed, Retrogrades, and Stations.md","title":"Planetary Speed, Retrogrades, and Stations","links":["Valens","Hellenistic-Astrology-by-Chris-Brennan","Astrology","Hellenistic-Astrology","Planets"],"tags":[],"content":"Planets moving faster than normal manifest quicker in life, while slower ones are delayed. Valens describes stationing planets as being delayed, and retrogrades as hindered or illusory.\n\nHellenistic Astrology by Chris Brennan\nAstrology\nHellenistic Astrology\nPlanets"},"Planets":{"slug":"Planets","filePath":"Planets.md","title":"Planets","links":["Sun","Moon","Mercury","Venus","Mars","Jupiter","Saturn","Uranus","Neptune","Pluto","Benefics-and-Malefics","Sect","Gender-of-the-Planets","Under-the-Beams","Contraries-of-the-Planets","Planetary-Speed,-Retrogrades,-and-Stations","Morning-Stars-vs.-Evening-Stars","Lunar-Nodes","Hellenistic-Astrology-by-Chris-Brennan","Astrology","Hellenistic-Astrology"],"tags":[],"content":"From the phrase “planetes asteres” meaning “wandering stars” because they appeared to the ancients as stars in the sky, but their movement could be tracked by the naked eye.\nTraditional Planets\n\nSun\nMoon\nMercury\nVenus\nMars\nJupiter\nSaturn\n\nModern Planets\n\nUranus\nNeptune\nPluto\n\nBenefics and Malefics\nSect\nGender of the Planets\nUnder the Beams\nContraries of the Planets\nPlanetary Speed, Retrogrades, and Stations\nMorning Stars vs. Evening Stars\nLunar Nodes\n\nHellenistic Astrology by Chris Brennan\nAstrology\nHellenistic Astrology"},"Point-Crawls-and-Depth-Crawls":{"slug":"Point-Crawls-and-Depth-Crawls","filePath":"Point Crawls and Depth Crawls.md","title":"Point Crawls and Depth Crawls","links":["Running-a-Hexcrawl"],"tags":[],"content":"A compelling alternative to Running a Hexcrawl\nYochai Gal — 8/30/22, 11:32 AM\nHere are some more:\ndiyanddragons.blogspot.com/2018/02/sub-hex-crawling-mechanics-part-1.html\nslyflourish.com/pointcrawls.html\nvaultsofvaarn.com/2021/04/20/vaarn-region-generator/\nwww.necropraxis.com/2013/04/10/solipsistic-hexes/\nalchemistnocturne.blogspot.com/2021/12/wilderness-pointcrawls-vs-hexcrawls-vs.html\ntsojcanth.wordpress.com/2016/08/03/how-i-hexcrawl/\narsphantasia.wordpress.com/2014/02/20/hexcrawl-resources/\nblog.d4caltrops.com/2022/05/table-talk-my-process-for-random-tables.html\nwelshpiper.com/hex-based-campaign-design-part-1/\nosrsimulacrum.blogspot.com/2020/05/making-wilderness-play-meaningful-system.html\ndeeperintothedungeon.wordpress.com/2022/04/27/pointcrawls-and-tight-packed-sandboxes/\nwww.youtube.com/watch\ntrollsmyth.blogspot.com/search“Hex+Mapping+Part”&amp;max-results=20&amp;by-date=true\ndetectmagic.blogspot.com/2014/04/pathcrawl.html\nsilverarmpress.com/why-i-use-point-crawls-more-than-hex-crawls/\nPoint Crawls\n\nhillcantons.blogspot.com/2014/11/pointcrawl-series-index.html\nthealexandrian.net/wordpress/48666/roleplaying-games/pointcrawls\nthealexandrian.net/wordpress/48668/roleplaying-games/pointcrawls-part-2-advanced-pointcrawl-procedures\nsilverarmpress.com/why-i-use-point-crawls-more-than-hex-crawls/\ndiyanddragons.blogspot.com/2018/02/sub-hex-crawling-mechanics-part-1.html\nalchemistnocturne.blogspot.com/2021/12/wilderness-pointcrawls-vs-hexcrawls-vs.html\nslyflourish.com/pointcrawls.html\n\nDepth Crawls\n\nthealexandrian.net/wordpress/48524/roleplaying-games/pointcrawl-addendum-depthcrawls\nthealexandrian.net/wordpress/48526/roleplaying-games/depthcrawls-part-2-advanced-options\nwww.skeletoncodemachine.com/p/depth-crawls\nrefereeingandreflection.wordpress.com/2025/03/16/leafing-through-the-depthcrawls-a-conversation-with-emmy-allen/\nskaldforge.wordpress.com/2020/08/30/basic-depthcrawl-procedure/\n\nInto the Odd\nskaldforge.wordpress.com/2020/10/16/depthcrawl-for-into-the-odd/"},"Practical-vs.-Theoretical-Books":{"slug":"Practical-vs.-Theoretical-Books","filePath":"Practical vs. Theoretical Books.md","title":"Practical vs. Theoretical Books","links":["How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren"],"tags":[],"content":"The practical is concerned with what works in the short or long term. The theoretical concerns something to be seen or understood. To make knowledge practical, we must convert theory to rules of operation.\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren"},"Process-Identity":{"slug":"Process-Identity","filePath":"Process Identity.md","title":"Process Identity","links":["Process-Phenomenology","Phenomenology","Process-Philosophy","Programmable-Identity"],"tags":[],"content":"\nA very rough idea I’m developing regarding a process-oriented phenomenology of identity\nAs a process identity has two poles, the “mental” and “physical” - or the un-actualized and actualized.\n\nIt is a constellation of aims towards an ideal, an eternal object, and a historicity of concresences\n\n\nIdentity is relationally composed based on preference and desire. The things we identify with are those phenomena which are most preferred in relation to their alternative\n\nIf preference is rooted in Desire as the good of the self, then identity is a negotiation between historicity and a yearning towards the good.\n\n\nMight be developed into a sort of Process Phenomenology?\n\n\nPhenomenology\nProcess Philosophy\nProgrammable Identity"},"Process-Phenomenology":{"slug":"Process-Phenomenology","filePath":"Process Phenomenology.md","title":"Process Phenomenology","links":["Process-Philosophy","Phenomenology","Intentionality","Epoché-and-Phenomenal-Reduction","Phenomenal-Field","Phenomenal-Horizon","Historicity"],"tags":[],"content":"Some very rough thoughts about Process Philosophy, Phenomenology, and how one might arrive at the former via the latter.\nCore Principles\n\nIntentionality: Consciousness is fundamentally relational given that it is always conscious of, directed towards, a phenomenal object.  The intentional act always has present in it the Noesis, the act of perception, and a Noema: the content or object of that perceptual act.\nEpoché and Phenomenal Reduction: It is necessary to suspend preexisting judgements about reality, and come to understand reality first through a detailed understanding of the structures and faculty through which we perceive reality.\nThe Phenomenal Field: Phenomena are not experienced in isolation from one another, but are encountered in the context of a phenomenal field which is then observed through the intentional act.\n\nEach phenomena within the phenomenal field has present within it a Phenomenal Horizon, which include the wider background context of associations, Historicity, and potential future interactions with said phenomena.\nThe phenomenal field is intrinsically temporally constituted. We cannot grasp and hold a static instantiation of a given phenomena through the intentional capacity, as each moment of phenomenal apprehension has implicated within it the contextual historicity of each preceding moment of apprehension and future anticipations, as well its wider phenomenal field.\n\nBecause of this, by adhering to the principle of Epoché and Phenomenal Reduction and committing to a principle of phenomenal parsimony, we must related to phenomena as processes of constant becoming rather than static entities.\n\n\n\n\nIn attempting a phenomenologically continuitous ontology we cannot posit an ontological substance beyond or other than that which composes our phenomenal experience. Similarly, I argue that we cannot with any logical integrity posit other ontological modalities beyond those we can directly apprehend. Therefore, to begin speculating about the ontological content of phenomenon, it would be most appropriate to suppose that reality is processional and relational in character.\nBecause we can apprehend relational consequences emerging from continuities outside of horizon of our phenomenal field, we can reasonably assume the ontological validity of processes beyond our phenomenal horizon.\n\nIt would be most appropriate and parsimonious to assume such entities to be of the same process relational character we can and have validated through our own phenomenal encounters.\n\n\nThen, arguing from our most immediately verifiable phenomenal experience, the most appropriate ontology would be to a process relational framework of relationally composed entities intentionally prehending historicities (actual occasions) and proximal potentialities (eternal objects), which the ontological process of concrescence being analogous to the phenomenological stream of consciousness.\n"},"Process-Philosophy":{"slug":"Process-Philosophy","filePath":"Process Philosophy.md","title":"Process Philosophy","links":[],"tags":[],"content":""},"Programmable-Attention":{"slug":"Programmable-Attention","filePath":"Programmable Attention.md","title":"Programmable Attention","links":["Andy--Matuschak","Spaced-Repetition","Steps-to-Habit-Formation","Laws-of-Habit-Modification","Incremental-Writing","Raph-Koster","Game-Design-Patterns","Vision-Deck","Habit-Stacking","Unusual-applications-of-spaced-repetition-memory-systems","Programmable-attention-by-Andy--Matuschak","Make-it-Obvious"],"tags":[],"content":"A term I believe was coined by Andy  Matuschak, the concept of Programmable Attention refers to the use of various tools and systems (most notably Spaced Repetition) to “orchestrate your repeated attention over time across hundreds of tiny tasks”.\nWhile such systems are originally designed for learning and productivity, they can also be used in unconventional ways to facilitate habit formation and modification and support creative consistency. I am particularly interested in the idea of using Spaced Repetition to support Incremental Writing.\nSimilar to how Raph Koster describes Game Design Patterns and being isomorphic to each other at the most abstract level, it seems many systems and patterns for learning and habit modification are as well. According to Andy, Spaced Repetition is no different:\n\n“It’s interesting to imagine a single interface malleable enough that I could define my piano exercises above as one sort of routine, and a SRS memory system as another routine—both special cases of a single general primitive.”\n\nAndy Matuschak on using SR to program attention.\n\n\nI somewhat unintentionally accomplished something similar in analog format with my Vision Deck, which helped to surface specific projects, cultivate mindfulness, maintain relationships, and facilitate Habit Stacking by dumping me right into what would normally be high-friction tasks.\n\nSome other Unusual applications of spaced repetition memory systems from Andy Matuschak.\n\nProgrammable attention by Andy  Matuschak\nMake it Obvious"},"Programmable-Identity":{"slug":"Programmable-Identity","filePath":"Programmable Identity.md","title":"Programmable Identity","links":["Programmable-Attention","Spaced-Repetition","Vision-Deck","Identity","James-Clear","Make-it-Satisfying","Levels-of-Habit-Formation","Andy--Matuschak","Incremental-Writing","tags/pkmashup","PKMashup-Notes","Atomic-Habits-by-James-Clear","Spaced-repetition-systems-as-catechism","Habit-Stacking"],"tags":["pkmashup"],"content":"Taking the idea of Programmable Attention even further, Spaced Repetition systems such as a Vision Deck can be used to prompt changes in Identity over time. In his book Atomic Habits, James Clear talks about how creating satisfying systems produces repeat outcomes that reinforce identity. By consistently resurfacing goals, values, relationships, projects, etc - one gradually re-minds and re-internalizes those parts of oneself.\nAndy  Matuschak writes in his note on Spaced Repetition Systems as Catechism  that like Catechism, spaced repetition systems effect identity through repeat exposure. A highly effective path to the internalization and automation of desired outcomes would be the integrating of a new identity though these methods. For example, if one wanted to become a great writer then that identity can be efficiently adopted though the systematization of an Incremental Writing routine.\n\nThis note is a pkmashup  of Vision Deck, Incremental Writing, and Make it Satisfying . See PKMashup Notes to learn more.\n\nAtomic Habits by James Clear\nSpaced repetition systems as catechism\nHabit Stacking"},"Propositions":{"slug":"Propositions","filePath":"Propositions.md","title":"Propositions","links":["Analytical-Reading","Coming-to-Terms","Determining-an-Author's-Message","How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren"],"tags":[],"content":"\n“A statement or assertion that expresses a judgement or opinion.”\n\nNew Oxford American Dictionary\n\n\nIn Analytical Reading, propositions are the answers to the Author’s questions, and require Coming to Terms. Just as terms represent the meaning of key words, propositions represent the meaning of key sentences. One must be able to translate a proposition into their own words to grasp it while Determining an Author’s Message\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren"},"Quartz":{"slug":"Quartz","filePath":"Quartz.md","title":"Quartz","links":["Static-Site-Generator","Obsidian","Github-Pages"],"tags":[],"content":"Quarts is a Static Site Generator specifically built for creating websites from Obsidian vaults.\nI’m increasingly interested in hosting my own vault as a Quartz site via Github Pages\n\nWebsite: quartz.jzhao.xyz/\nGithub: github.com/jackyzha0/quartz"},"Rapid-Serial-Visual-Presentation":{"slug":"Rapid-Serial-Visual-Presentation","filePath":"Rapid Serial Visual Presentation.md","title":"Rapid Serial Visual Presentation","links":[],"tags":[],"content":"Rapid Serial Visual Presentation (RSVP) is an approach to evaluating and training visual processing and reaction time by rapidly displaying words or images on a screen in rapid succession."},"Rating-of-Perceived-Exertion":{"slug":"Rating-of-Perceived-Exertion","filePath":"Rating of Perceived Exertion.md","title":"Rating of Perceived Exertion","links":[],"tags":[],"content":"Rating of Perceived Exertion (RPE) is a subjective quantification of how hard somebody feels they are working while exercising.\nThe following scale is used to evaluate RPE:\n\n10: Max Effort Activity\n9: Very Hard Activity\n7-8: Vigorous Activity\n4-6: Moderate Activity\n2-3: Light Activity\n1: Very Light Activity\n\n"},"ReaPack":{"slug":"ReaPack","filePath":"ReaPack.md","title":"ReaPack","links":["Reaper"],"tags":[],"content":"ReaPack is a FOSS package manager Reaper, which allows the browsing and installation and updating of extensions and themes from within Reaper itself."},"Reableton":{"slug":"Reableton","filePath":"Reableton.md","title":"Reableton","links":["SWS-Extensions","ReaPack","Ableton-Live","Reaper"],"tags":[],"content":"Reableton is a collection of scripts utilizing SWS Extensions and installed with ReaPack that recreates some of the workflow and audio manipulation features of Ableton Live in Reaper"},"Reaper":{"slug":"Reaper","filePath":"Reaper.md","title":"Reaper","links":["Digital-Audio-Workstation","Linux"],"tags":[],"content":"Reaper is the Digital Audio Workstation by Cockos known for it’s impressive catalog of features, accessible pricing, and extremely generous free trial.\n\nLinux"},"Recipe---Garlic-Egg-Toast-by-Cooking-Haru":{"slug":"Recipe---Garlic-Egg-Toast-by-Cooking-Haru","filePath":"Recipe - Garlic Egg Toast by Cooking Haru.md","title":"Recipe - Garlic Egg Toast by Cooking Haru","links":[],"tags":[],"content":"\n\nSoftened butter and minced garlic\n\nOptional 1 TBSP Honey\nParsley\nMix\n\n\n\nSandwich\n\nApply spread on upwards facing slices\nCut shape in middle of top slice\nSliced Cheese in center\nCrack one room temperature egg in the hole\nSprinkle shredded cheese around the top edge of the sandwich\nSprinkle salt on the egg\n\n\n\nBake\n\nPlace sandwich and cutting on parchment baking sheet\n10 minutes in oven preheated to 350 * F\n\nMay take longer. Bake until whites no longer jiggle. Remove toast disk early if necessary\n\n\n\n\n"},"Recipe---Garlic-Smashed-Potatoes-Recipe-by-Cooking-Haru":{"slug":"Recipe---Garlic-Smashed-Potatoes-Recipe-by-Cooking-Haru","filePath":"Recipe - Garlic Smashed Potatoes Recipe by Cooking Haru.md","title":"Recipe - Garlic Smashed Potatoes Recipe by Cooking Haru","links":[],"tags":[],"content":"Ingredients:\n\nSmall Potatoes\n\nSteps\n\nPotato Prep\n\nCover potatoes in pot with water.\nAdd 1/2 TBSP of Salt\nBoil for 15-20 minutes until soft enough\nDrain water when done and let evaporate\n\n\nBaking\n\nPlace parchment paper on baking sheet\nPlace potatoes evenly\nPress with potato masher dry for 5 minutes (to make it crispier)\nSeasoning]\n\nMix 35-40g Melted Butter and 2 TBSP of Olive Oil. Apply to potatoes\n\nOptional: Minced Garlic mixed in butter sauce\n\n\nSalt\nOregano\n\n\nBake for 30 minutes in the oven pre-heated to 395 degrees ferinhet\n\n\nDressing\n\nPepper\nOptional: Parsley\n\n\n\nSauce\n\n4 part Mayo\n1 Siracha\nOptional: 1 part Condensed Milk\n"},"Roles-(Design-Pattern)":{"slug":"Roles-(Design-Pattern)","filePath":"Roles (Design Pattern).md","title":"Roles (Design Pattern)","links":["Koster's-Taxonomy-of-Games","Adding-Gameplay-Verbs-and-Goals","Game-Design-Patterns","Role-Playing-Games","Do-classes-suck--–-Raph's-Website"],"tags":[],"content":"At the most fundamentally abstract level, games as rules constructs are essentially a collection of verbs and goals. In designing multiplayer experiences, it is critically important to clearly model and communicate how a player ought to relate to other players if they are to feel engaged with your world. The most effective way is to assign different or goals which intrinsically incentivize either cooperation or competition with one another.  This specific Design Pattern is called a “Role”, and is the mechanical foundation of all Role Playing Games (though it is not exclusive to them).\n\nDo classes suck- – Raph’s Website"},"Roll-for-Role-(MOSAIC-Strict)":{"slug":"Roll-for-Role-(MOSAIC-Strict)","filePath":"Roll for Role (MOSAIC Strict).md","title":"Roll for Role (MOSAIC Strict)","links":["MOSAIC-Strict","Table-Top-Role-Playing-Games-(TTRPGs)","Class-Systems","tags/pkmashup","Expansive-World-Design-with-MOSAIC-Strict","Creativity-Through-Context-Replacement","PKMashup-Notes","Roles-(Design-Pattern)"],"tags":["pkmashup"],"content":"Roll for Role a flexible, freeform MOSAIC Strict module for TTRPG Class Systems. Either when creating a character or beginning a session players will roll on a “role chart”, which will assign them an abstract character class. Whenever a character performs an action that is appropriate to their Role, if that action requires any sort of conflict resolution or has a potential for bonuses, the appropriate bonus will be granted.\nExample Role Chart:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1d6Role1Juggernaut2Herald3Recon4Defender5Sabatour6Medic\nKeeping character classes abstract but still defining a clear character role encourages teamwork and coordination, and if the Gamemaster chooses to permit re-rolls at specific times, it also encourages experimentation.\n\nThis note is a pkmashup  of Expansive World Design with MOSAIC Strict, Creativity Through Context Replacement, and Class Systems . See PKMashup Notes to learn more.\n\nRoles (Design Pattern)"},"Running-a-Hexcrawl":{"slug":"Running-a-Hexcrawl","filePath":"Running a Hexcrawl.md","title":"Running a Hexcrawl","links":["MOSAIC-Strict"],"tags":["TTRPGs"],"content":"Introduction\nA “hexcrawl” is a mechanic for abstracting long distance travel and exploration in TTRPGs. In the early days of Dungeons and Dragons, this system was derived from the board game “Outdoor Survival” by Avalon Hill\n\nI’m very interested in exploring ways to convert or abstract boardgames into RPG mechanics, potentially as MOSAIC Strict modules\n\nOne of the most popular examples of a Hexcrawl is a campaign known as “The West Marches”, described in this blog post from Ars Ludi, which essentially launched an entire new subgenre of TTRPG campaigns.\nResources\nFirst, here is a long list of Hexcrawl resources from the blog Ars Phantasia to comb through.\nAdditionally:\n\nHex Generator for creating blank hex grids.\nHow to Hex crawl video with great info\n"},"SWS-Extensions":{"slug":"SWS-Extensions","filePath":"SWS Extensions.md","title":"SWS Extensions","links":[],"tags":[],"content":"SWS S&amp;M Extensions is a FOSS collection of features that integrate directly into [Reaper] expanding it’s functionality."},"Saturn":{"slug":"Saturn","filePath":"Saturn.md","title":"Saturn","links":["Kronos","Malefic","Diurnal-Sect","Hellenistic-Astrology-by-Chris-Brennan","Astrology"],"tags":["astrology"],"content":"\nAlso called Kronos. Malefic, solitary, deceitful, slow, inaction, boundaries, restraints, time and slowness. Farmers, administrators, fathers of other’s children. Death and imprisonment. Diurnal Sect. Rules lead, wood, and stone. Dark brown in color, sour in taste.\n\n\nFlashcards\nWhat is Saturn’s Sect?:: Diurnal\n\nWhat planet rules farmers, administrators, and fathers of other’s children?:: Saturn\n\n\nHellenistic Astrology by Chris Brennan\nAstrology"},"Sect":{"slug":"Sect","filePath":"Sect.md","title":"Sect","links":["Hellenistic-Astrology","Benefics-and-Malefics","Astrological-Chart","Diurnal-Sect","Sun","Jupiter","Saturn","Nocturnal-Sect","Moon","Venus","Mars","Mercury","Bounds","Planets","Zodiac","Hellenistic-Astrology-by-Chris-Brennan","Astrology","Morning-Stars-vs.-Evening-Stars"],"tags":[],"content":"Fundamental to Hellenistic Astrology, Sect alters the function of Benefics and Malefics in an Astrological Chart. The Diurnal Sect planets are Sun, Jupiter, and Saturn. The Nocturnal Sect planets are Moon, Venus, and Mars. Mercury aligns with the sect of the ruler of its Bounds, or more commonly by whether its a morning or evening stars.\nPlanets that are considered in-sect in a given chart generally more constructive, while those out of sect are thought to be agitated or inhibited in some way.\nRejoicing Conditions\nLess important than sect, diurnal planets prefer to be above the horizon in a day chart and below it in a night chart - with the reverse being true of nocturnal planets. There are also rejoicing schemes based on the Zodiac, but most of them conflict.\n\nHellenistic Astrology by Chris Brennan\nAstrology\nMorning Stars vs. Evening Stars"},"Session-Preparation":{"slug":"Session-Preparation","filePath":"Session Preparation.md","title":"Session Preparation","links":["Eight-Steps-of-the-Lazy-Dungeon-Master","Running-One-shots"],"tags":["TTRPGs"],"content":"\n\n                  \n                  Remember \n                  \n                \n\n\nThe less prep a GM does the better the session typically goes\n\n\n\nThe Lazy Dungeon Master Approach\nUtilize the Eight Steps of the Lazy Dungeon Master. When Running One-shots or working with minimal preparation time focus on steps two, four, and eight for maximum impact for the least effort.\n1. Review the Characters\n2. Create a Strong Start\n3. Outline Potential Scenes\n4. Define Secrets and Clues\n5. Develop Fantastic Locations\n6. Outline Important NPC\n7. Choose Relevant Enemies\n8. Select Major Rewards\nModular Adventure Preparation\nInstead of preparing a railroaded sequence of scenes, instead break those scenes down into modular components. Preparing Fantastic Locations, Enemies &amp; NPCs, Secrets &amp; Clues, Major Rewards, and potential scenes allows for the ideal blend of preparation and improvisation."},"Skill-Score-Cards-(MOSAIC)":{"slug":"Skill-Score-Cards-(MOSAIC)","filePath":"Skill Score Cards (MOSAIC).md","title":"Skill Score Cards (MOSAIC)","links":["MOSAIC-Strict","Use-Based-Skill-Systems","Habit-Score-Cards","tags/pkmashup","Skills-(Design-Pattern)","Agenda-Card","PKMashup-Notes"],"tags":["pkmashup"],"content":"This idea is still very much under construction and needs development\n\nAn idea for a MOSAIC Strict Use-Based Skill Systems inspired by Habit Score Cards.\nSkill Score Cards are a simple method for tracking, using, and improving skills and abilities over time in the absence of a conventional progression system. This system has a mode for one-shot play and a mode for session based play, allowing the GM to choose the pacing depending on the type of game being played. It also has an expansive mode and a retractive mode, depending on if you want the characters to become more or less powerful over time (the latter being great for narrative-focused Horror games).\nSetup\nOn a single index card, create a list of one or two word skills specific to your character as deemed appropriate by the Gamemaster, and next to each skill draw a row of five empty squares.\nRules\nCampaign Play: Each time a player lands a “Critial Hit”\nOne-Shot: Each time a player makes a successful role with a skill\nExpansive Play: Add your skill to the roll (Or maybe a roll under 1d6?)\nContractive Play: Subtract your skill from the roll (or maybe a roll over 1d6)\n\nThis note is a pkmashup  of Skills (Design Pattern) and Agenda Card. See PKMashup Notes to learn more.\n"},"Skills-(Design-Pattern)":{"slug":"Skills-(Design-Pattern)","filePath":"Skills (Design Pattern).md","title":"Skills (Design Pattern)","links":["Game-Design-Patterns","Traits-(Design-Pattern)","Roles-(Design-Pattern)","Do-classes-suck--–-Raph's-Website","Adding-Gameplay-Verbs-and-Goals"],"tags":[],"content":"At the most abstract level a Skill as a design pattern is a Trait which describes a specific gameplay verb or affordance the player has access to. These are typically ranked against one another, or chosen at the exclusion of other possible Skills in order incentivize players to step into a specific role in a multiplayer setting or otherwise create different modes of play in the same game.\n\nDo classes suck- – Raph’s Website\nAdding Gameplay Verbs and Goals"},"Sociocybernetics":{"slug":"Sociocybernetics","filePath":"Sociocybernetics.md","title":"Sociocybernetics","links":[],"tags":[],"content":""},"Solo-Journaling-Games-as-Hypersigils":{"slug":"Solo-Journaling-Games-as-Hypersigils","filePath":"Solo Journaling Games as Hypersigils.md","title":"Solo Journaling Games as Hypersigils","links":["Solo-Journaling-Games","Hypersigils","Journeying","Mundus-Imaginalis","Active-Imagination","Synchronicity","Table-Top-Role-Playing-Games-(TTRPGs)","Practical-Enchantment","Chaos-Magic"],"tags":[],"content":"An idea I’ve been exploring is the overlap between Solo Journaling RPGs and Hypersigils. I’ve had a lot of deeply profound experiences using journaling games as a method of Journeying, of exploring the Imaginal. Some recent experiments in using the interactive nature of journaling games as a method of ritualized Active Imagination and resulting Synchronicities has opened up the possibility for these games, and TTRPGs more generally, as an interface for Practical Enchantment. I’ll be writing more about this subject as future experiments generate more insights.\n\nChaos Magic"},"Solo-Journaling-Games":{"slug":"Solo-Journaling-Games","filePath":"Solo Journaling Games.md","title":"Solo Journaling Games","links":["Table-Top-Role-Playing-Games-(TTRPGs)","Journaling-Prompts","Real-Things-for-Real-People","Jay-Springett","Thousand-Year-Old-Vampire","Contractive-and-Expansive-Worlds"],"tags":[],"content":"Solo Journaling Games, sometimes also called Solo Journaling RPGs or just Solo RPGs, are a subgenre of TTRPG explicitly designed for solo play. Most are played though the navigation or generation of Journaling Prompts, which are then turned into the written entries that compose the gameplay itself.\nWhile these games are most commonly played though written journal entires, the genre also includes some more experimental and unconventional approaches to gameplay such as sketching, mapmaking, and audio / video recordings.\n\nIn Real Things for Real People, Jay Springett describes Solo Journaling games as Jungian psycho-technology, the concept that originally caught my attention and sparked my fascination with Solo RPGs.\n\n\nGames I’ve played\n\nThousand Year Old Vampire\n\n\nContractive and Expansive Worlds"},"Solo-RPG-MA-Wishlist":{"slug":"Solo-RPG-MA-Wishlist","filePath":"Solo RPG MA Wishlist.md","title":"Solo RPG MA Wishlist","links":["Summary-of-Suggestions-for-Solo-TTRPG-Improvements.pdf"],"tags":[],"content":"From Summary of Suggestions for Solo TTRPG Improvements.pdf\n\nCampaign sheets and tools\nMystery Mechanics\nSocial Mechanics\nStreamlined worldbuilding tools\nAccessible and Logical rules\nProgressive disclosure\nTactical combat that’s light on crunch\nTools for getting into play quickly, generating prompts, etc\nDowntime Mechanics\nFresh and thematic Generators\nSolo party and faction dynamics\n\n\nFrom Forecasting the Future of Solo RPGs\n\n~solo games where you switch points of view often, rotating between characters ~\n\nrules for playing other characters in the scene in a procedural way\n\n\n~Paths / Flow Charts / Algorithms in TTRPG Mechanics ~\nGame with mechanics for integrating Solo and Group play, narrowing the gap\nCommunity games with a shared bulletin / world events for Solo players\nMechanics that force the character to do things the player might not want to do\n\n\nWhat makes a great Solo RPG? 12 Factors that would make for a PERFECT Solo TTRPG game\nwww.youtube.com/watch\n\nmakes me feel anything can happen\n\nShould be able to surprise the player and provide tools to accommodate that\n\n\ncreates an interesting universe, not just character\n\nWorldbuilding tools\n\n\noffers oracles but doesn’t drown me in them\n\nEnough oracles to answer questions but not too many\n\n\nflow charts, cheat sheets + diagrams\n\nGraphics that ground you in the gameloop when lost\n\n\ntrusts to make it work but doesn’t make me do their job\n\nstrikes a balance between procedure and breathing room\n\n\nbuilds me a house but doesn’t decorate it\n\nGives the contours of a setting but doesn’t flood it\n\n\ntheoretically can play forever\nvery wide or very narrow\n\neither very specific or has an open play space\n\n\ngives me examples of play\n\nGives enough examples to make it clear how niche mechanics work\n\n\ngives me milestones to look forward to and a system to make my own\n\nclear long term goals\n\n\nshows me how to document my journey\n\nReifies milestones into an output and preserves progress\n\n\ngives me a reason to choose the game over real life\n\nHas a clear hook and creates a desire to be in the world\n\n\nsave space and chuck safety tools\n\n"},"Spaced-Repetition-Plugin":{"slug":"Spaced-Repetition-Plugin","filePath":"Spaced Repetition Plugin.md","title":"Spaced Repetition Plugin","links":["Obsidian","Anki","Spaced-Repetition","Obsidian-Plugins"],"tags":[],"content":"A community plugin for Obsidian which allows for Anki style Spaced Repetition directly in your vault.\nHere is an excellent tutorial by FromSergio\n\nObsidian Plugins"},"Spaced-Repetition":{"slug":"Spaced-Repetition","filePath":"Spaced Repetition.md","title":"Spaced Repetition","links":["Spaced-Repetition-Plugin","Obsidian","Programmable-Attention","Laws-of-Habit-Modification","Incremental-Writing","Spaced-repetition-memory-systems-make-memory-a-choice","Spaced-repetition-systems-can-be-used-to-program-attention"],"tags":[],"content":"A method for improved learning through reviewing information at spaced intervals, typically at increasing increments. Methods using Spaced Repetition principles have been shown to be highly effective in improving both conceptual comprehension and rote memorization. Utilizing systems and tools to resurface important or meaningful information makes memory a choice, as a reliable Spaced Repetition system preserves it and helps to gradually encode the information into long-term memory over time.\nSpaced Repetition can be abstracted down to a three primary components:\n\nA priority queue of micro-tasks\nAn interactive environment which presents sufficiently high-priority tasks\nFeedback actions which modify a task’s subsequent priority\n\nI personally use the Spaced Repetition Plugin in Obsidian for reviewing information. Spaced Repetition systems also have some fascinating unconventional uses cases concerning ideas such as Programmable Attention, habit modification, and Incremental Writing.\n\nSpaced repetition memory systems make memory a choice\nSpaced repetition systems can be used to program attention"},"Speed-Reading":{"slug":"Speed-Reading","filePath":"Speed Reading.md","title":"Speed Reading","links":["Superficial-Reading","Analytical-Reading","How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren"],"tags":[],"content":"A useful part of the Superficial Reading reading process. Speed reading methods emphasize establishing context and absorbing concepts rather than precise comprehension. It is ideal to be able to read at multiple speeds, specifically with an eye to which sections can be quickly skimmed and which sections will necessitate a more thorough Analytical Reading.\n\n“Many books are hardly worth skimming, some should be read quickly, and few read at a rate that allows for complete comprehension.”\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren\n\n\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren"},"Steps-to-Habit-Formation":{"slug":"Steps-to-Habit-Formation","filePath":"Steps to Habit Formation.md","title":"Steps to Habit Formation","links":["Atomic-Habits-by-James-Clear","Levels-of-Habit-Formation","Laws-of-Habit-Modification"],"tags":[],"content":"The structure of a habit is made up of four steps across two stages:\n\nProblem Stage\n\nCue: The specific stimuli set to trigger the behavior.\nCraving: The need or desire emerging in response to the cue.\n\n\nSolution Stage\n3. Response: The behavior performed to satisfy craving.\n4. Reward: The immediate positive or negative feedback resulting from the response to the craving.\n\n\nAtomic Habits by James Clear\nLevels of Habit Formation\nLaws of Habit Modification"},"Sun":{"slug":"Sun","filePath":"Sun.md","title":"Sun","links":["Helios","Diurnal-Sect","Hellenistic-Astrology-by-Chris-Brennan","Astrology"],"tags":["astrology"],"content":"\nAlso named Helios, it is all things visible and kingly - associated with fame, reputation, rulership, and priesthood. Also associated with mind, praxis, and inner self. Rules Gold, Wheat, and Barely. Diurnal Sect, color is yellow, bitter in taste.\n\n\nFlashcards\nWhat is the Sun’s Sect:: Dirunal\n\nWhat planet is associated with mind, praxis, reputation, and inner self?:: The Sun\n\n\nHellenistic Astrology by Chris Brennan\nAstrology"},"Superficial-Reading":{"slug":"Superficial-Reading","filePath":"Superficial Reading.md","title":"Superficial Reading","links":["Elementary-Reading","Analytical-Reading","How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren","Speed-Reading"],"tags":[],"content":"A deliberate type of Elementary Reading done in preparation for Analytical Reading. In reading a difficult book for the first time, it’s useful to read it cover to cover without stopping to ponder topics you don’t understand. This first pass through the book will give you the context necessary to better understand it on subsequent reads.\n\n“Understanding half of a really tough book is much better than not understanding it at all.”\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren\n\n\nThis is the stage at which methods of Speed Reading are most appropriate, as your goal is not to comprehend everything you read but establish context and identify the chapters and passages worth your time.\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren"},"Syntopical-Reading":{"slug":"Syntopical-Reading","filePath":"Syntopical Reading.md","title":"Syntopical Reading","links":["Analytical-Reading","Conceptual-Notes","Extrinsic-Reading","Dialectical-Notes","Systematic-Skimming","Coming-to-Terms","Identify-an-Author's-Solutions","How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren"],"tags":[],"content":"The art of reading many books, placing them in relation to each other, and the topics which they concern. This is generally done through the process of conducting an Analytical Reading of individual texts while taking Conceptual Notes on the topic of interest, followed up with Extrinsic Reading and conducting a comparison of the sources by making Dialectical Notes of some kind.\nSteps to Syntopical Reading\nPart 1: Pre-reading\n\nBuild a tentative bibliography of potentially relevant books.\nInspect all chosen books for relevancy to the topic of interest and prune unnecessary sources to get a clear idea of the scope of the project.\nPart 2: Syntopical Reading\nInspect all books for relevant chapters and sections through Systematic Skimming.\nBring all of the authors to terms by Coming to Terms with each one and establishing a unified terminology.\nEstablish a list of questions to which all authors give answers to. (See Identify an Author’s Solutions)\nIdentify key points of conflict.\nOrder the questions and issues from most general to most specific, the begin analysis and comparison.\n\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren"},"Systematic-Skimming":{"slug":"Systematic-Skimming","filePath":"Systematic Skimming.md","title":"Systematic Skimming","links":["Inspectional-Reading","Superficial-Reading","Analytical-Reading","How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren"],"tags":[],"content":"The key component of Inspectional Reading, Systematic Skimming is about quickly surveying a text in order to get a feel for its contents and structure.\nThe steps to systematic skimming are as follows:\n\nExamine the title page and Preface(s)\nStudy the Table of Contents\nExplore the Index\nRead the Publisher’s blurb\nExamine the chapters pivotal to the argument.\nSkim the book, dipping in for a paragraph or two, but now more.\n\nUpon deciding whether or not the book is worth engaging with at a deeper level, you can proceed to the stage of Superficial Reading in preparation for Analytical Reading.\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren"},"Table-Top-Role-Playing-Games-(TTRPGs)":{"slug":"Table-Top-Role-Playing-Games-(TTRPGs)","filePath":"Table Top Role Playing Games (TTRPGs).md","title":"Table Top Role Playing Games (TTRPGs)","links":["Embed-Perchance-Generators-in-Obsidian-Notes","Gamemaster-Ideas","Running-a-Hexcrawl","MOSAIC-Strict","Spelldivers"],"tags":["TTRPGs"],"content":"Embed Perchance Generators in Obsidian Notes\n\n\nGamemaster Ideas\nRunning a Hexcrawl\nMOSAIC Strict\nSpelldivers\n"},"The-Four-Levels-of-Reading":{"slug":"The-Four-Levels-of-Reading","filePath":"The Four Levels of Reading.md","title":"The Four Levels of Reading","links":["Elementary-Reading","Inspectional-Reading","Analytical-Reading","Syntopical-Reading","How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren"],"tags":[],"content":"Called levels rather instead of kinds because they a cumulative rather than distinct.\n\nElementary Reading: The basic, rudimentary skills in reading.\nInspectional Reading\nAnalytical Reading\nSyntopical Reading\n\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren"},"The-Importance-of-Suspending-Judgement":{"slug":"The-Importance-of-Suspending-Judgement","filePath":"The Importance of Suspending Judgement.md","title":"The Importance of Suspending Judgement","links":["How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren","Criticizing-a-Book-Fairly","Avoiding-Contentiousness"],"tags":[],"content":"One must be reasonably certain that they understand what is being said before they can genuinely agree, disagree, or suspend judgement. Suspension itself is also a type of criticism - it is the stance of not being convinced of one position or the other. only after proper effort towards understanding is “I don’t understand” a valid criticism.\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren\nCriticizing a Book Fairly\nAvoiding Contentiousness"},"The-Power-of-Outlining-a-Book":{"slug":"The-Power-of-Outlining-a-Book","filePath":"The Power of Outlining a Book.md","title":"The Power of Outlining a Book","links":["Structural-Notes","Bibcards","How-to-read-a-book-by-Mortimer-Jerome-Adler,-Charles-Van-Doren"],"tags":[],"content":"It is easier to grasp a unified structure by understanding its parts as self-contained wholes, each with its own unity. The reader is to try to uncover the skeleton of the book which the author has covered up. This is the benefit of Structural Notes such as those taken on Bibcards.\n\nHow to read a book by Mortimer Jerome Adler, Charles Van Doren"},"Timeline-Plugin":{"slug":"Timeline-Plugin","filePath":"Timeline Plugin.md","title":"Timeline Plugin","links":[],"tags":[],"content":"From the Timeline Plugin Github Repo:\nBuild Amazing Timelines\nWe recommend you use the snippet instead for footnotes and node links and use it with other plugins.\n\nHow to use it\nChoose the timeline or timeline-labeled tag\n\n\ntimeline tag\nRequires + at the beginning of each line:\n\neach event has 3 +s in total: 1 for time, 1 for title and 1 for content\nyou can separate them with empty lines if it’s easier for you to write\n\n```timeline\n[line-3, body-2]\n+ pre&lt;/br&gt; 17th century\n+ Origins of coffee\n+ The modern version of roasted coffee originated in Arabia. During the 13th century, coffee was extremely popular with the Muslim community for its stimulant powers, which proved useful during long prayer sessions. By parching and boiling the coffee beans, rendering them infertile, the Arabs were able to corner the market on coffee crops. In fact, tradition says that not a single coffee plant existed outside of Arabia or Africa until the 1600s, when Baba Budan, an Indian pilgrim, left Mecca with fertile beans fastened to a strap across his abdomen. Baba’s beans resulted in a new and competitive European coffee trade.\n \n+ 17th century\n+ Europe and coffee\n+ In 1616, the Dutch founded the first European-owned coffee estate in Sri Lanka, then Ceylon, then Java in 1696. The French began growing coffee in the Caribbean, followed by the Spanish in Central America and the Portuguese in Brazil. European coffee houses sprang up in Italy and later France, where they reached a new level of popularity. Now, it is de _rigueur_ for Parisians to indulge in a cup of coffee and a baguette or croissant at the numerous coffee cafes throughout Paris.\n```\n\n\ntimeline-labeled tag\n\neach event has a corresponding label (date, title and content) that starts the line\nyou can separate them with empty lines if it’s easier for you to write\n\n```timeline-labeled\n[line-3, body-2]\ndate: pre&lt;/br&gt; 17th century\ntitle: Origins of coffee\ncontent:\nThe modern version of roasted coffee originated in Arabia. During the 13th century, coffee was extremely popular with the Muslim community for its stimulant powers, which proved useful during long prayer sessions. By parching and boiling the coffee beans, rendering them infertile, the Arabs were able to corner the market on coffee crops. In fact, tradition says that not a single coffee plant existed outside of Arabia or Africa until the 1600s, when Baba Budan, an Indian pilgrim, left Mecca with fertile beans fastened to a strap across his abdomen. Baba’s beans resulted in a new and competitive European coffee trade.\n \ndate: 17th century\ntitle: Europe and coffee\ncontent:\nIn 1616, the Dutch founded the first European-owned coffee estate in Sri Lanka, then Ceylon, then Java in 1696. The French began growing coffee in the Caribbean, followed by the Spanish in Central America and the Portuguese in Brazil. European coffee houses sprang up in Italy and later France, where they reached a new level of popularity. Now, it is de _rigueur_ for Parisians to indulge in a cup of coffee and a baguette or croissant at the numerous coffee cafes throughout Paris.\n```\n\n\n[] is optional!\nYou can use [] at the beginning of the code-block to add pre-written classes or your own classes to the wrapper.\nCustomize\nUsing pre-written classes for line, body and the active color:\n\n\nline:\n\nline-2\nline-3\nline-4\nline-5\n\n\n\nbody:\n\nbody-2\nbody-3\nbody-4\n\n\n\nactive color:\n\nactive-color-background-modifier-success\nactive-color-background-modifier-error\nactive-color-background-modifier-error-hover\nactive-color-text-accent\nactive-color-text-accent-hover\nactive-color-text-error\nactive-color-text-error-hover\nactive-color-text-selection\nactive-color-interactive-accent\nactive-color-interactive-accent-hover\nactive-color-interactive-success\n\n\n\n\nFor active color we use obsidian’s css variables as active colors, so it matches the theme. The default active color is background-modifier-success.\nIf you want your own color use --timeline-active-color css variable attached to .timeline class\n.timeline\n    --timeline-active-color: #00c137"},"Timestamp-Notes-Plugin":{"slug":"Timestamp-Notes-Plugin","filePath":"Timestamp Notes Plugin.md","title":"Timestamp Notes Plugin","links":["Obsidian","Obsidian-Plugins"],"tags":[],"content":"A  community plugin for Obsidian that allows for the playing of a video in Obsidian’s sidebar and the insertion of timestamps into a note with a hotkey. It has the additional feature of allowing you to navigate to a timestamp by clicking on the timestamp in the note.\n\nThe following is copied directly from the Obsidian Timestamp Notes Github repo:\nUsage\n\nHighlight a video url and use the ‘Open Video Player’ hotkey or press your designated hotkey to select a local video to play (no need to highlight text for local videos)\nJot down notes and anytime you want to insert a timestamp, press the registered hotkey\nToggle pausing/playing the video by using hotkey (my default is option space)\nOpen videos at the timestamp you left off on (this is reset if plugin is disabled)\nClose the player by right-clicking the icon above the video player and selecting close\n\nSetup\n\nDownload and enable the plugin\nSet the hotkeys for\n\nOpening the video player (my default is cmnd-shift-y)\nOpening a local video (my default is cmnd-shift-l)\nInserting timestamps (my default is cmnd-y)\nPlaying/pausing video (my default is cntrl-space)\nSeeking forward/back (my default is cntrl-arrows)\n\n\nSet options for\n\nColors of the url, url text, timestamp button, and timestamp text\nTitle that is pasted when ‘Open Video Player’ hotkey is used\nHow far you want to seek forward/back\n\n\n\nValid Video Players\nThis plugin should work with:\n\nyoutube\nvimeo\nfacebook\nsoundcloud\nwistia\nmixcloud\ndailymotion\ntwitch\nlocal videos\n\n\nObsidian Plugins"},"Tips-for-Creative-Game-Design":{"slug":"Tips-for-Creative-Game-Design","filePath":"Tips for Creative Game Design.md","title":"Tips for Creative Game Design","links":["Atomizing-and-Abstracting-Game-Mechanics","Creativity-Through-Context-Replacement","Adding-a-Mechanical-Statistic","Change-a-Gameplay-Dimension","Analog-Game-Design","Adding-Gameplay-Verbs-and-Goals","Changing-Gameplay-Inputs-and-Interfaces","Creative-Mashups","Changing-Gameplay-Metaphors","Merging-Gameplay-Mechanics","Top-Down-Game-Design","Bottom-Up-Game-Design","Combining-Top-Down-and-Bottom-Up-Design","Practical-Creativity-by-Raph-Koster,-GDC-2014","Game-Design"],"tags":[],"content":"Atomizing and Abstracting Game Mechanics\nCreativity Through Context Replacement\nAdding a Mechanical Statistic\nChange a Gameplay Dimension\nAnalog Game Design\nAdding Gameplay Verbs and Goals\nChanging Gameplay Inputs and Interfaces\nCreative Mashups\nChanging Gameplay Metaphors\nMerging Gameplay Mechanics\nTop Down Game Design\nBottom Up Game Design\nCombining Top Down and Bottom Up Design\n\nPractical Creativity by Raph Koster, GDC 2014\nGame Design"},"Top-Down-Game-Design":{"slug":"Top-Down-Game-Design","filePath":"Top Down Game Design.md","title":"Top Down Game Design","links":["Game-Design-Patterns","Merging-Gameplay-Mechanics","Koster's-Taxonomy-of-Games","Raph-Koster","Changing-Gameplay-Metaphors","Bottom-Up-Game-Design","Practical-Creativity-by-Raph-Koster,-GDC-2014","Game-Design"],"tags":[],"content":"Also called “Theme First” or “Experience First” design, this methodology is concerned with identifying a specific feeling or aesthetic experience a designer wishes to capture and breaking it down into its key verbs and scenarios. From there the process becomes a matter of translating those verbs and scenarios into analogous Game Design Patterns and gradually Merging Gameplay Mechanics until you arrive at an appropriate rules construct.\nThe risk with top down design is filling the game with incredibly generic mechanics by exclusively pulling patterns from games with a similar theme, effectively becoming a reskin of games the player has seen dozens of times before.\nRaph Koster gives the advise of trying to model an unusual event by telling a story that isn’t often told or by adopting unique gameplay metaphors.\n\nThe opposite of Bottom Up Game Design\n\nPractical Creativity by Raph Koster, GDC 2014\nGame Design"},"Typst":{"slug":"Typst","filePath":"Typst.md","title":"Typst","links":["Markup","LaTeX","Markdown","Obsidian","Table-Top-Role-Playing-Games-(TTRPGs)"],"tags":[],"content":"Typst is described as “a new Markup-based typesetting system that is designed to be as powerful as LaTeX while being much easier to learn and use”.\nI’ve become mildly interested in exploring Typst for laying out TTRPG materials based on the Markdown documents I create in Obsidian.\n\nGithub: github.com/typst/typst\nRPGCauldron discussion on Tyst for TTRPGs: discourse.rpgcauldron.com/t/typst-for-ttrpgs/1640"},"Under-the-Beams":{"slug":"Under-the-Beams","filePath":"Under the Beams.md","title":"Under the Beams","links":["Sun","Domicile","Exaltation","Bounds","In-the-Chariot","Hellenistic-Astrology-by-Chris-Brennan","Astrology","Hellenistic-Astrology","Planets","Heliacal-Rising-and-Setting","In-the-Heart-of-the-Sun"],"tags":[],"content":"A planet too close to the Sun is to be seen by the naked eye, roughly 15 degrees, is said to have its qualities hidden or concealed. They are impotent unless mitigated by other factors. A planet in Domicile, Exaltation. or Bounds is said to be In the Chariot and is unaffected.\n\nHellenistic Astrology by Chris Brennan\nAstrology\nHellenistic Astrology\nPlanets\nHeliacal Rising and Setting\nIn the Heart of the Sun"},"Use-Based-Skill-Systems":{"slug":"Use-Based-Skill-Systems","filePath":"Use-Based Skill Systems.md","title":"Use-Based Skill Systems","links":["Skills-(Design-Pattern)","The-Elder-Scrolls-IV:-Oblivion","The-Goldilocks-Rule","Make-it-Satisfying","Building-Habits-through-Peer-Pressure","Traits-(Design-Pattern)","Use-based-systems-–-Raph's-Website"],"tags":[],"content":"A specific systematization of the Skills (Design Pattern), use-based skill systems are a family of mechanics wherein skill progression is tied to practice and repetition over time. This type of system was first popularized by The Elder Scrolls IV: Oblivion.\nThe main attraction of a use-based system is that it leads to a freeform approach to progression, where a character’s development is determined by what they choose to use on a regular basis rather than arbitrary point investment.\nThe issue with most use-based systems isn’t actually repetition, however - it is the lack of a meaningful and engaging challenge. This is an example of The Goldilocks Rule in action. If you want a system or mechanic to be enjoyable for a player, it is important to Make it Satisfying.\nHowever, if a system is made repetitive but not engaging, players will still eventually force themselves to engage with the unenjoyable mechanic upon seeing other players getting better results than them. This will result in players reporting a grind-heavy and unpleasant experience.\nIt is important to remember that skills, as well as other kinds of traits, are meant to be enablers rather than the point of play. They should be designed as verbs to overcoming obstacles to reach a goal, not designs as goals in and of themselves.\n\nUse-based systems – Raph’s Website"},"Venus":{"slug":"Venus","filePath":"Venus.md","title":"Venus","links":["Aphrodite","Nocturnal-Sect","Hellenistic-Astrology-by-Chris-Brennan","Astrology"],"tags":["astrology"],"content":"\nAlso known as Aphrodite. Desire and love, the feminine, young women, sacred office, relationship, luxury and beauty, art, precious stones and fabrics. Trade, giving and receiving, rejoicing, pleasure and intercourse. Rules precious stones and colorful ornaments (later copper). Color is white (later dark green). Nocturnal Sect and rich / oily in taste.\n\n\nFlashcards\nWhat is the Sect of Venus:: Nocturnal\n\nWhat planet rules desire and love, sacred office, pleasure and intercourse:: Venus\n\n\nHellenistic Astrology by Chris Brennan\nAstrology"},"Vignette-vs-Compose":{"slug":"Vignette-vs-Compose","filePath":"Vignette vs Compose.md","title":"Vignette vs Compose","links":["Compose-RPG","Vignette-RPG","Atomizing-and-Abstracting-Game-Mechanics","Adding-a-Mechanical-Statistic","Adding-Gameplay-Verbs-and-Goals","tags/pkmashup","MOSAIC-Strict","Combining-Top-Down-and-Bottom-Up-Design","PKMashup-Notes","Table-Top-Role-Playing-Games-(TTRPGs)","Game-Ideas"],"tags":["pkmashup"],"content":"This PKMashup prompted some thoughts about WIP projects Compose RPG and Vignette RPG and the false dichotomy of Top Down and Bottom Up design. Compose was initially motivated by a desire to create a system which gave players granular control over the mechanical complexity of their personal experience without negatively affecting anyone else at the table. Vignette, as underdeveloped as the idea still is, was motivated by the desire to create small and evocative mechanics which captured a specific moment or experience.\nThis reminds me a bit of the debate in the gaming community regarding RPGs as being for narrative, gaming, or simulation. Vignette is philosophically in alignment with Story Games, while Compose definitely had a mind towards more gamey modes of play. Both of these highly compartmentalized and modular design philosophies, however, don’t lend themselves to more simulationist understandings of TTRPGs.\nThe idea I have now is a slight variation on MOSAIC Strict’s design pillars, and the original vision of Compose. Player-facing modules would be focused on how the player’s character moves through the world, usually through some sort of evocative archetype while system-level vignettes facilitate shared scenes of a specific kind.\nGames are made of games all the way down, so as a design philosophy MOSAIC Strict certainly makes sense - especially with the Gamemaster present to mediate interactions within the fiction. I’d guess the key to creating engaging modules will be in modeling the world in new ways as well as introducing unique affordances for the players. Understanding where the fun is in any modular system, and how to facilitate potential interaction between pieces is where the challenge is.\n\nThis note is a pkmashup  of MOSAIC Strict and Combining Top Down and Bottom Up Design. See PKMashup Notes to learn more.\n\nTable Top Role Playing Games (TTRPGs)\nGame Ideas"},"Vision-Deck":{"slug":"Vision-Deck","filePath":"Vision Deck.md","title":"Vision Deck","links":["Vision-Boards","Daily-Reviews","Affirmations","My-Analog-Productivity-and-PKM-System"],"tags":[],"content":"Combining the best of Vision Boards, Daily Reviews, Affirmations, reminders, and more - the Vision Deck is easily one of the most powerful tools in this toolbox. Resurfacing daily reminders of goals, values, relationships, projects, and personal strategies has a massively improved the felt quality of my life more than any other productivity hack ever could.\n\n\nOriginally inspired by this video and its sequel by Lefie on YouTube.\n\n\nMy Analog Productivity and PKM System"},"Voice-Acting":{"slug":"Voice-Acting","filePath":"Voice Acting.md","title":"Voice Acting","links":[],"tags":[],"content":"\nMildly interested in doing VO projects. Here are the resources shared by Sam Slade\n\niwanttobeavoiceactor.com/\nvoiceacting.boards.net/thread/5286/get-started-voice-acting\nvoiceacting.boards.net/thread/4334/voice-act-online-hobby\n\n\n"},"Zettlekasten":{"slug":"Zettlekasten","filePath":"Zettlekasten.md","title":"Zettlekasten","links":["Niklas-Luhmmann","Explore-vs.-Exploit-Dilemma","Knowledge-Work","Person-Knowledge-Management-(PKM)","Antinet-Zettlekasten","Obsidian","The-Anitnet-Zettlekasten-by-Scott-Scheper"],"tags":[],"content":"German for “note box”, it is a knowledge management system popularized by 20th century sociologist Niklas Luhmmann. The system consisted of taking notes on individual note cards and organizing them in a physical organizational system. It serves as the basis of many analog and digital note-taking and PKM systems today.\nWhen using a Zettlekasten (or any similar PKM system) you are generally operating in one of two states:\n\nGrowth, accumulating knowledge and adding to the system\nContribution, using the system to create something new to share with the world\n\nYou also run into the Explore vs. Exploit Dilemma; however, neither of these states are inherently better than the other, and oscillating between both states is an essential part of Knowledge Work. It is ideal to keep a general goal in mind while in the growth stage, though - as keeping an eye towards a desired output, no matter how vague, will help you choose the most appropriate topics of exploration.\n\nPerson Knowledge Management (PKM)\nAntinet Zettlekasten\nObsidian\nThe Anitnet Zettlekasten by Scott Scheper"},"daily/2025-06-02":{"slug":"daily/2025-06-02","filePath":"daily/2025-06-02.md","title":"2025-06-02","links":["BRAT-Obsidian-Plugin","Nicole-van-der-Hoeven","Obsidian-Vault-Changelog-Plugin","system/changelog","ReaPack","SWS-Extensions","Reaper","Reableton","NixOS","The-Phenomenology-of-Aesthetic-Experience-by-Mikel-Dufrenne","Mikel-Dufrenne","Phenomenology-of-Agency","Endless-Sky","Fossify-Calendar","Agent","Quartz"],"tags":[],"content":"\nI set up the BRAT Obsidian Plugin so that I could install Nicole van der Hoeven’s variant of the Obsidian Vault Changelog Plugin.\n\nAlso set up a changelog for the vault.\n\n\nRecently set up ReaPack and SWS Extensions in Reaper so I could set up Reableton as part of my transition between DAWs.\n\nI needed to install them directly into the reaper .config folder, with some guidance from this discussion on the NixOS forums.\n\n\nStarted reading The Phenomenology of Aesthetic Experience by Mikel Dufrenne. Spent some time contemplating some of the translator’s notes in the forward regarding Dufrenne’s distinction between the Aesthetic Object and the Work of Art.\n\nWatched an interesting video by John Logan on the topic.\n\n\nRevisiting this lecture on Phenomenology of Agency by Tim Bayne\nExploring the possibility of contributing music &amp; audio to Endless Sky. There’s a Discord thread discussing some of the specifics of contributing.\nSwitched to Fossify Calendar after my existing calendar app started giving me grief.\nIn a conversation with “Christopher of the Cross” on the Man Alone Discord server, I laid out a working definition of the term Agent as I make sense of it in my own metaphysical framework.\nAdded my Obsidian vault to Github, considering options for static site generation such as Quartz\n"},"daily/2025-06-03":{"slug":"daily/2025-06-03","filePath":"daily/2025-06-03.md","title":"2025-06-03","links":["Typst"],"tags":[],"content":"\nInterested in exploring Typst for markup formatting\n\ngithub.com/typst/typst\nTypst for TTRPGs: discourse.rpgcauldron.com/t/typst-for-ttrpgs/1640\n\n\n"},"daily/2025-06-04":{"slug":"daily/2025-06-04","filePath":"daily/2025-06-04.md","title":"2025-06-04","links":["Compose2nix","Docker-Compose","NixOS","Docker","NixOS-Rebuild-Lock-Issue","Mentats","Dune"],"tags":[],"content":"\nLearned about Compose2nix, a tool for converting Docker Compose configurations into a NixOS config. (Docker)\nEncountered NixOS Rebuild Lock Issue and found the fix.\nWatched an interesting video about Mentats from Dune\n"},"daily/2025-06-05":{"slug":"daily/2025-06-05","filePath":"daily/2025-06-05.md","title":"2025-06-05","links":["daily/2025-06-04","Mentats","Interleaving","Jouve-Cerebrals-Test-of-Induction-(JCTI)","Comprehensive-Adult-Intelligence-Test-(CAIT)","N-Back","Spaced-Repetition","Rapid-Serial-Visual-Presentation","Rating-of-Perceived-Exertion","Nix-Shell","Quartz","/","Polyrythms","Nix-User-Repository-(NUR)"],"tags":[],"content":"\nFinish making notes from 2025-06-04\nAfter watching the video on Mentats from yesterday, I was recommended this video on memory and “how to think like a Mentat”. A bit hyperbolic, but compelling.\n\nBrought up the idea of Interleaving, an approach to taking break that involves naturally rotating between productive reading based on topic exhaustion.\n\n\nInterested in trying out Jouve-Cerebrals Test of Induction (JCTI)\n\nWebsite: www.cogn-iq.org/jcti-iq-inductive-reasoning-test.php\n\n\nAlso the Comprehensive Adult Intelligence Test (CAIT)\n\nWebsite: cognitivemetrics.com/test/CAIT\n\n\n3-in-1 Memory Test\n\nWebsite: practicalpie.com/free-memory-test/\n\n\nMakes notes on N-Back, Spaced Repetition, and Rapid Serial Visual Presentation\nDiscussed Rating of Perceived Exertion with Terry.\nLearning a bit about how to use Nix Shell for my Quartz project\n\nWrote what will become the Home page for the site The Metamageia Vault\n\n\nWant to do more research into Polyrythms\n\nResources: www.fiveoverthree.com/, Video by Like it or Not, Video by Andrew Huang\n\n\nLearned about the Nix User Repository (NUR). Not sure how I missed it until today\nSuccessfully set set up the quartz website: metamageia.github.io/The-Metamageia-Vault/\n"},"daily/2025-06-06":{"slug":"daily/2025-06-06","filePath":"daily/2025-06-06.md","title":"2025-06-06","links":["daily/2025-06-05"],"tags":[],"content":"\nClean up remaining notes from 2025-06-05\n\nNix Shells, Cognitive Assessments, Polyrythms\n\n\nNeed to pretty up and customize The Metamageia Vault\n"},"index":{"slug":"index","filePath":"index.md","title":"index","links":["Learning-in-Public","Game-Design","Tips-for-Creative-Game-Design","Atomizing-and-Abstracting-Game-Mechanics","Creativity-Through-Context-Replacement","Creative-Mashups","Combining-Top-Down-and-Bottom-Up-Design","Game-Design-Patterns","Personal-Knowledge-Management-(PKM)","PKMashup-Notes","Spaced-Repetition","Incremental-Writing","Programmable-Attention","Programmable-Identity","Habits","Morphological-Analysis","Free-and-Open-Source-Software-(FOSS)","NixOS","Docker","Obsidian","Obsidian-Plugins","Quartz","Reaper","Github","Syncthing","Static-Site-Generator","Github-Pages","Nicole-van-der-Hoeven","system/changelog"],"tags":[],"content":"The Metamageia Vault\nWelcome! My name is Gage Lara aka Metamageia.\nWhat you’re seeing here is a combination of my personal website and my working notes from my Obsidian notes vault. Many of the notes you’ll find here are little more than rough and incomplete ideas and musings about what I’m interested in learning - all shared online as an exercise in Learning in Public. Expect to find flaws, unfinished notes, and links to notes that don’t quite exist yet.\nIf you want to see some of these interests in action check out my projects on GitHub, my TTRPG creations on Itch.io, or check out some of my music on Bandcamp.\nIf you’re a fan of the TTRPG Trespasser check out my statblock library &amp; editor web app OVERLORD.\nIf you like any of the stuff I do, you can consider buying me a coffee.\n\nWhere to start?\nFeel free to explore whatever notes look interesting to you, or check out one of these topics as a starting point:\nGame Design\n\nGame Design\nTips for Creative Game Design\n\nAtomizing and Abstracting Game Mechanics\nCreativity Through Context Replacement\nCreative Mashups\nCombining Top Down and Bottom Up Design\n\n\nGame Design Patterns\n\nPKM, Productivity, and Creativity\n\nPersonal Knowledge Management (PKM)\n\nPKMashup\n\n\nSpaced Repetition\n\nIncremental Writing\nProgrammable Attention\nProgrammable Identity\n\n\nHabits\nMorphological Analysis\n\nTechnology\n\nFree and Open Source Software (FOSS)\nNixOS\nDocker\nObsidian\n\nObsidian Plugin\nQuartz\n\n\nReaper\n\n\nHow was this set up?\nAll of the notes here were written in Obsidian, my Personal Knowledge Management (PKM) tool of choice. My notes are backed up in a Github repository and synced across multiple devices with Syncthing. Depending on when / where you’re reading this note, my vault is hosted as a static site generated using Quartz and hosted via Github Pages.\nThis page and many parts of this vault are heavily inspired by Nicole van der Hoeven’s website Fork My Brain, which is worth checking out.\n\nWhat’s changed?\nCheck out the changelog to see the last 100 or so notes that have been modified."},"metamageia/MOSAIC-Playbooks/Dark-Fantasy-Character-Playbook-Itch.io-page":{"slug":"metamageia/MOSAIC-Playbooks/Dark-Fantasy-Character-Playbook-Itch.io-page","filePath":"metamageia/MOSAIC Playbooks/Dark Fantasy Character Playbook Itch.io page.md","title":"Dark Fantasy Character Playbook Itch.io page","links":[],"tags":[],"content":"metamageia.itch.io/dark-fantasy-character-playbook-for-mosaic-strict\nCreate and play unique and flavorful dark fantasy characters without the need for a core TTPRG system. Contains rules for generating characters, using their talents, a unique stress &amp; Psyche mechanic, and a built-in character sheet all in a convenient and easy to print trifold brochure.\nAlso included is a plain text markdown version and a 3-character party sheet for creating multiple characters (great for Solo RPG or funnel sessions).\nWhat is MOSAIC Strict?\nMOSAIC Strict is a design framework devised by Michael Prescott for making modular RPG subsystems. MOSAIC Strict modules can used with any existing TTRPG, alongside other MOSAIC Strict modules, are standalone as a supplement to freeform play.\nPublic Domain\n To the extent possible under law, Metamageia has waived all copyright and related or neighboring rights to Dark Fantasy Character Playbook for MOSAIC Strict. This work is published from: United States.\n \nAttribution is appreciated but not required. If you’d like to share what you’ve made using this, or any MOSAIC Strict projects, feel free to email me at metamageia@gmail.com"},"metamageia/MOSAIC-Playbooks/Dark-Fantasy-Character-Playbook-for-MOSAIC-Strict":{"slug":"metamageia/MOSAIC-Playbooks/Dark-Fantasy-Character-Playbook-for-MOSAIC-Strict","filePath":"metamageia/MOSAIC Playbooks/Dark Fantasy Character Playbook for MOSAIC Strict.md","title":"Dark Fantasy Character Playbook for MOSAIC Strict","links":[],"tags":[],"content":"Dark Fantasy Character Playbook for MOSAIC Strict\nName:\nMight:\nAgility:\nIntellect:\nSpirit:\nChallenge Rolls\nBasic Challenge: When performing a task with a chance of failure, make a Basic challenge:\nRoll a Challenge Die (1d6) vs 2d8\n\nIf the Challenge die is higher than or equal both d8s: Success\nIf the Challenge die is higher than or equal to only one d8: Success, with a Drawback\nIf the Challenge die is lower than both d8s: Failure, with a Drawback\n\nWhen you Challenge a Stat, add that Stat to your Challenge Die.\nWhen you use a Skill in your Psyche, roll 2d6 and take the higher number.\nInventory Rules\nYour total inventory slots equals 5 + Might\nMost items take up one slot. Items that could fit in a pocket can share a slot with any one item. Heavy armor takes up two slots.\nWhen you gain a Fatigue or Wound without an empty slot, immediately drop an item to make room for it. If you gain either while your inventory is completely full of Fatigue/Wounds, you die.\nShields and worn Armor may occupy the same slot as a Fatigue or Wound. When adding a Wound to a shield/armor slot convert it to Fatigue.\nYou start with any one common weapon, a ration, a trinket, and a background item.\nPsyche Rules\nYour total Psyche slots equal to 5 + Intellect.\nSkills and Spells take up one slot.\nWhen you gain a Stress or Trauma without an empty slot, immediately  clear a skill or spell to make room for it. If you gain either while your Psyche is completely full of Stress/Trauma, you are broken and lose control of this character.\nCharacter Creation\n1. Stats\nRoll 4d4 once. For each individual die, add +1 to the numbered Stat:\n\nMight: Challenges of strength and endurance.\n\n\nChallenge Drawback: Gain Fatigue.\n\n\nAgility: Challenges of dexterity and precision.\n\n\nChallenge Drawback: Gain Fatigue or Stress.\n\n\nIntellect: Challenges of knowledge and memory.\n\n\nChallenge Drawback: Gain Stress\n\n\nSpirit: Challenges of courage and mental fortitude.\n\n\nChallenge Drawback: Gain Stress or Fatigue.\n\nWhen you gain Fatigue or Wound, add it to your Inventory. When you gain Stress or Trauma, add it to your Psyche.\n2. Backgrounds\nSelect a random background and gain its benefits.\n\nScholar: +1 Intellect, Literacy, Spellbook with 2 Spells\nFarmer: +1 Might, Nature, Ration\nPriest: +1 Spirit, Religion, Holy Symbol\nSoldier: +1 Might, Athletics, Chainmail Armor\nPoacher: +1 Agility, Tinkering, Snare trap\nBeggar: +1 Spirit, Folklore, Tin Cup with d6 coins\nOutlaw: +1 Agility, Stealth, Stollen Jewelry\nDoomsayer: +1 Intellect, Speech, SingleSpell Scroll\n\n3. Talents\nYou start with a random Talent from the list on the back. When you spend a year with an appropriate trainer, you may attempt a Basic Challenge to learn a new Talent. On a Success you learn it, on a Drawback gain Trauma.\n\n\nWeapon Master: When you Practice, you may choose any weapon type such as Swords, Axes, etc instead of one of your Skills and add it to your Psyche as a Skill.\n\n\nBastion: When you Defend in a Skirmish, you may choose to Challenge Might instead. When you do, on a Success with a Drawback you gain Fatigue instead of a Wound.\n\n\nHealer: When you Tend Wounds, you can treat the injuries of either yourself or another creature, though you still add any stress to your own Psyche. As part of the same Move, you may also make a number of additional attempts to Tend Wounds equal to your Spirit Stat + 1.\n\n\nPious: When you take this talent, name three concepts associated with your deity (fire, generosity, forests, etc). When you Practice, you may choose to spend that time in prayer and add any combination of these traits to your Psyche as Skills.\n\n\nAmbusher: When you Attack in a Skirmish, you may choose to Challenge Agility instead. Any time you Skirmish from a position of stealth or deception, you may roll as if you were using a skill.\n\n\nHunter: When you Skirmish, you may add that specific combatant’s name or identifier to your Psyche as a Skill. It is removed when your quarry is verified to be dead, you declare a new quarry, or choose to end your hunt.\n\n\nMagus: When you Practice to memorize a Spell, you may add the memorized Spell to your Psyche an additional number of times up to your Intellect stat + 1, and you may also make a number of additional attempts to memorize additional spells equal to your Intellect Stat + 1.\n\n\nOccultist: When you Cast a Spell, you may choose to Challenge Might instead. When you do, you do not remove the Spell on a Drawback, and gain Fatigue instead of Stress.\n\n\n4. Trinkets\nYou start with a random trinket.\n\nStuffed Animal\nPersonal Manifesto\nBeloved Hat\nSmall Animal Carving\nDeck of Tarot Cards\nTattered Banner\nChild’s Drawing\nMedal of Honor\nMusical Instrument\nBook of Poetry\n\n5. Skills\nCircle your Skills. You start with 2 random skills in addition to your Background skill.\nWhen you spend a year with an appropriate trainer, you may attempt a Basic Challenge to learn a new Skill. On a success you learn it, with no Drawbacks.\n\nCrafting\nNature\nReligion\nAthletics\nFolklore\nStealth\nSpeech\nAcrobatics\nTinkering\nLiteracy\n\n6. Traits\nYou start with one random virtue, vice,and oddity. Roll 1d10 for each, circling the result - reroll matching virtue &amp; vice pairs.   \nEach day randomly select from your virtue, vice, or oddity to add to your Psyche as a Skill. This replaces the previous day’s selection.\nVirtues\n\nCalm\nDaring\nThoughtful\nDutiful\nGenerous\nHonest\nSupportive\nHumble\nKind\nTrusting\n\nVices\n\nWrathful\nCowardly\nImpulsive\nUnruly\nGreedy\nDeceitful\nEnvious\nArrogant\nCruel\nParanoid\n\nOddities\n\nObsessive\nWhimsical\nJaded\nDelusional\nServile\nAbsentminded\nDramatic\nCheerful\nAmbitious\nLethargic\n\nMoves\nSkirmish: When engaging in combat: Challenge Might if you are attacking, Challenge Agility if you defending.\n\nSuccess: You wound the opposing combatant.\nDrawback: Attacking-Gain Fatigue. Defending-Gain a Wound.\n\nCast Spell: When casting a memorized spell, Challenge Intellect.\n\nSuccess: You cast the spell.\nDrawback: Remove the spell from your Psyche then gain Stress. If the Challenge Die is also less than the combined Stress &amp; Trauma in your Psyche, gain Trauma instead.\n\nTend Wounds: When you spend several hours tending to your wounds with adequate time and supplies, Challenge Might.\n\nSuccess: Remove one Wound.\nDrawback: Gain Stress.\n\nLift Spirits: When you spend several hours engaged in recreational activity, Challenge Spirit.\n\nSuccess: remove up to two Stress.\nDrawback: Gain Fatigue.\n\nMoments Rest: When you spend a few minutes to catch a breath and consume a ration, you may remove either one Fatigue or one Stress.\nNight’s Rest: When you rest, consume a day’s rations and spend the night asleep. If you do both, remove up to two fatigue.\nIf you do not eat, Challenge Might. If you do not sleep, Challenge Spirit. Make a separate challenge for each.\n\nSuccess: Add Fatigue to your inventory.\nDrawback: Add Stress to your psyche.\n\nPractice: When you spend a few hours practicing one of your Skills or memorizing a Spell form a book or scroll, Challenge an appropriate Stat.\n\nSuccess: Add the Skill or Spell to your Psyche.\nDrawback: Stat Drawback\n\n\nDark Fantasy Character Playbook for MOSAIC Strict by Metamageia is marked with CC0 1.0. Public Domain."},"metamageia/MOSAIC-Story-Kits/Amid-the-Silence,-Hunger-MOSAIC-Strict-Trifold-Story-Kit":{"slug":"metamageia/MOSAIC-Story-Kits/Amid-the-Silence,-Hunger-MOSAIC-Strict-Trifold-Story-Kit","filePath":"metamageia/MOSAIC Story Kits/Amid the Silence, Hunger MOSAIC Strict Trifold Story Kit.md","title":"Amid the Silence, Hunger MOSAIC Strict Trifold Story Kit","links":[],"tags":[],"content":"(Explain Dice Pool Mechanic)\nIntro Text\n\nThe rusted steel of an aging railroad carves a path through the desolate wasteland.\nA heavy blanket of eternal night suffocates the countryside.\nTowering forests of glowing fungus dot the abyssal horizon.\n\n\nThe village of Mournwater lays rotting and empty, as most have since the collapse. You hear them before you see them—a hiss of escaping steam mingled with the ragged gasps of starving wretches.\n\nPressure Pools\n\nEncounter a lone Dredge, footsteps on the roof, dense red mist drifts\nThe mist burns their lungs, Hulk slamming in adjacent building, pack of dredges enter\nHulk ambushes players, train blasts through depot, character develops vampirism\n\nUseful Pieces\n\nBiomechanical Vampires with flesh stretched taut over cogs and hissing pistons prowl the dark, equal parts monster and machine.\n\nDredges are extremely frail, but hunt in packs. Will attempt to pin their prey to the ground to feed.\nThe Boiler Hulk is a towering abomination and can endure a lot of pain. Its claws are tipped with large syringes that feed the blood-filled boiler carried on its back. It periodically blankets the surrounding area with a superheated crimson steam from the tank’s vents.\n\n\nCrimson Steam drifts throughout the village, leaving the lingering stench of copper and rot.\n\nRoll d4 to determine initial density pool, a thicker mist means the Boiler Hulk is nearby.\nA fresh cloud of steam burns the flesh, and inhaling any amount too frequently runs the risk of contracting vampirism.\n\n\nBioluminescent Fungus illuminates the village with a sickly blue-green light.\n\nSome mushrooms can be as bright as torches, and remain lit for an hour after being picked.\nSome may provide improved night sight when consumed, but induce significant physical or mental exhaustion.\n\n\n\nSet it Up?\nExample Challenges\nMix it Up"},"metamageia/MOSAIC-Story-Kits/Story-Kit-Concept":{"slug":"metamageia/MOSAIC-Story-Kits/Story-Kit-Concept","filePath":"metamageia/MOSAIC Story Kits/Story Kit Concept.md","title":"Story Kit Concept","links":[],"tags":[],"content":"Front\nCover\n\nTitle\nImage\nFlavor Snippets\nModule Description\nPressure Pools\n\nMiddle\nBasic Challenge: When performing a task with a chance of failure, the player makes a Basic challenge:\nRoll a Challenge Die (1d6) vs 2d8\n\nIf the Challenge die is higher than or equal both d8s: Success\nIf the Challenge die is higher than or equal to only one d8: Success, with a Drawback\nIf the Challenge die is lower than both d8s: Failure, with a Drawback\n\nEnemy Mechanics / descriptions\nLeft\n\nSet it Up / Customize\nMix it Up\n\nBack\n\nBottom: Example Challenges\n\nBack Cover\n\nPOI Keys Right\n\nMiddle\n\nPointcrawl Map\n\nFar Left\n\nPOI Keys Left\n"},"metamageia/MOSAIC-Story-Kits/Story-Kit-Template-Outline":{"slug":"metamageia/MOSAIC-Story-Kits/Story-Kit-Template-Outline","filePath":"metamageia/MOSAIC Story Kits/Story Kit Template Outline.md","title":"Story Kit Template Outline","links":[],"tags":[],"content":"Front\nCover\n\nTitle\nImage\nFlavor Snippets\nModule Description\nPressure Pools\n\nMiddle\n\nChallenge Mechanic\nEnemy Mechanics / descriptions\n\nLeft\n\nSet it Up / Customize\nMix it Up\n\nBack\n\nBottom: Example Challenges\n\nBack Cover\n\nPOI Keys Right\n\nMiddle\n\nPointcrawl Map\n\nFar Left\n\nPOI Keys Left\n"},"metamageia/Trespasser-Solo-Design/Actions-List":{"slug":"metamageia/Trespasser-Solo-Design/Actions-List","filePath":"metamageia/Trespasser Solo Design/Actions List.md","title":"Actions List","links":[],"tags":[],"content":"Combat\nActions\nAttempt Deed\nChoose one of your deeds, select targets, and make a roll to find the outcome. You can only attempt one deed each turn, though spending resolve allows you to exceed this limit\nInteract\nManipulate an object or feature of the environment within arm’s reach. If the interaction involves risk or challenge, the Judge may call for a check to see if you succeed. A minor interaction, like drawing your weapon, grabbing an unattended object within reach, or opening an unlocked door, can be done as a free action\nJump\nYou try to dive past foes and vault over obstacles. Make a simple AGILITY | ATHLETICS check vs. 10. On a success, you can jump up to two squares in that direction, plus one per spark. On a failure, you jump one square in that direction\nMove\nYou gain a number of movement points equal to your speed. Characters have a base speed of 5 + AGILITY, though this can be limited while wearing heavy armor. After taking this action, you can spend the movement points to move between other actions you take on your turn. Challenging movement, such as swimming or climbing, may require a check\nPrevail\nSpend a moment to clear your head, regain footing, or address a battlefield concern. Choose one state affecting you, an adjacent ally, or an enemy you damaged this turn. Check INTELLECT + SKILL BONUS vs. 10 + INTENSITY. On a success, you end that state\nRummage\nStow held items or retrieve items from your inventory, bringing them to hand. You can move several items with this action, within reason.\nSmash\nAttempt to destroy an adjacent destructible obstacle. Make a simple check of MIGHT | ATHLETICS vs. 10 (plants or ceramic), 12 (wood), 15 (fragile stone), or 18 (weak metal). On a success, it is destroyed and replaced by difficult terrain\nSupport\nYou aid an ally in sight, helping them land their attack or warning them of danger. Describe what you do, then grant the ally a support die of 1d4. If they already have a support die, increase it by one size instead, to a maximum size of d12. Until the end of the round, they can spend their support die to roll it and add the result to any one check they make. Support dice are lost at the end of each round\nTake Aim\nYou adopt a firing position, gaining the aiming state: until you leave your current space, your range with missile attacks is doubled\nTake Cover\nYou take shelter behind an adjacent obstacle, gaining the covered state: until you leave your current space, you gain +2 guard or resist against any attack if the attacker’s line of sight passes through the chosen obstacle\nThrow\nYou throw a held object to a square within a range of 5 + AGILITY. Any creature in the path of the object may take a reaction  to catch it with a free hand. A risky throw may require an AGILITY | ATHLETICS check to succeed\nUse Item\nYou use a held item, such as a potion, wand, or scroll. If using it creates the effects of a deed, that counts as your deed for the turn\nReactions\nBlock\nTake this reaction when you are hit by an attack. Roll one of your armor dice, reducing the damage by the result\nCounter\nTake this reaction when you spark on a guard check. If the attacker is within your melee weapon range, deal 🗡️🗡️ to them with a held melee weapon\nFree Actions\nSpeak\nYou can speak or shout a few words while performing other actions\nWait\nYou can only take this free action in the early phase, and taking it ends your turn. Your remaining action points are held in reserve. You can take another turn at any point during the late phase this round to spend your remaining action points\nDungeon\nCast Incantation\nThe rest of the party keeps watch as one or more characters cast incantations they know. The complete rules for incantations can be found in the Magic chapter\nCombat\nDo battle with a creature encountered in the dungeon. The party automatically take this action if they have an encounter that results in combat. Even if the battle is only a few rounds long, the combat still uses a full dungeon action.\nConverse\nSpend a few minutes trading words with a creature nearby. The party automatically use an action to converse if they spend more than a minute or two speaking to a creature they encounter\nDisarm Trap\nThe party attempts to disarm a trap in their current room. One character makes an INTELLECT | TINKERING check while the others look out for danger. If the trap is magical in nature, this is instead an INTELLECT | MAGIC check\nExplore\nMove cautiously into a new, adjoining room and begin searching it for traps, hidden doors, and other secrets. Each character makes a check of INTELLECT | PERCEPTION, investigating one room feature on a success, plus one per spark.\nHide\nWait in silent darkness for the dungeon to become still again. If the party is in a place with some seclusion from the rest of the dungeon, they can make a group check of AGILITY | STEALTH. On a success, the alarm value falls by three, plus one per spark\nInteract\nThe party engages with a feature of the current room in some complex or time-consuming way. This dungeon action is open-ended: they could use it to decipher the ancient text scrawled on a sarcophagus, meticulously dredge a murky pool for treasure, or barricade a doorway with piled up furniture. The Judge will call for a skill check or group check as necessary\nPick Lock\nThe party attempts to a pick a locked door or chest. One party member can make an AGILITY | TINKERING check while the others look out for danger\nSearch\nLinger in a room to explore it further. The party spend time to investigate each remaining room feature and learn any secrets they failed to discover during their initial explore action. There is no check required, the only cost is the time spent\nMoment’s Rest\nPause exploration and take a moment to catch your breath. Each character must eat or lose 1 endurance, then spend any number of recovery dice. Each die spent restores its maximum value of hit points. Characters also regain their spent armor dice and erase two checkmarks from their focus costs\nTraverse\nMove quietly to a previously explored room. Unlike the explore action, you do not make any checks to explore the rooms you pass through. When the party takes this action to flee the dungeon, it always triggers one final encounter check\nVandalize\nThe party tries to break open a locked door or chest or do some other act of property destruction. One or more party members can make a group check of MIGHT | ATHLETICS. The dungeon’s alarm rises by +1\nTravel\nThe Advance Action\nWhen the party takes the advance action, they break camp and continue their journey. The terrain determines the number of hexes the party travels when they advance:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTerrainHexesExamplesFlat4Desert, Plains, WoodlandMixed / Rough3Forest, Hills, SwamplandDifficult2Caves, Mountains\nThe party can only take the advance action once each day without penalty. Each time it is used beyond that, each party member loses 1 endurance. Any party member with a mount can advance a second time without losing endurance. They still lose endurance normally on further advances.\nRoads wind through multiple hexes and ease passage along them. While the party is following a road, they can move 4 hexes each time they advance, no matter what type of terrain those hexes contain.\nThe party travels -1 hex when they advance in poor weather, such as a heat wave, heavy rain, or snow. This increases to -2 hexes in extreme weather, like a blizzard or sandstorm. In difficult terrain, this traps them in their current location until the conditions improve.\nEach time the party takes the advance action, the Judge makes an encounter check, rolling a d10. If the result is equal to or less than the hostility tier of the current region, the party has a random encounter.\nThe Camp Action\nCook\nYou use the ingredients on hand to make an edible meal, however distasteful. Spend one or more ingredients and make a SPIRIT | ALCHEMY check. You can also spend crude rations instead of ingredients to attempt to turn them into something better. On a failure, turn all the items you spent into that many crude rations. On a success, they become normal rations instead. On a success with a spark, they become fine rations.\nCraft\nYou create a simple tool from what’s on hand. Spend one or more material to make an INTELLECT | CRAFTING check. On a success, you create a crude tool or piece of equipment. For each spark, you can spend another material to improve the item’s quality, to a maximum of fine. The Judge may determine that certain items are impossible given limited time and resources\nExplore\nYou explore the surrounding area for points of interest. Make an AGILITY | PERCEPTION check. On a success, you find a point of interest in the current hex, if any exist\nForage\nYou devote time to searching for edible plant life and useful ingredients for alchemy. Make a MIGHT | NATURE check. On a success, gain one ingredient, plus one per spark.\nFish\nIf you’re near a body of water, you can fish for food. Make a SPIRIT | NATURE check. On a success, gain one normal ration, plus one per spark\nHelp\nYou forgo performing your own camp activity to help an ally with their own. Grant them an extra spark on a success\nHunt\nYou attempt to find food by hunting wild game. Make an AGILITY | NATURE check. On a success, gain one normal ration, plus one per spark. On a failure, lose 1 endurance\nLift Spirits\nYou devote extra time to resting with your companions and bolstering their spirits. Choose one ally, describe what you do to lift their spirits, and make a check of SPIRIT | SPEECH. The Judge may let you make a different check if it makes sense for approach you describe. On a success, remove one of their lasting states, or grant them a point of resolve\nPrepare Torches\nYou use the odds and ends you’ve scrounged up to craft a number of makeshift torches. Spend a material and make a MIGHT | CRAFTING check. You do not need to spend a material if you are in an environment with plentiful wood. On a success, create three crude torches, plus one for each spark you rolled\nPursue\nYou pursue a different task not covered by the other camp activities. Make a skill check determined by the Judge. The target number may vary depending on the task at hand\nRest Early\nYou rest while others labor so that you can keep watch during the next night’s rest action. If you take this action, you gain all the effects of a rest, and you can keep watch without penalty\nSalvage\nYou search the area for discarded leather, metal, and other useful materials. Make a MIGHT | PERCEPTION check. On a success, gain one material, plus one per spark\nScout\nYou venture out to get a better sense of the region. Make an AGILITY | PERCEPTION check. On a success, choose one benefit from the below, plus one for each spark you roll. They last for the next full day. On a failure, lose 1 endurance.\n\nParty ignores mixed and difficult terrain\nParty has no risk of getting lost\nParty gains a +2 bonus to camp activity skill checks\n\nThe Night’s Rest Action\nThe party must devote a portion of each day to rest in order to avoid losing endurance. This is usually done as the final action of the day, after the advance and camp actions.\nTaking a night’s rest action means spending a period of eight hours in downtime. You gain the benefits only when you finish the rest. If your rest is disrupted by an encounter, you can resume resting afterward and still gain the benefits when you finish.\nEat Rations\nYou must eat each time you take a night’s rest, making a depletion check for a ration in your inventory. If you cannot, lose 1 Endurance.\nBenefits of a Night’s Rest\nWhen you complete a night’s rest, you gain the following benefits:\n\nYou regain all hit points.\nYou lose your remaining recovery dice, then gain recovery dice up to your current endurance score.\nYour focus costs are reset.\n\nRandom Encounters\nEach time the party rests in a wild or unsafe location, the Judge makes an encounter check to see if they are interrupted by an encounter (p. 60).\nIf they have an encounter during their rest and no one is keeping watch, they do not make a surprise check:\n\nThe party starts the encounter sleeping.\nThe other group gets to choose any approach, including an ambush.\n\nKeeping Watch\nYou can choose one or more party members to keep sentry to avoid an ambush.\n\nThose characters do not gain the benefit of the rest, unless they took the rest early camp activity earlier in the day.\nIf the party has a random encounter, the sentry can wake everyone up, preventing an ambush and allowing them to make their group surprise check as normal.\n\nHaven\nAlchemize\nAttempt to alchemize a useful item from the reagents you have gathered on your journeys. Spend two ingredients and make a simple INTELLECT | ALCHEMY check. On a success, you create one lesser mixture of your choice. On a failure, you make a random lesser mixture instead\nBuild\nMake a MIGHT | ATHLETICS check for the building project of your choice. On a success, advance its clock by one, plus one per spark.\nConvalesce\nSpend the week off your feet, focusing only on recovering from an injury. Make a simple MIGHT + SPIRIT check. On a success, advance your injury clock by one\nHelp\nYou abstain from taking your own haven action to help an ally with their own pursuit. Describe what you do to help your ally. If they take a haven action that requires a skill check, they gain one additional spark on a success.\nHire\nSpend the week seeking out a specialist for a particular job. Make a SPIRIT | SPEECH check. On a success, choose a hireling from the available options and retain their services. They start next week. For each spark, you may retain an additional hireling.\nMuster Allies\nYou organize the citizens to search the surrounding lands for fellow survivors and wayfarers. Make a SPIRIT | SPEECH check. On a success, increase the population rank by one. If you roll a spark, the Judge also rolls for an arrival.\nPlan Building\nLay the groundwork for a new haven building, or start upgrading an existing one. Add one building or upgrade to an empty build slot of your choice, then make an INTELLECT | LETTERS check. On a success, advance the clock by one, plus one per spark.\nResupply\nYou spend the week preparing for the next expedition. Fill any number of empty slots in your inventory with crude rations or crude torches in any combination. Crude items have a d4 depletion die\nRetrain\nYou devote time to refining your fighting abilities. Replace one of your known talents or enhancements with a different one, or replace one of your known deeds with another of the same tier (light, heavy, or mighty). The deeds must be chosen from adventuring crafts you have unlocked\nStudy Esoterica\nYou devote time to reading or deciphering one of the esoterica you have recovered in your travels. Choose an esoteric object in your inventory and work with the Judge to create a research progress clock with four to ten segments, based on the obscurity and strangeness of the object. Each time you take this action, including when you choose to study a new object, make an INTELLECT | MAGIC check. On a success, advance the clock by one, plus one per spark\nTame Beast\nou attempt to tame a captured animal or monster. Spend one ingredient, then make a SPIRIT | NATURE check. On a success, advance its taming clock by one, plus one per spark. Most creatures have taming clocks with a number of segments equal to LEVEL x 2\nWork on Project\nWork on a project not covered by the other haven actions. Describe what you do to advance it, and the Judge will call for an appropriate skill check, if any. On a success, you advance the progress clock by one, plus one per spark."},"metamageia/Trespasser-Solo-Design/Archive/Usurper-Dungeon-Tables-Prototype-OLD":{"slug":"metamageia/Trespasser-Solo-Design/Archive/Usurper-Dungeon-Tables-Prototype-OLD","filePath":"metamageia/Trespasser Solo Design/Archive/Usurper Dungeon Tables Prototype OLD.md","title":"Usurper Dungeon Tables Prototype OLD","links":[],"tags":[],"content":"📌 Trait: Haunted\n🎲 Haunted Feature Table (d20) – Thematic Objects, Hazards, &amp; Loot\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nd20Haunted Room DescriptorFeature DescriptorHazardLoot1Whispering ShadowsWhisperingCursed Mark2Cold &amp; StillFlickeringGhostly Manifestation3Flickering LightBloodstainedHidden Trap4Rot-StainedCrackedPhantom Cold5Drifting FogFloatingPossessionChild’s Haunted Doll (Random Occult Incantation)6Eerie SilenceSplinteredCollapsing Floor7Echoing FootstepsHollowUnseen Presence8Bloodstained WallsChillingSudden ScreamRitual Cloth9Unnaturally DarkMurmuringLurking WraithCracked Mirror10Crumbling &amp; HollowEchoingShadowed Hands11Lingering ScentDistantPoltergeist AttackAncient Map12Scratched &amp; ScarredWorn &amp; FadedIllusory Hallway13Impossible GeometryUnstableSpectral Chains14Murmuring AirBoundCursed Runes15Distant WeepingShatteredShifting Walls16Faintly GlowingDrenchedWeeping Apparition17Chilling WindFracturedSummoning Sigil18Watchful &amp; UnseenOminousHaunting Vision19Frozen in TimeWarpedSudden Door SlamA Tin of Dried Herbs (1 Normal Ingredient)20Wailing &amp; RestlessTwistingScreaming Portrait\n\n📌 Form: Castle\n🎲  Feature Table (d20) – Thematic Objects, Hazards, &amp; Loot\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nd20Castle Room TypeHazardFeature DescriptorLoot1Grand HallFalling DebrisBanner2Throne RoomTrapped MechanismThroneGem-Encrusted Seal3BarracksShattered FloorPedestalSilver Goblet4Guard TowerCollapsing CeilingChandelier5Royal ChambersHidden Spike TrapStatuette6Dining HallCrumbling StructureCarved ArchwayOrnate Key7BallroomConcealed PassageWall Tapestry8Dungeon CellRusted HingesIron Gate(1d6 cp)9Alchemy LabIllusory WallBookcase10WatchpostStructural WeaknessPillarWax-Sealed Scroll11LibrarySlippery SurfaceMosaic12War RoomDistorted ReflectionMirrorons**)13GallerySudden BackdraftFireplace14Servant QuartersPoisoned WaterFountainSmall Ruby15CourtyardRusted BladesArmory Rack16Hidden PassageLocked &amp; TrappedHidden Vault17Overgrown GardenCracking Under PressureStone Bust18ChapelStuck DrawerDeskWax-Sealed Letter19Ruined TowerLoose RailingsBalconyOrnate Spyglass20VaultSudden CollapseSpiral Staircase\n"},"metamageia/Trespasser-Solo-Design/Astral-Vault-Tables-WIP":{"slug":"metamageia/Trespasser-Solo-Design/Astral-Vault-Tables-WIP","filePath":"metamageia/Trespasser Solo Design/Astral Vault Tables WIP.md","title":"Astral Vault Tables WIP","links":[],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nd20TraitLootIncantations1Blinding(Equipment)2Fractal(Equipment)3Umbral(Equipment)4Gravitic(Equipment)5Distorted(Equipment)6Levitating(Equipment)7Inverted(Equipment)8Luminescient(Equipment)9Pulsating(Weapon)10Weightless(Weapon)11Glasslike(Weapon)12Paradoxical(Armor)13Humming(Armor)14Expanding(Armor)15Aetheric(Treasure 1)16Constellating(Treasure 2)17Starlit(Treasure 3)18Nebulous(Astral Incantation)19Celestial(Astral Incantation)20EldritchRoll Magic Item\nVault\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nd20RoomFeatureLoot1CarcerAbyss(Equipment)2CisternSigils(Equipment)3CatacombPressure Plate(Equipment)4OublietteIron Chains(Equipment)5ScriptoriumScaffold(Equipment)6PanopticonPillar(Equipment)7AtriumStatue(Equipment)8AqueductObelisk(Equipment)9LaboratoryEngraved Mural(Weapon)10AntechamberConduit(Weapon)11ForgeBridge(Weapon)12StockroomAlcove(Armor)13SanctumStaircase(Armor)14ConclaveStone Slab(Armor)15GarrisonIron Cage(Treasure 1)16ArmoryAltar(Treasure 2)17ArchiveBookshelves(Treasure3 )18TreasuryArmored Cabinet(Scholarly Incantation)19Relic HallDisplay(Scholarly Incantation)20Grand RepositoryVault DoorRoll Magic Item"},"metamageia/Trespasser-Solo-Design/Theurgist---Trespasser":{"slug":"metamageia/Trespasser-Solo-Design/Theurgist---Trespasser","filePath":"metamageia/Trespasser Solo Design/Theurgist - Trespasser.md","title":"Theurgist - Trespasser","links":[],"tags":[],"content":"The Theurgist\nA calling for one who would bridge the chasm between mortal despair and divine mystery.\nIn a world steeped in cynicism and the dying echoes of forgotten gods, you have discovered that the sacred rites of old—whispered in hidden temples and etched in ancient hymns—still carry the power to stir souls. While others dismiss such archaic rituals as the ramblings of madmen, you have felt the unmistakable touch of the divine in moments of quiet revelation. It was not chance that set you on this path, but a profound summons from realms unseen—a beckoning to rekindle the dormant fires of transcendent truth. Embrace the call of the sacred, and let your voice be the beacon that summons the gods back to a world starved for wonder.\nInitial Skills\nWhen you take up this calling, you learn a number of initial skills equal to your INTELLECT. Whenever your INTELLECT increases at a higher level, learn another skill. Only your initial skills are restricted to this list.\n\nAthletics\nCrafting\nFolklore\nLetters\nMagic\nSpeech\n\nAdventuring Crafts\n\nDefense (MIGHT)\nEarth (MIGHT)\nFrost (INTELLECT\nLeadership (SPIRIT)\nProwess (INTELLECT)\nWind (AGILITY)\n\nExpert Fortitude\nWhen you take up this calling, your hit points increase by an extra +5. This makes your hit point total at second level equal to 15 + 2 (MIGHT).\nSacred Incantations\nThe strength of your faith lends you the power to cast incantations. When you take up this calling, learn INTELLECT + 2 incantations. Whenever your INTELLECT increases at higher level, learn another. You learn them randomly from the sacred magic table\nDivine Virtues\nTheurgists spend much of their time in sacred ritual to invoke the gods to induce their presence and embody their divine virtues. When you take up this calling, replace one of your alignment traits with a Virtue. You gain the Lasting State associated with your chosen Virtue with an intensity equal to its total affirmations +1.\nAs a camp activity, you may choose to invoke a different Divine Virtue. This replaces your existing Divine Virtue. Doing so does not reset its affirmation or denial progress. Replace the Lasting State associated with your previous Divine Virtue with the new one. You may not take a Divine Virtue when suffering a lasting effect that would be canceled by its associated State.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVirtueLasting StateHymn EffectCalmSolace: Gain intensity bonus to prevail checksThe target may immediately roll to prevail against one state affecting them.DaringSwiftThe target may immediately move their speed towards any hostile creature.ThoughtfulAccurateThe target may immediately attempt a light deed.DutifulGuardedThe target may confer provoked 2 to an adjacent creature.GenerousMendingThe target may transfer any one common state to a willing ally within sight.HonestUnyielding - Reduce forced movement by intensity.The target may immediately push or pull a creature within sight a number of squares equal to their Unyielding intensity.SupportiveFortifiedGrant the target a support die.HumbleStrongThe target may swap positions with one willing ally in sight.KindWillfulGrant recovery 2TrustingHastenedThe target may exchange any amount of Focus with one willing ally within sight.\n\nHieratic Hymn\nYour diligent cultivation of divine virtue expressed through ceremony and song nurtures both power and healing in yourself as well as your allies. You gain the Hieratic Hymn special deed. It has no focus cost. At the start of each combat encounter, you gain the ability to attempt this deed. Once you do, it is lost until you regain it, as described below\n\nHIERATIC HYMN\nSPELL SUPPORT VS. IO | 1 CREATURE\nBase: Confer the State associated with your Divine Virtue.\nHit: Confer your Divine Virtue Hymn Effect with an Intensity equal to your Divine Virtue’s total affirmations +1.\nSpark: Confer your Hieratic Hymn Effect to an additional target creature.\n\nWhenever you take a moment to recover in combat, you issue an appeal to the divines to restore you. When you attempt the Recover deed, you may spend one spark to regain the use of your Hieratic Hymn.\n\nEnhancements\nAnagoge\nWhenever you use your Hieratic Hymn you gain “Flying: This creature jumps instead of moving normally. When it guards an attack, it can jump half its speed” as a State.\nEntheos\nWhen you use your camp action to invoke a new divine virtue, you may choose an additional Divine Virtue for your second alignment, and you gain both Lasting States, and can choose which Divine Virtue to use when attempting your Hieratic Hymn deed.\nHenosis\nWhenever you confer a state to an ally, you also gain that state. Whenever an ally confers a state to you, they also gain that state.\nKatharsis\nWhenever you use your Hieratic Hymn targeting yourself or an ally, you may also immediately end one common State on that target.\nTeleiosis\nWhenever you gain the state associated with your Divine Virtue, or confer that state to an ally, add your Skill bonus to its intensity.\n\nTalents\n"},"metamageia/Trespasser-Solo-Design/Trespasser-Dungeon-Generator":{"slug":"metamageia/Trespasser-Solo-Design/Trespasser-Dungeon-Generator","filePath":"metamageia/Trespasser Solo Design/Trespasser Dungeon Generator.md","title":"Trespasser Dungeon Generator","links":[],"tags":[],"content":"Hostility\nHostility, Target Number, Threat Rating, Threat Range\nI Bleak, 10, 2d6 x 10, 20 to 120\nII Sinister, 12, 2d6 x 20, 40 to 240\nIII Frightening, 15, 2d6 x 30, 60 to 360\nIV Harrowing, 18, 2d6 x 40, 80 to 480\nV Nightmarish, 20, 2d6 x 50, 100 to 600\nSize &amp; Treasure\nSize, Rooms, Treasure Roll\nTiny, 2D4 (~5), 2D6 X HOSTILITY\nSmall, 4D4 (~10), 4D6 X HOSTILITY\nMedium, 6D4 (~15), 6D6 X HOSTILITY\nLarge, 8D4 (~20), 8D6 X HOSTILITY\nHuge, 10D4 (~25), 10D6 X HOSTILITY\nMagic Items\nThe treasure roll also determines the number of magic items in the dungeon. For each die that resulted in a 1 or 2, add a magic item somewhere in the dungeon. You can roll these randomly using the rules in Chapter XII or create magic items that would be appropriate for the fictional location.\nFunnel Hooks\n\nEscaped Prisoners\nAvoiding Ritual Sacrifice\nTest Subjects\nAccidental Entry\nGladiator Arena\nShipwreck\nRaid / Invasion\n\nHook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKidnapping: A friendly non-player character has been kidnapped and taken to the dungeon, and there may be rewards for their rescue.Strange Lights: The dungeon is said to be empty and long abandoned, but strange lights coming from the place can be seen after dark.Foul Weather: A fierce storm or other terrible and deadly weather will force the adventurers to pause their travels, and the dungeon is the only sanctuary.Beast: Commoners in the surrounding lands have been terrorized by a monster rumored to make its home in the dungeon.The Vision: A member of the party is having strange dreams every time they rest, directing them toward the dungeon.The Exiles: The adventurers encounter a group of friendly creatures that have been banished from the dungeon and hope to reclaim it.Curse: A curse emanating from the dungeon has befallen the surrounding lands, and the locals will pay any price to have it lifted.Thieves: A group of bandits or monsters has stolen something of value from the party or a friend to the party, and have taken it to the dungeon.Accidental Entry: By means of a trap, a pitfall, or other random accident, the adventurers have become trapped in the dungeon.Rumors: The party have encountered a few different folks who have whispered intriguing tales about the dungeon in the area.Distress Signal: Someone within the dungeon needs help and has reached out to the party somehow, by magic, an arrow with a message, or some other means.Hired Hands: A colorful character wants to explore the dungeon, and will reward the adventurers for their service.Anomaly: A strange magical phenomenon is happening in the surrounding communities, and its source lies within the dungeon.The Gathering: Bands of criminals or monsters are appearing in the area, drawn by a source within the dungeon.Magic Compass: A magical object seems to point in the direction of the dungeon and will lead the party there for some inscrutable purpose.Artifact: Local legends tell of a specific magical artifact to be found within the dungeon.\nTrait Ideas\n\nToxic\nMechanical\nGhostly\nPrimal\nVerdant\nDecaying\nArcane\nFrigid\nEldritch\nSubterranean\nCelestial\nAncient\nAlien\nDemonic\nInfested\nOozing\nOssified\nLiminal\nGargantuan\nBloody\nPyric\nOpulent\nCorrupted\nEnigmatic\n\nTrait\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n12341Primordial: This dungeon is so ancient that its architecture is completely unrecognizable and alienIllogical: This dungeon is magical and has impossible geometry and spaces that don’t make sense.Underworld: This dungeon connects to a large cavern, settlement, or body of water deep beneath the earthInhospitable: This dungeon is difficult to be inside due to sweltering heat, lack of air, a foul stench, or something else.2Moving: Whether by magic or the intervention of a giant creature, this dungeon somehow changes location.Dimensional: The threshold of this dungeon is a magical portal that leads to another plane of existence.Corrupting: This dungeon contains a source of evil magic that is corrupting the land around itDeath Trap: This dungeon contains a high number of deadly traps, guarding commensurately valuable treasure.3Fungal: A dangerous fungus has overtaken much of this dungeon and infested a number of its guardiansSinking: This dungeon is partially flooded by seeping groundwater, which has invited aquatic fauna to take up residence.Connected: This dungeon connects incidentally to another dungeon built in a different time for a different purpose.Diverse Design: This dungeon consists of both a natural environment and a designed architectural space.4Hallucinogenic: Due to chemicals in the air, this dungeon gradually makes trespassers disorientedLair: This dungeon is known by folks in the surrounding lands as the home of a terrible beast.Modern Ruin: This dungeon was just recently ransacked, and those responsible for its ruin may still be present.Forbidden: The peoples in the surrounding lands know of this dungeon and forbid others to visit it.5Unstable Architecture: Trespassing upon this dungeon may cause a section to collapse, changing the geography.Cohabitation: This dungeon has new residents who have learned to coexist with its original guardians.Porous: This dungeon has numerous entrances and exits, some more treacherous than others.Self-Destructing: This dungeon is rigged to collapse and destroy itself if its treasures are violated, though trespassers may have a brief moment to escape.6Riddling: This dungeon has an elaborate puzzle that leads to a great treasure at its heart.Converted: This dungeon has been turned into a settlement by a group of commoners or peaceful monsters.Façade: The first few rooms of this dungeon are an elaborate ruse that conceal the true dungeon below.Rival Party: This dungeon is being explored by another party that may be unfriendly to others honing in on their find.7Prized: This dungeon has been discovered by other groups, several of which are competing for its many treasuresImmaculate: This dungeon is well-hidden and has eluded robbers and trespassers until nowContested: This dungeon contains two or more factions competing for control.Looted: This dungeon has already been looted for most of its valuables, though some of the more well-hidden treasure may remain.8Winding: This dungeon circles back on itself in illogical and confounding ways.Vanishing: This dungeon is only accessible some of the time or under certain circumstancesProving Ground: This dungeon was built as an obstacle course to test a certain type of candidate.Isolated: This dungeon is in a hard-to-reach place, and just reaching its entrance is much of the challenge.9Wild: Nature has begun reclaiming this dungeon, and animals and woodland spirits have moved in.Worshipped: People of the surrounding lands worship this dungeon or a creature that resides within it.Legendary: Referenced in legends and stories, this dungeon was thought to be a mythical place.Bountiful: This dungeon contains far more treasure than a normal dungeon of its size.10Cursed: This dungeon inflicts a terrible curse on those who trespass upon itImprisoned Evil: This dungeon contains a long-imprisoned entity, and those trespassing may risk unleashing it.Haunted: This dungeon is inhabited by the spirits of its former residents, who may offer guidance or seek aidFun House: This dungeon was built for the morbid amusement of some sadistic villain of the past.\nForm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n12341Pit: This dungeon is a pit that descends deep into the ground, but there are various ledges where creatures have nested.Cliff Dwelling: This dungeon is a series of caves and chambers built into a cliffside.Cave: This dungeon is a sprawling network of natural caverns filled with wild creatures.Warrens: This dungeon is a network of snaking burrows dug by large beasts who likely still call it home.2Graveyard: This dungeon is a sprawling cemetery consisting of courtyards, winding arcs, and separate mausoleums.Temple: This dungeon was cathedral or other grand and sacred place of worship.Mine: This dungeon is a long- abandoned mine, once full of precious metalsTomb: This dungeon serves as the resting place for an ancient figure of great power3Wreck: This dungeon is the wreck of an enormous ship or other vesselHideout: This dungeon is the headquarters of a criminal group, secret society, cult, or other organization.Infrastructure: This dungeon was an ancient aqueduct, tunnel, or sewer meant to facilitate the needs of a long-gone cityMenagerie: Numerous exotic creatures were brought to this dungeon, and now they have the run of the place4Settlement: This dungeon is a ruined town or city, consisting of rubble-strewn streets and collapsed buildingsEstablishment: This dungeon was a large inn, tavern, theater, or other building meant to house and entertain many folksPrison: This dungeon was used to house criminals, demons, or other beings of disrepute.Mansion: This dungeon is an overgrown manse where an eccentric noble family once made their home.5Castle: This dungeon is an abandoned haven that was once the seat of power in this region.Gallery: This dungeon was once a museum filled with impressive art or other great treasures.Laboratory: This dungeon was the workshop of an ambitious and possibly deranged spellcasterTower: This dungeon is a ruined tower that conceals a great number of magical secrets6Archive: This dungeon was built to house knowledge from an ancient timeSchool: This dungeon was once a place of learning and research for academicsManufactory: This dungeon was built to facilitate smithing or some other specific type of complex workVault: This dungeon is a manufactured vault designed to seal in something very valuable or very dangerous"},"metamageia/Trespasser-Solo-Design/Trespasser-Ideas":{"slug":"metamageia/Trespasser-Solo-Design/Trespasser-Ideas","filePath":"metamageia/Trespasser Solo Design/Trespasser Ideas.md","title":"Trespasser Ideas","links":["metamageia/Trespasser-Solo-Design/Theurgist---Trespasser","metamageia/Trespasser-Solo-Design/Usurper---Solo--and--Judge-less-Rules-for-Trespasser"],"tags":[],"content":"\nMonster of the Week Jam\nFirst Day Jam\nTheurgist - Trespasser\nWild Magic / Oddities Alignment based class - the menagerie?\nUsurper - Solo &amp; Judge-less Rules for Trespasser\nInfiltrator - Trespasser SCIFI\n\nIncursor?\n\n\n"},"metamageia/Trespasser-Solo-Design/Usurper---Solo--and--Judge-less-Rules-for-Trespasser":{"slug":"metamageia/Trespasser-Solo-Design/Usurper---Solo--and--Judge-less-Rules-for-Trespasser","filePath":"metamageia/Trespasser Solo Design/Usurper - Solo & Judge-less Rules for Trespasser.md","title":"Usurper - Solo & Judge-less Rules for Trespasser","links":["Trespasser-Solos","Sersi-Character-Sheet.canvas","Luntidor-Keep-Sheet.canvas","Trespasser-Rulebook-v2.0.3.pdf","The-Laughing-Hound-v2.0.3.pdf","metamageia/Trespasser-Solo-Design/Actions-List","metamageia/Trespasser-Solo-Design/Trespasser-Dungeon-Generator","metamageia/Trespasser-Solo-Design/Usurper-Dungeon-System","metamageia/Trespasser-Solo-Design/Usurper-Dungeon-Tables-Prototype-v2","metamageia/Trespasser-Solo-Design/Procedures.canvas","metamageia/Trespasser-Solo-Design/Usurper-Travel-System","metamageia/Trespasser-Solo-Design/Usurper-Calendar-System"],"tags":[],"content":"To Dos\n\nCore Oracle / GM Emulator\nRegion Frame monthly\n\nCalendar &amp; Events System\n\n\nHaven Threats and Faction Events\nExpanded Quests and Ventures system\nmetamageia.github.io/overlord/\n\nSolo Playtest\n\nTrespasser Solos\n\nSersi Character Sheet\nLuntidor Keep Sheet\n\n\n\n\nCore Books\nTrespasser Rulebook v2.0.3.pdf\nThe Laughing Hound v2.0.3.pdf\nExtracted References\nActions List\nTrespasser Dungeon Generator\nCurrent Systems\nUsurper Dungeon System\n\nUsurper Dungeon Tables Prototype v2\nProcedures\nUsurper Travel System\nUsurper Calendar System\n\n\nNotes\nPlaytest Notes\n\nRoom Sparks and Shadows should apply to feature roles, make rooms/traits high on room tables favorable in flavor and lower ones less favorable in flavor to account for this. Same for features\n\nFind a way to resolve which table to roll room sparks on when spending on feature tables? Or maybe just use Feature Sparks\n\n\n\nSession 4 Notes\n\nFind a way to incorporate dungeon size rolls into determining exteriors\n\nGive each dungeon a die size: d2, d4, d6, d8, d10, d12, d20\n\nSwitch to d6 pool\n\n\nRoll four of the dungeon dice when moving through an unexplored door. If the total of the 4dX is less than the total number of generated rooms, it is an exit. If not, proceed to room generation.\n\n\nFind a way to determine locked doors before generation\n\nSession 5 Notes\n\nOn advance action, roll for encounter at the end of the advance? Also POI\n\nRoll Encounter and Feature check simultaneously at the end of an Advance. Normal thresholds apply, except on a double you always find both.\n\n\n-2 haven adjacency\n\n\nUsurper Campaign Notes\nSession 1\n\n2d8 Door Check = Small Dungeon\n\nConsider a d10 system, or increasing die sizes\n\n\nProper Trap Generation Procedure needed\nNeed a reminder to check for locked doors - integrate exterior check into it\n\n\nCompanion Notes\n\nSkills, Endurance, and Recovery Dice?\n\nCompanions Endurance and Recovery Dice = 10+Resist\nSkill Die = Template DMG Die\nFind a way to add skills to companions\n\n\nSpend Population to generate companions\n\nRecruit Companion: SPIRIT | SPEECH\nFrom list of arrivals\n\n\nCompanions Level = Haven Level\n\nIdeas\n\nMake Overlord Pack for Enemies\n\nLook into Monster Themes from 4e\nCreate More Robust Generation Tools / Tables\n\n\nExpanded venture list / generator for campaign generation (like vows)\nUse Progress Clocks with Ventures for creating quests / “Vows”\n\nCreate a Commoner death clock for adjusting loot/encounter dice rolls?\n\n\n\nTravel\n\nTraits\n\nWhen rolling doubles on hex generation, assign a Trait to that hex.\n\nNewly generated tiles of the same terrain type adjacent to the hex inherit its Trait.\nDungeons and Settlements generated in that hex inherit that Trait instead of rolling a random Trait.\n\n\n\n\n\nOracles\nOverlord and Faction Generators?\nTrait\nDone: Haunted\nWIP: Astral\nNext: Fungal, Demonic\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTrait (d4, d6)12341FungalAstralHauntedDemonic2VerdantDecayingArcaneFrigid3EldritchSubterraneanMechanicalAncient4AlienPrimalInfestedOozing5OssifiedLiminalGargantuanBloody6PyricOpulentCorruptedEnigmatic\nForm\nDone: Castle\nWIP: Vault\nNext: Cave, Hideout\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nForm (d4, d6)12341Pit: This dungeon is a pit that descends deep into the ground, but there are various ledges where creatures have nested.Cliff Dwelling: This dungeon is a series of caves and chambers built into a cliffside.Cave: This dungeon is a sprawling network of natural caverns filled with wild creatures.Warrens: This dungeon is a network of snaking burrows dug by large beasts who likely still call it home.2Graveyard: This dungeon is a sprawling cemetery consisting of courtyards, winding arcs, and separate mausoleums.Temple: This dungeon was cathedral or other grand and sacred place of worship.Mine: This dungeon is a long- abandoned mine, once full of precious metalsTomb: This dungeon serves as the resting place for an ancient figure of great power3Wreck: This dungeon is the wreck of an enormous ship or other vesselHideout: This dungeon is the headquarters of a criminal group, secret society, cult, or other organization.Infrastructure: This dungeon was an ancient aqueduct, tunnel, or sewer meant to facilitate the needs of a long-gone cityMenagerie: Numerous exotic creatures were brought to this dungeon, and now they have the run of the place4Settlement: This dungeon is a ruined town or city, consisting of rubble-strewn streets and collapsed buildingsEstablishment: This dungeon was a large inn, tavern, theater, or other building meant to house and entertain many folksPrison: This dungeon was used to house criminals, demons, or other beings of disrepute.Mansion: This dungeon is an overgrown manse where an eccentric noble family once made their home.5Castle: This dungeon is an abandoned haven that was once the seat of power in this region.Gallery: This dungeon was once a museum filled with impressive art or other great treasures.Laboratory: This dungeon was the workshop of an ambitious and possibly deranged spellcasterTower: This dungeon is a ruined tower that conceals a great number of magical secrets6Archive: This dungeon was built to house knowledge from an ancient timeSchool: This dungeon was once a place of learning and research for academicsManufactory: This dungeon was built to facilitate smithing or some other specific type of complex workVault: This dungeon is a manufactured vault designed to seal in something very valuable or very dangerous\n"},"metamageia/Trespasser-Solo-Design/Usurper-Calendar-System":{"slug":"metamageia/Trespasser-Solo-Design/Usurper-Calendar-System","filePath":"metamageia/Trespasser Solo Design/Usurper Calendar System.md","title":"Usurper Calendar System","links":[],"tags":[],"content":"Simplify Mythic around Peril + Sparks &amp; Shadows + Alarm\nWorld Frame Sheet?\nFour Overlord Clocks\n\nMaster Plan\n2d6 Peril Based\n\n6 or Less: Stagnation\n7 - 9: One Step\n10 - 12: Two Steps\n\n\n\nPeril =  month\nRoll under month events\n\n\nEvery in-game week, roll 2d10 on an Event Table (like Mythic’s Fate Chart or Ironsworn’s Oracles):\n\n1-10: No major event (minor worldbuilding detail).\n11-40: A faction takes action (introduces or progresses a faction’s goal).\n41-65: A strange rumor spreads (hinting at something larger).\n66-85: An Overlord’s influence is felt (a consequence happens, but no Overlord is revealed).\n86-95: A new Overlord emerges (they were always there, but now they become a known force).\n96-100: An Overlord makes a major move (immediately changes the world state)\n\n"},"metamageia/Trespasser-Solo-Design/Usurper-Dungeon-System":{"slug":"metamageia/Trespasser-Solo-Design/Usurper-Dungeon-System","filePath":"metamageia/Trespasser Solo Design/Usurper Dungeon System.md","title":"Usurper Dungeon System","links":[],"tags":[],"content":"Dungeons\nSteps\n\nGenerate Commoners\nGenerate Dungeon\n\nRoll Dungeon Hook\nRoll Trait + Form\nRoll Name\n\nFormat\n(Trait) (Form) (Namesake)\n\n\n\n\nOpening Scene\n\n\nModified Dungeon Procedures\n\nDepletion Check\nAlarm +1\nAlarm Check for an encounter\nDungeon Actions (3 Total)\n\nExplore:\n\nCan only be used when moving into an unexplored room\nRoll 2d20 vs 10+Tier to determine room archetype and danger, with 1d6 to determine the number of features, and 1d4 to determine the number of doors. One d20 should be on Trait table, the other on Form table.\n\nIf the 1d6 result is lower than the Hostility Tier, you encounter an enemy\nNote the value on the 1d6 for the number of features in the room\nTally the total sparks and shadows on the 2d20 roll for feature generation\n\n\nResolve combat if relevant\nAfter the player(s) roll their intellect|perception check, roll 2d20 generation roll for each feature they investigate\n\nBecause trespassers are always looking for threats (pg 250), harmful features will always be investigated first.\nOne d20 will be on the Trait features list, the other will be on the Form d20 list\nIf you have both sparks and shadows, each feature you roll for will have both common loot and a risk of a shadow?. If it’s just a spark, it’s uncommon loot. If it’s just a shadow, it’s a trap.\n\n\n\n\nSearch:\n\nIf player(s) investigated fewer features than total while exploring, this action can be taken to investigate the rest.\n\n\n\n\n"},"metamageia/Trespasser-Solo-Design/Usurper-Dungeon-Tables-Prototype-v2":{"slug":"metamageia/Trespasser-Solo-Design/Usurper-Dungeon-Tables-Prototype-v2","filePath":"metamageia/Trespasser Solo Design/Usurper Dungeon Tables Prototype v2.md","title":"Usurper Dungeon Tables Prototype v2","links":[],"tags":[],"content":"📌 Trait: Haunted\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nd20RoomLootIncantations1WhisperingDubious Meat (Crude Ration)Amnesia2RestlessShovelAmplify Voice3FlickeringHourglassAnimate Object4Rot-Stained50 ft. Hemp RopeApportation5OdorousLightly Used Bandages (Crude, Grant Recovery 1)Deconstruct6Eerie SilenceLantern (Full)Drowse7EchoingCeremonial Herbs (Normal Ingredient)Etherealize8BloodstainedFine Floating Candle (Follows user while lit)Fog Cloud9UmbralRusted Scythe (d8 / melee / Confer bleeding 4)Ghost Sound10WeightlessEngraved Dagger (d6 / melee, missile 4 / confer frail 4)Gravity Shift11Lingering ScentWarped Staff: (d8/ melee, spell 6 /two-handed/confer toppled)Hover12EctoplasmicTorn Funeral Shroud (L / +0 AR / d6)Illusion13ParadoxicalBroken Iron Shackles (H / +1 AR / d8)Instill Emotions14GhostlyDecorative Mask (L / +0 AR / d8)Levitate15WeepingRusted Locket (Value 1)Phantom Steed16GlowingTarnished Wedding Band (Value 2)Puppet Speech17FrigidSilver Candleholder (Value 3)Reminiscence18MurmuringRandom Haunted IncantationSpeak to Object19FoggyRandom Haunted IncantationSpeak with Dead20WailingRoll for Magic ItemWayfaring Whisper\n\n📌 Form: Castle\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nd20RoomFeatureLoot1Grand HallPillarInstrument2Throne RoomBalconyBeer, 1 gal3BarracksCarved ArchwayCandle4Guard TowerStaircaseFlint &amp; Steel5Royal ChambersMirrorIron Cooking Set6Dining HallIron CageSupply Crate (Materials)7BallroomHouse BannerOrnate Sconces (2 Unlit Torches)8PrisonWall TapestryPreserved Marching Rations (Ration)9Alchemy LabStone BustHunter’s Bow (d10 / missile 8 / Confer slow 2.)10WatchpostFireplaceKnight’s Longsword (d8 / melee / Confer unguarded 2)11LibraryStatuetteSturdy Shortsword (d6 / melee / Confer unguarded 2)12War RoomMosaicSilk Cloak (L / +0 AR / d6)13GalleryChandelierCeremonial Gauntlets (H / +1 AR / d8)14Servant QuartersFountainChainmail Shirt (H / +2 AR / d8)15CourtyardDeskOld Coin Purse16HallwayPedestalHouse Sigil Pin17Overgrown GardenBookcaseNoble’s Signet Ring18ChapelChestDusty Tome (Scholarly Incantation)19Ruined TowerWall MountReligious Icon (Random Sacred Incantation)20VaultMetal SafeRoll Magic Item"},"metamageia/Trespasser-Solo-Design/Usurper-Table-Template":{"slug":"metamageia/Trespasser-Solo-Design/Usurper-Table-Template","filePath":"metamageia/Trespasser Solo Design/Usurper Table Template.md","title":"Usurper Table Template","links":[],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nd20RoomFeatureLootIncantations1(Equipment)2(Equipment)3(Equipment)4(Equipment)5(Equipment)6(Equipment)7(Equipment)8(Equipment)9(Equipment)10(Weapon)11(Weapon)12(Weapon)13(Armor)14(Armor)15(Armor)16(Treasure)17(Treasure)18(Treasure)19(Incantation)20(Incantation)"},"metamageia/Trespasser-Solo-Design/Usurper-Travel-System":{"slug":"metamageia/Trespasser-Solo-Design/Usurper-Travel-System","filePath":"metamageia/Trespasser Solo Design/Usurper Travel System.md","title":"Usurper Travel System","links":[],"tags":[],"content":"Travel\nThe following procedures modify &amp; extend exploration based travel.\n\nWhen making a Wayfinding check, the party simultaneously rolls 1d10. If the result is equal or less to the HOSTILITY TIER, the party veer off their intended path, and their Wayfinding check determines how far they travel in the wrong direction. If they don’t, the Wayfinding check doesn’t matter.\n\nRegain Heading: On a success with a spark, the party regain their heading immediately and travel in the right direction without any lost time.\nDetour: On a success with no sparks, the party goes astray briefly, then regain their heading. They travel half the normal distance on their advance.\nTraveling in Circles: On a failure with no shadows, the party travels gets lost in their current hex and does not move this advance.\nFull Digression: On a failure with shadows, the party travels in the wrong direction, then regain their heading afterward. Roll a 1d6 (rerolling 6’s) and count that many hex faces clockwise from their intended direction for the full distance of their advance.\n\n\nUpon Entering a new unexplored, Hex roll 1d8 (Hostility) and 1d20 (Terrain) together, following the procedures below.\nIf moving into a tile you already know has a River or Road, follow the appropriate procedures under the Hex Features section.\nWhen a player character uses the Explore camp action and succeeds on their check, follow the Hex Features procedure to check for and generate points of interest.\nWhen a player character uses the Scout camp action and succeeds on their check, include the following among their choices (in addition to the other options included in the Scout action):\n\nReveal an adjacent unexplored hex following the Hostility and Terrain procedures.\n\n\nUsing the advance action you may spend 4 points of movement per day.\n2. Leaving a hex as part of an Advance action costs a specific number of movement points depending on Terrain:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTerrain TypeMovement CostFlat (Plains, Savannah, Steppe, Roads, Tundra, Desert)1 Point / HexMixed (Forest, Rain Forest, Hills, Marsh, Thickets, Dunes)2 Points / HexDifficult (Mountains, Swamp, Glacier, Caves, Jungle)3 Points / Hex\n\nAt the end of an advance action, roll two d10s vs Hostility: one for an encounter, one for a POI. If the result of either is less than hostility, it occurs. On doubles of any value, both occur.\n\nHostility Generation\nWhen Advancing into an unexplored Hex, generate the hex’s Hostility Tier by rolling a 1d8 and adding only the highest known Hostility Tier among adjacent hexes:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1d8 + Adjacent HostilityHex Hostility2 – 5Tier I - Bleak6 - 7Tier II - Sinister8 – 9Tier III - Frightening10 – 11Tier IV - Harrowing12 – 13Tier V - Nightmarish\n\nTerrain\nWhen Advancing into an unexplored Hex, generate the hex’s Terrain type by rolling 1d20 on the chart appropriate to the current region. Select the result from the column associated with the terrain type you are entering the new hex from.\nWhenever you roll a natural 1 on terrain, roll on a trait table. Newly generated tiles of the same terrain type adjacent to the hex inherit its Trait. Dungeons and Settlements generated in that hex inherit that Trait instead of rolling a random Trait.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nd6 RollTemperateSubarcticTropicalArid1TropicalTemperateTemperateTemperate2TropicalTemperateTemperateTemperate3SubarcticTemperateTemperateTemperate4SubarcticTemperateAridTemperate5TropicalTemperateAridTropical6AridAridAridTropical\nTemperate\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRollPlainsForestMarshHillsMountainsWater1-10PlainsForestMarshHillsMountainsWater11-16ForestPlainsWaterMountainsHillsMarsh17-18MarshHillsForestWaterPlainsMountain19MountainsMountainsPlainsForestForestPlains20WaterMarshHillsMarshWaterHills\nSubarctic\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRollSteppeForestGlacierHillsMountainsTundra1-10SteppeForestGlacierHillsMountainsTundra11-16ForestSteppeTundraMountainsHillsGlacier17-18GlacierHillsForestTundraSteppeMountain19MountainsMountainsSteppeForestForestSteppe20TundraGlacierHillsGlacierTundraHills\nTropical\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRollJungleRain ForestSwampHillsMountainsWater1-10JungleRain ForestSwampHillsMountainsWater11-16Rain ForestJungleWaterMountainsHillsSwamp17-18SwampHillsRain ForestWaterJungleMountain19MountainsMountainsJungleRain ForestRain ForestJungle20WaterSwampHillsSwampWaterHills\nArid\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRollSavannahThicketsDesertHillsMountainsDunes1-10SavannahThicketsDesertHillsMountainsDunes11-16ThicketsSavannahDunesMountainsHillsDesert17-18DesertHillsThicketsDunesSavannahMountain19MountainsMountainsSavannahThicketsThicketsSavannah20DunesDesertHillsDesertDunesHills\n\nHex Features\nWhen checking if a hex has a feature, roll 1d10 - if the result is lower than the hex’s Hostility rating, roll on the feature table. Add +1 for each adjacent Overlord Domain or Haven:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n1d8 + HostilityPOI CategoryNotes2-4Villages &amp; TownsSettled areas with signs of local life, often in disrepa5 – 8DungeonCatch‐all for ruins &amp; relics, lurid lairs, or temples &amp; shrin9-10Rivers &amp; RoadsIf the tile already has river or road, re-roll on the feature ta11+Overlord’s Domain: Dungeon or Settlement under an Overlord’s control.Increase that Overlord’s Domain level by 1, and roll on the Domain table to see what is discovered. by 1\nRivers &amp; Roads\n\nWhen generating a river or road, roll 1d4 to determine how many tiles it connects. Rivers always reroll a 1.\nUsing the result of the d4 roll, roll Xd6 to determine which directions the river / road connects to - starting with North at 1, numbered clockwise.\nDo not reroll duplicates, they are ignored.\nWhen generating a hex connected to an existing river or road, roll for river &amp; road generation automatically. This does not count against that hex’s POI roll.\nIf following a river or road from a previous Hex, and none of the dice match the direction you’re moving from, replace the nearest result with your entry point.\nIf a road or river connects to a Water Hex, it ends.\n\nOverlord Domains\n\nWhen generating an Overlord’s domain roll 1d4 on the Overlord table to determine which Overlord the territory belongs to. If the Overlord already has an assigned Trait, apply it to the Domain - Otherwise, roll on the Traits table to assign a trait to the Overlord and their Domain.\n\nIf an Overlord’s Domain already exists within 6 Hexes of a newly generated Domain hex, the new Domain belongs to that Overlord.\n\n\n\nAfter determining the Overlord &amp; Trait, roll 2d6 on the Domain Table to determine what kind of Domain is found:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2d6 RollResult2-5Settlement6-12DungeonIf the Domain is in a Hostility IV or V hex and the 2d6 result is less than the Overlord’s current Domain level, you discover their Haven."},"metamageia/develoment/Development-To-Dos":{"slug":"metamageia/develoment/Development-To-Dos","filePath":"metamageia/develoment/Development To-Dos.md","title":"Development To-Dos","links":["metamageia/develoment/Overlord-Development","metamageia/develoment/Hexcrawl-Plugin-Development","metamageia/develoment/Dungeon-Crawl-Plugin-Development"],"tags":[],"content":"Compare TR templates to existing monsters (LazyDM Monster Book method)\nDev Notes\ncmd +k then cmd + 0 to collapse all functions in vscode\n\nOverlord Development\nHexcrawl Plugin Development\nDungeon Crawl Plugin Development\n"},"metamageia/develoment/Dungeon-Crawl-Plugin-Development":{"slug":"metamageia/develoment/Dungeon-Crawl-Plugin-Development","filePath":"metamageia/develoment/Dungeon Crawl Plugin Development.md","title":"Dungeon Crawl Plugin Development","links":[],"tags":[],"content":"Ability to erase dungeon cells\nAdd doors\nAbility center and reset zoom"},"metamageia/develoment/Hexcrawl-Plugin-Development":{"slug":"metamageia/develoment/Hexcrawl-Plugin-Development","filePath":"metamageia/develoment/Hexcrawl Plugin Development.md","title":"Hexcrawl Plugin Development","links":[],"tags":[],"content":"Currently break Graph View\n\nThe ability to load hex tile sets and switch between them while retaining file map data\nAbility to create tile maps from sprite sheets\nAbility to create tile maps from loose images\n\nOutline hexes with notes\n\nToggle Rivers\nToggle Roads\n\n"},"metamageia/develoment/Overlord-Development":{"slug":"metamageia/develoment/Overlord-Development","filePath":"metamageia/develoment/Overlord Development.md","title":"Overlord Development","links":[],"tags":[],"content":"Overlord Version 2.0\nAfter doing a significant refactor of the project’s codebase I’m excited to finally share the first full version update, including some new features.\nNew Features\nAdded Progressive Web App (PWA) Functionality:\n\nOverlord can now be installed as its own app through your browser &amp; used offline.\n\nStatblock Components\n\nFeatures and Deeds can be saved as a component for later use in other statblocks from the UI Editor in the left sidebar use the “Save Component” button next to the individual block.\n\nCurrently three component types: Features, Deeds, and Presets\n\n\nAdded a Components tab to the right sidebar\n\nYou can now browse, preview, and apply saved Deeds and Features to the current statblock from a library of “Statblock Components”\nMultiple Components can be selected, previewed, and applied simultaneously.\nMultiple selected Components can be combined &amp; saved into a single “Preset” Component, which allows you to quickly apply both features and deeds to a Statblock.\n\n\nBundle Compatibility. You can also add Statblock Components to a Statblock Bundle for export &amp; import.\n\nCore Statblock Bundles\n\nAll core Trespasser statblock bundles are now available from the UI. Go to Bundles → Upload, and select on the the core bundles to add to library. Current options are the Core Rulebook statblocks, The Laughing Hound statblocks, and the core monster Role templates. Once added to the library they can be toggled, merged, or deleted like any other bundle - and will always be available in the Upload tab if you need to re-add them to your library in the future.\n\nDescriptions\n\nA small but useful feature: Added an optional multi-line “Description” field to the top of statblocks for miscellaneous text - such as flavor text to be read aloud to players, tactics notes for the Judge, statblock author name, or whatever else you’d like to include.\n\n\nTweaks\n\nDid a significant refactor of the codebase - so if some new bugs may have slipped through the cracks. If you find anything broken please let me know.\nUI Editor\n\nYou can now reorder Deeds &amp; Features, including individual deed lines, in the UI Editor. Also changed the layout of deed lines in the editor to feel a little less cramped.\n\n\nStatblock Render\n\nOnly shows the “Role” field if a role has been selected, for statblocks where a role isn’t needed.\nThe ”-” separator in the title bar only displays if there is a Role, Template, or Level in the statblock data.\n\n\n\n—\nDOing\n\nOverlord 2.1\nUrgent\n\nFix PDF Export to properly show entire statblock\n\nTemporarily disabled\n\n\n\nUI Changes\n\nDynamically Extend left and right sidebars to the bottom of the viewport at all scroll positions\n\nMobile\n\nFix TR placement on mobile\nSwipe gesture to move sidebars\n\nQOL\n\nTraits\n\nTags in Statblock YAML\n\n\nTags\n\nTags in Library Data\n\n\n\nFeatures"},"metamageia/develoment/Untitled":{"slug":"metamageia/develoment/Untitled","filePath":"metamageia/develoment/Untitled.md","title":"Untitled","links":[],"tags":[],"content":""},"metamageia/metamageia-youtube/scripts/Nothing-at-the-Bottom---MOSAIC-Strict-and-Modular-TTRPG-Design":{"slug":"metamageia/metamageia-youtube/scripts/Nothing-at-the-Bottom---MOSAIC-Strict-and-Modular-TTRPG-Design","filePath":"metamageia/metamageia-youtube/scripts/Nothing at the Bottom - MOSAIC Strict and Modular TTRPG Design.md","title":"Nothing at the Bottom - MOSAIC Strict and Modular TTRPG Design","links":[],"tags":[],"content":"\nNOTHING AT THE BOTTOM\nMOSAIC STRICT\nnote:\nHeya this is Metamageia and today I’ll be talking about modular design in tabletop RPGs.\n\n\nOverview of What the video will be about\n\n\n\n“Everything in this video is public domain”\n\n\n\nPersonal anecdote &amp; history with the topic\n\n\n\nIntroduce a term or theory with a catchy name that encapsulates the person relationship to the concept\n\n\n\nIntroduce the problem being solved and how the topic relates\n\n\n\nDig into core concepts\n\n\n\nProvide example and/or demonstration\n\n\n\nExtra tips\n\n\n\nOverview &amp; Conclusion\n\n\n\nTHANK YOU\nbuymeacoffee.com/metamageia"},"system/changelog":{"slug":"system/changelog","filePath":"system/changelog.md","title":"changelog","links":["daily/2025-06-06","/","daily/2025-06-05","Timeline-Plugin","Nix-User-Repository-(NUR)","Vignette-vs-Compose","Cognitive-Assessment","Comprehensive-Adult-Intelligence-Test-(CAIT)","Jouve-Cerebrals-Test-of-Induction-(JCTI)","Arguments","Rating-of-Perceived-Exertion","N-Back","Rapid-Serial-Visual-Presentation","Interleaving","Compose2nix","Infrastructure-as-Code-(IaC)","Docker-Compose","Docker","daily/2025-06-04","Mentats","Quartz","Typst","daily/2025-06-03","NixOS-Rebuild-Lock-Issue","daily/2025-06-02","Agent","Sociocybernetics","Alfred-North-Whitehead","Process-Philosophy","Phenomenology-of-Agency","Process-Phenomenology","Fossify-Calendar","Obsidian-Plugins","Reaper","Reableton","SWS-Extensions","ReaPack","Learning-in-Public","Nicole-van-der-Hoeven","Obsidian-Vault-Changelog-Plugin","BRAT-Obsidian-Plugin","system/templates/template.review.weekly","system/templates/template.review.daily","Spaced-Repetition","metamageia/develoment/Untitled","metamageia/develoment/Overlord-Development","Point-Crawls-and-Depth-Crawls","metamageia/Trespasser-Solo-Design/Usurper---Solo--and--Judge-less-Rules-for-Trespasser","metamageia/MOSAIC-Playbooks/Dark-Fantasy-Character-Playbook-for-MOSAIC-Strict","metamageia/MOSAIC-Story-Kits/Story-Kit-Concept","metamageia/MOSAIC-Story-Kits/Story-Kit-Template-Outline","metamageia/MOSAIC-Story-Kits/Amid-the-Silence,-Hunger-MOSAIC-Strict-Trifold-Story-Kit","metamageia/MOSAIC-Playbooks/Dark-Fantasy-Character-Playbook-Itch.io-page","Solo-RPG-MA-Wishlist","Ideal-Solo-RPG","MOSAIC-Strict","metamageia/metamageia-youtube/scripts/Nothing-at-the-Bottom---MOSAIC-Strict-and-Modular-TTRPG-Design","metamageia/develoment/Hexcrawl-Plugin-Development","metamageia/develoment/Development-To-Dos","metamageia/Trespasser-Solo-Design/Theurgist---Trespasser","metamageia/Trespasser-Solo-Design/Trespasser-Ideas","metamageia/Trespasser-Solo-Design/Usurper-Travel-System","metamageia/Trespasser-Solo-Design/Trespasser-Dungeon-Generator","metamageia/Trespasser-Solo-Design/Astral-Vault-Tables-WIP","metamageia/Trespasser-Solo-Design/Usurper-Table-Template","metamageia/Trespasser-Solo-Design/Usurper-Dungeon-Tables-Prototype-v2","metamageia/Trespasser-Solo-Design/Archive/Usurper-Dungeon-Tables-Prototype-OLD","metamageia/develoment/Dungeon-Crawl-Plugin-Development","metamageia/Trespasser-Solo-Design/Actions-List","metamageia/Trespasser-Solo-Design/Usurper-Dungeon-System","metamageia/Trespasser-Solo-Design/Usurper-Calendar-System","Gamemaster-Ideas","Encounter-Design","Dungeon-Design","Session-Preparation","Table-Top-Role-Playing-Games-(TTRPGs)","Formless-Class-Generator-(Idea)","Running-a-Hexcrawl","Embed-Perchance-Generators-in-Obsidian-Notes","Eight-Steps-of-the-Lazy-Dungeon-Master","Programmable-Attention","Recipe---Garlic-Egg-Toast-by-Cooking-Haru","Recipe---Garlic-Smashed-Potatoes-Recipe-by-Cooking-Haru","DAVx5","Kvaesitso","Free-and-Open-Source-Software-(FOSS)","Process-Identity","Timestamp-Notes-Plugin","Spaced-Repetition-Plugin","Obsidian","PKMashup-Notes","Obsidian-Publish-and-The-Doc-Web","Game-Design","My-Analog-Productivity-and-PKM-System","Hermeticism","Hermetica","Personal-Knowledge-Management-(PKM)","Saturn","Moon","Mars"],"tags":[],"content":"\n2025-06-06 at 00h19 · 2025-06-06\n2025-06-06 at 00h15 · index\n2025-06-05 at 23h49 · 2025-06-05\n2025-06-05 at 20h47 · Timeline Plugin\n2025-06-05 at 18h46 · Nix User Repository (NUR)\n2025-06-05 at 13h32 · Vignette vs Compose\n2025-06-05 at 11h51 · Cognitive Assessment\n2025-06-05 at 11h51 · Comprehensive Adult Intelligence Test (CAIT)\n2025-06-05 at 11h49 · Jouve-Cerebrals Test of Induction (JCTI)\n2025-06-05 at 11h48 · Arguments\n2025-06-05 at 11h46 · Rating of Perceived Exertion\n2025-06-05 at 11h42 · N-Back\n2025-06-05 at 11h40 · Rapid Serial Visual Presentation\n2025-06-05 at 11h37 · Interleaving\n2025-06-05 at 11h33 · Compose2nix\n2025-06-05 at 11h30 · Infrastructure as Code (IaC)\n2025-06-05 at 11h27 · Docker Compose\n2025-06-05 at 11h24 · Docker\n2025-06-05 at 01h47 · 2025-06-04\n2025-06-05 at 00h26 · Mentats\n2025-06-05 at 00h23 · Quartz\n2025-06-05 at 00h20 · Typst\n2025-06-05 at 00h17 · 2025-06-03\n2025-06-04 at 22h55 · NixOS Rebuild Lock Issue\n2025-06-02 at 23h26 · 2025-06-02\n2025-06-02 at 18h39 · Agent\n2025-06-02 at 18h38 · Sociocybernetics\n2025-06-02 at 18h36 · Alfred North Whitehead\n2025-06-02 at 18h35 · Process Philosophy\n2025-06-02 at 18h34 · Phenomenology of Agency\n2025-06-02 at 17h13 · Process Phenomenology\n2025-06-02 at 16h49 · Fossify Calendar\n2025-06-02 at 16h32 · Obsidian Plugins\n2025-06-02 at 16h21 · Reaper\n2025-06-02 at 16h19 · Reableton\n2025-06-02 at 16h16 · SWS Extensions\n2025-06-02 at 16h09 · ReaPack\n2025-06-02 at 15h34 · Learning in Public\n2025-06-02 at 15h30 · Nicole van der Hoeven\n2025-06-02 at 15h26 · Obsidian Vault Changelog Plugin\n2025-06-02 at 15h22 · BRAT Obsidian Plugin\n2025-06-02 at 11h29 · template.review.weekly\n2025-06-02 at 11h29 · template.review.daily\n2025-06-02 at 11h21 · Spaced Repetition\n2025-05-30 at 22h00 · Untitled\n2025-05-30 at 12h33 · Overlord Development\n2025-05-27 at 23h34 · Point Crawls and Depth Crawls\n2025-05-21 at 18h45 · Usurper - Solo &amp; Judge-less Rules for Trespasser\n2025-05-17 at 00h33 · Dark Fantasy Character Playbook for MOSAIC Strict\n2025-05-16 at 03h20 · Story Kit Concept\n2025-05-16 at 03h16 · Story Kit Template Outline\n2025-05-16 at 02h53 · Amid the Silence, Hunger MOSAIC Strict Trifold Story Kit\n2025-05-11 at 16h04 · Dark Fantasy Character Playbook Itch.io page\n2025-05-08 at 21h05 · Solo RPG MA Wishlist\n2025-05-08 at 14h48 · Ideal Solo RPG\n2025-05-04 at 15h35 · MOSAIC Strict\n2025-05-03 at 10h12 · Nothing at the Bottom - MOSAIC Strict and Modular TTRPG Design\n2025-04-29 at 02h48 · Hexcrawl Plugin Development\n2025-04-28 at 00h58 · Development To-Dos\n2025-03-11 at 02h40 · Theurgist - Trespasser\n2025-03-07 at 19h01 · Trespasser Ideas\n2025-03-07 at 19h00 · Usurper Travel System\n2025-03-02 at 04h40 · Trespasser Dungeon Generator\n2025-03-02 at 04h25 · Astral Vault Tables WIP\n2025-03-02 at 03h19 · Usurper Table Template\n2025-03-01 at 22h24 · Usurper Dungeon Tables Prototype v2\n2025-03-01 at 00h48 · Usurper Dungeon Tables Prototype OLD\n2025-02-25 at 03h24 · Dungeon Crawl Plugin Development\n2025-02-24 at 01h33 · Actions List\n2025-02-22 at 06h00 · Usurper Dungeon System\n2025-02-22 at 05h58 · Usurper Calendar System\n2025-01-23 at 00h22 · Gamemaster Ideas\n2025-01-22 at 22h27 · Encounter Design\n2025-01-22 at 22h26 · Dungeon Design\n2025-01-22 at 22h25 · Session Preparation\n2025-01-22 at 22h23 · Table Top Role Playing Games (TTRPGs)\n2025-01-22 at 22h23 · Formless Class Generator (Idea)\n2025-01-22 at 22h16 · Running a Hexcrawl\n2025-01-22 at 22h09 · Embed Perchance Generators in Obsidian Notes\n2025-01-22 at 19h52 · Eight Steps of the Lazy Dungeon Master\n2025-01-21 at 16h33 · Programmable Attention\n2025-01-12 at 17h10 · Recipe - Garlic Egg Toast by Cooking Haru\n2025-01-11 at 17h44 · Recipe - Garlic Smashed Potatoes Recipe by Cooking Haru\n2025-01-07 at 20h35 · DAVx5\n2025-01-07 at 20h29 · Kvaesitso\n2025-01-07 at 20h27 · Free and Open Source Software (FOSS)\n2024-12-16 at 01h52 · Process Identity\n2024-12-15 at 22h27 · Timestamp Notes Plugin\n2024-12-15 at 22h27 · Spaced Repetition Plugin\n2024-12-15 at 22h27 · Obsidian\n2024-12-15 at 21h32 · PKMashup Notes\n2024-12-15 at 21h31 · Obsidian Publish and The Doc Web\n2024-12-15 at 21h30 · Game Design\n2024-12-15 at 21h29 · My Analog Productivity and PKM System\n2024-12-03 at 04h08 · Hermeticism\n2024-12-02 at 23h02 · Hermetica\n2024-12-02 at 20h52 · Personal Knowledge Management (PKM)\n2024-12-02 at 20h46 · Saturn\n2024-12-02 at 20h46 · Moon\n2024-12-02 at 20h46 · Mars\n"},"system/templates/template.personal.contacts":{"slug":"system/templates/template.personal.contacts","filePath":"system/templates/template.personal.contacts.md","title":"template.personal.contacts","links":[],"tags":[],"content":"\nGift Ideas\n\nNatal Chart Info\n\nNotes"},"system/templates/template.review.daily":{"slug":"system/templates/template.review.daily","filePath":"system/templates/template.review.daily.md","title":"template.review.daily","links":["tags/template","{{date:y}}-W0{{date:w}}","system/templates/template.review.daily"],"tags":["DailyJournal","template"],"content":"Delete This Line template\n\nJournal\n\nTransclude of {{date:y}}-W0{{date:w}}#weekly-tasks\n\nTransclude of {{date:y}}-W0{{date:w}}#to-do\n\nTemplate: template.review.daily"},"system/templates/template.review.dream":{"slug":"system/templates/template.review.dream","filePath":"system/templates/template.review.dream.md","title":"template.review.dream","links":[],"tags":[],"content":"\nDream Journal:"},"system/templates/template.review.monthly":{"slug":"system/templates/template.review.monthly","filePath":"system/templates/template.review.monthly.md","title":"template.review.monthly","links":[],"tags":[],"content":"\nWeekly Journals\nLIST\nWHERE Month = {{date:MMM}}\nWHERE contains(tags, &quot;WeeklyReview&quot;) \n\nReflection\n\nNext Month Goals"},"system/templates/template.review.ritual":{"slug":"system/templates/template.review.ritual","filePath":"system/templates/template.review.ritual.md","title":"template.review.ritual","links":[],"tags":[],"content":"\nEmotions:\nPhysical Condition:\nPerformance:\nResults:"},"system/templates/template.review.weekly":{"slug":"system/templates/template.review.weekly","filePath":"system/templates/template.review.weekly.md","title":"template.review.weekly","links":["system/templates/template.review.weekly"],"tags":["WeeklyReview"],"content":"Preview\nGoals:\n\nReview:\n\n\nTo Do\n\nDays\nLIST\nWHERE week = {{date:w}}\nWHERE contains(tags, &quot;DailyJournal&quot;) \n\nWrap-Up\nGet Clear\n\n Email Sweep\n Tasks Sweep\n Calendar Sweep\n Project Sweep\n Finance Check\n\nCapture\n\n Idea Book\n Consolidate Inbox\n\nPrepare\n\n Create Calendar Events\n Update Next Week’s Preview\n Select Project(s)\n Update Tasks\n\n\nTemplate: template.review.weekly"},"system/templates/template.ttrpg.campaign":{"slug":"system/templates/template.ttrpg.campaign","filePath":"system/templates/template.ttrpg.campaign.md","title":"template.ttrpg.campaign","links":["tags/template"],"tags":["template"],"content":"(Note: Delete this line template )\nThe Setting Of &lt;%tp.file.title%&gt;\nPlayer Characters\n(Create note link for each character)\nTABLE WITHOUT ID file.link AS &quot;Player Characters&quot;, player AS &quot;Player&quot;, description AS &quot;Description&quot;\nWHERE contains(type, &quot;PlayerCharacter&quot;) AND contains(campaign, &quot;&lt;%tp.file.folder(false)%&gt;&quot;) AND !contains(file.tags, &quot;#template&quot;)\n\nSessions\nTable shows a list of sessions from this specific world.\nname New Session\ntype command\naction QuickAdd: New TTRPG Session\n\nTABLE WITHOUT ID file.link AS &quot;Session&quot;, summary AS &quot;Summary&quot;\nWHERE contains(type, &quot;session&quot;) AND contains(campaign, &quot;&lt;%tp.file.folder(false)%&gt;&quot;) AND !contains(file.tags, &quot;#template&quot;)\nInformation about the World\n\nFactions\nTable shows a list of factions from this specific world.\nTABLE WITHOUT ID file.link AS &quot;Faction&quot;, description AS &quot;Description&quot;\nWHERE contains(type, &quot;faction&quot;) AND contains(campaign, &quot;&lt;%tp.file.folder(false)%&gt;&quot;)\n\nCustom Rules\n"},"system/templates/template.ttrpg.general":{"slug":"system/templates/template.ttrpg.general","filePath":"system/templates/template.ttrpg.general.md","title":"template.ttrpg.general","links":[],"tags":[],"content":"&lt;%tp.file.title%&gt;"},"system/templates/template.ttrpg.session":{"slug":"system/templates/template.ttrpg.session","filePath":"system/templates/template.ttrpg.session.md","title":"template.ttrpg.session","links":["tags/template"],"tags":["template"],"content":"(Note: Delete this line template )\n&lt;%tp.file.title%&gt;\nSession Summary\n\nAttendance\n\n\n\n\nLog\n\n\n"},"system/templates/template.weeknotes":{"slug":"system/templates/template.weeknotes","filePath":"system/templates/template.weeknotes.md","title":"template.weeknotes","links":[],"tags":[],"content":"Title\n\nWhat I’ve been up to\n\nCool stuff around the Web\n\nMusic"},"system/templates/template.zettle.note":{"slug":"system/templates/template.zettle.note","filePath":"system/templates/template.zettle.note.md","title":"template.zettle.note","links":[],"tags":["Seed"],"content":"{{Title}}\n\nReferences"},"system/templates/template.zettle.reference":{"slug":"system/templates/template.zettle.reference","filePath":"system/templates/template.zettle.reference.md","title":"template.zettle.reference","links":[],"tags":[],"content":""}}